-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 18, 2026 at 01:08 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `pogopartyth_v2`
--

-- --------------------------------------------------------

--
-- Table structure for table `boss_event`
--

CREATE TABLE `boss_event` (
  `id` int(11) NOT NULL,
  `boss_event_name` varchar(255) NOT NULL,
  `bage_color` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `boss_event`
--

INSERT INTO `boss_event` (`id`, `boss_event_name`, `bage_color`, `created_at`) VALUES
(1, 'GO Tour : Kalos', '#4a148c', '2026-02-27 09:28:33'),
(4, 'Raid Hour', '#f04242', '2026-03-05 02:02:15');

-- --------------------------------------------------------

--
-- Table structure for table `boss_interest`
--

CREATE TABLE `boss_interest` (
  `id` int(11) NOT NULL,
  `raid_boss_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `boss_interest`
--

INSERT INTO `boss_interest` (`id`, `raid_boss_id`, `user_id`, `created_at`) VALUES
(90, 77, 151, '2026-06-18 04:02:18'),
(93, 77, 155, '2026-06-18 07:02:10');

-- --------------------------------------------------------

--
-- Table structure for table `cancel_reasons`
--

CREATE TABLE `cancel_reasons` (
  `id` int(11) NOT NULL,
  `cancel_reasons_th` varchar(255) NOT NULL,
  `cancel_reasons_eng` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `cancel_reasons`
--

INSERT INTO `cancel_reasons` (`id`, `cancel_reasons_th`, `cancel_reasons_eng`, `created_at`) VALUES
(1, 'เปลี่ยนใจไม่ตีบอส', 'Changed my mind, not doing the raid', '2026-02-17 08:50:22'),
(2, 'บอสหมดเวลา', 'Boss, time\'s Up.', '2026-02-17 08:41:38'),
(3, 'สร้างห้องผิดพลาด', 'Room created incorrectly.', '2026-02-17 08:02:26'),
(4, 'อื่นๆ (โปรดระบุ)', 'Other (please specify)', '2026-02-17 08:02:41');

-- --------------------------------------------------------

--
-- Table structure for table `chat`
--

CREATE TABLE `chat` (
  `id` int(11) NOT NULL,
  `raid_rooms_id` int(11) NOT NULL,
  `sender` int(11) NOT NULL,
  `message` text NOT NULL,
  `read_by` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `chat`
--

INSERT INTO `chat` (`id`, `raid_rooms_id`, `sender`, `message`, `read_by`, `created_at`) VALUES
(542, 695, 135, 'ยังไงนิ', '', '2025-12-19 14:02:59'),
(546, 709, 135, 'เชิญแล้วนะครับ', '', '2025-12-20 16:00:34'),
(547, 709, 135, 'พร้อมมั้ย', '', '2025-12-20 16:00:40'),
(549, 710, 139, 'พร้อมครับ', '', '2025-12-20 22:02:50'),
(550, 714, 139, 'สวัสดีครับ', '', '2025-12-21 17:39:03'),
(551, 714, 144, 'ครับ ว่าไง', '', '2025-12-21 17:39:10'),
(552, 714, 139, 'พร้อมไหม', '', '2025-12-21 17:39:45'),
(553, 714, 144, 'พร้อม ผมเป็นหัวห้อง 555', '', '2025-12-21 17:40:02'),
(554, 714, 144, 'เป็นไงเป็นกันสิ', '', '2025-12-21 17:40:12'),
(555, 714, 139, 'งั้นก็จัดไป', '', '2025-12-21 17:40:28'),
(556, 714, 144, 'เชิญแล้วครับ', '', '2025-12-21 17:41:51'),
(559, 717, 142, 'ขอบคุณครับ', '', '2025-12-22 14:17:41'),
(560, 717, 142, 'อย่าลืมรีวิวกันด้วยนะครับ', '', '2025-12-22 14:20:20'),
(562, 718, 142, 'จาดปายย', '', '2025-12-22 15:09:01'),
(733, 901, 144, 'สวัสดีครับ', '[\"134\",\"144\",\"135\"]', '2026-02-19 09:57:54'),
(738, 917, 142, 'AvenderMasterTH', NULL, '2026-02-19 13:54:06'),
(748, 961, 148, 'จะเชิญแล้วนะครับ', '[\"134\",\"148\"]', '2026-02-23 15:26:09'),
(751, 961, 148, 'ได้ครับ', '[\"134\",\"148\"]', '2026-02-23 15:26:39'),
(780, 1040, 155, 'สวัสดีครับ', '[\"155\"]', '2026-06-18 17:06:24');

-- --------------------------------------------------------

--
-- Table structure for table `chat_friends`
--

CREATE TABLE `chat_friends` (
  `id` int(11) NOT NULL,
  `friendship_id` int(11) NOT NULL,
  `sender` int(11) NOT NULL,
  `message` text NOT NULL,
  `status` enum('read','send') NOT NULL DEFAULT 'send',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `chat_friends`
--

INSERT INTO `chat_friends` (`id`, `friendship_id`, `sender`, `message`, `status`, `created_at`) VALUES
(440, 129, 142, 'รับแอดทีครับ', 'send', '2025-12-24 06:17:36'),
(441, 129, 142, 'เทรด โปเกม่อนกันครับ', 'send', '2025-12-24 06:17:44'),
(442, 129, 142, 'สนใจไหมครับ', 'send', '2025-12-24 06:17:51');

-- --------------------------------------------------------

--
-- Table structure for table `events`
--

CREATE TABLE `events` (
  `id` int(11) NOT NULL,
  `title` varchar(500) NOT NULL,
  `description` text NOT NULL,
  `image` varchar(500) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `created_by` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `events`
--

INSERT INTO `events` (`id`, `title`, `description`, `image`, `created_at`, `created_by`) VALUES
(3, 'ลูเกียเปิดตัวไดแมกซ์เป็นครั้งแรกโดยการทะยานลงมาจากท้องฟ้า!', 'สุดสัปดาห์แบตเทิลแมกซ์ลูเกียไดแมกซ์\nวันเสาร์ที่ 29 พฤศจิกายน เวลา 06.00 น. จนถึงวันอาทิตย์ที่ 30 พฤศจิกายน 2025 เวลา 21.00 น. ตามเวลาไทย\n\nเปิดตัวไดแมกซ์!\nโปเกมอนต่อไปนี้จะเปิดตัวแบบไดแมกซ์ใน Pokémon GO ในแบตเทิลแมกซ์ห้าดาว!\n\nลูเกียไดแมกซ์*\n* หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\n\nโบนัสอีเวนต์\nโบนัสต่อไปนี้จะเปิดใช้งานในระหว่างอีเวนต์\n\nขีดจำกัดการเก็บอนุภาคแมกซ์เพิ่มขึ้นเป็น 1,600\n1/4 ระยะทางการผจญภัยเพื่อรับอนุภาคแมกซ์*\nพาวเวอร์สป็อตจะรีเฟรชถี่ขึ้น\n8× อนุภาคแมกซ์จากพาวเวอร์สป็อต\n* หากต้องการใช้โบนัสนี้ คุณจะต้องรวบรวมอนุภาคแมกซ์ทั้งหมดที่มีอยู่ในเมนูใกล้เคียงก่อน เทรนเนอร์สามารถรวบรวมอนุภาคแมกซ์ได้ผ่านเมนูใกล้เคียงทุกวันโดยการสำรวจ แอดเวนเจอร์ซิงค์จะช่วยให้แน่ใจว่าระยะทางของคุณไม่เสียเปล่า! จับตาดูเมนูใกล้เคียงเพื่อหาไอคอนที่จะปรากฏขึ้นเมื่ออนุภาคแมกซ์พร้อมให้รวบรวมแล้ว\nงานวิจัยแบบจำกัดเวลาฟรี\nเทรนเนอร์จะมีโอกาสทำงานวิจัยแบบจำกัดเวลาได้ฟรี เริ่มตั้งแต่วันอังคารที่ 25 พฤศจิกายน 2025 เวลา 06.00 น. ตามเวลาไทย\n\nทำงานวิจัยแบบจำกัดเวลาให้เสร็จสิ้นเพื่อเผชิญหน้ากับโกสไดแมกซ์เพื่อสร้างทีมต่อสู้ของคุณให้สมบูรณ์แบบ และรับมือลูเกียไดแมกซ์! ภารกิจงานวิจัยแบบจำกัดเวลาจะมอบลูกอมโกส, อนุภาคแมกซ์ และอื่น ๆ อีกมากมายเพื่อช่วยเพิ่มพลังให้กับทีมต่อสู้ของคุณ\n\nโปรดทราบว่างานวิจัยแบบจำกัดเวลามีวันหมดอายุ ภารกิจที่เกี่ยวข้องกับงานวิจัยแบบจำกัดเวลาแบบฟรีนี้จะต้องเสร็จสิ้นและต้องรับรางวัลก่อนวันอาทิตย์ที่ 30 พฤศจิกายน 2025 เวลา 21.00 น. ตามเวลาไทย', 'https://lh3.googleusercontent.com/6nqooPPkdkv8phH6h3GupRBJE5lOVlaFiOUGBRzyt5G_EKhpIga2TjmKl-xMpmMb5F1ZKWpS7ce4-QenYWgxA-Ma9LJiAvBueA=e365-pa-nu-w1920', '2025-11-25 03:47:18', 1),
(4, 'คอมมิวนิตี้เดย์: สึสึเคระ', 'คอมมิวนิตี้เดย์พฤศจิกายน 2025: สึสึเคระ\nวันอาทิตย์ที่ 30 พฤศจิกายน 2025 ตั้งแต่ 14.00 น. ถึง 17.00 น. ตามเวลาไทย\n\nโปเกมอนนกหัวขวาน สึสึเคระ จะเป็นโปเกมอนเด่นในระหว่างคอมมิวนิตี้เดย์พฤศจิกายน!\n\nโปเกมอนเด่น\nสึสึเคระจะปรากฏตัวถี่ขึ้นในธรรมชาติ*\n\nหากโชคดี อาจเจอตัวสีแตกต่างหรือตัวที่มาพร้อมกับพื้นหลังพิเศษก็ได้!\nท่าโจมตีเด่น\nวิวัฒนาการเครารัปปา (ร่างวิวัฒนาการของสึสึเคระ) ระหว่างที่มีอีเวนต์หรือภายในสี่ชั่วโมงหลังจากนั้นเพื่อรับโดเดคาบาชิซึ่งรู้จักท่าโจมตีชาร์จจะงอยปากปืนใหญ่\n\nจะงอยปากปืนใหญ่\n\nเทรนเนอร์แบตเทิล: ความแรง 110\nยิมและการตีบอส: ความแรง 125\nเนื้อเรื่องงานวิจัยพิเศษคอมมิวนิตี้เดย์\nในราคา US$1.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) คุณจะสามารถเข้าถึงงานวิจัยพิเศษเฉพาะคอมมิวนิตี้เดย์สึสึเคระ ทำงานวิจัยนี้ให้เสร็จสิ้นเพื่อรับรางวัลให้มากยิ่งขึ้น รวมถึงสิ่งต่อไปนี้:\n\nการเผชิญหน้า 3 ครั้งกับสึสึเคระที่มาพร้อมกับพื้นหลังพิเศษธีมเรื่องเล่าแห่งการแปรเปลี่ยน\nการเผชิญหน้าเพิ่มเติมกับสึสึเคระ\nบัตรแบตเทิลพรีเมียม 1 ใบ\nลูกอมประหลาด XL 1 เม็ด\nและของแถมพิเศษอีกมากมาย!\n\nมีข้อจำกัดบางประการ ไม่สามารถมอบของขวัญได้หากผู้รับซื้อตั๋วงานวิจัยพิเศษหรือเคยได้รับของขวัญนี้แล้ว\nโบนัสอีเวนต์\n3× XP จากการจับโปเกมอน\n\n2× ลูกอมจากการจับโปเกมอน\n\nโอกาส 2× สำหรับเทรนเนอร์เลเวล 31 ขึ้นไปที่จะได้รับลูกอม XL จากการจับโปเกมอน\n\nเครื่องหอม (ยกเว้นเครื่องหอมรายวัน) ที่ใช้งานระหว่างอีเวนต์จะอยู่ได้นาน 3 ชั่วโมง\n\nถ่ายสแนปช็อตสักเล็กน้อยระหว่างคอมมิวนิตี้เดย์แล้วจะเจอเซอร์ไพรส์!\n\nอุปกรณ์ปล่อยลัวร์จะอยู่ได้นาน 1 ชั่วโมง และอาจดึงดูดโปเกมอนเด่นได้*\n\nสามารถแลกเปลี่ยนพิเศษได้เพิ่ม 1 ครั้ง สูงสุดถึง 3 ครั้งสำหรับวันนั้น*\n\nการแลกเปลี่ยนจะใช้สตาร์ดัสต์น้อยลง 50%*\n\nแม้ว่าโบนัสส่วนใหญ่จะใช้งานได้เฉพาะในช่วงระยะเวลาอีเวนต์สามชั่วโมงเท่านั้น แต่โบนัสเหล่านี้จะใช้งานได้ตั้งแต่เวลา 14.00 น. ถึง 21.00 น. ตามเวลาไทย\n\nโบนัสอุปกรณ์ปล่อยลัวร์\nตั้งแต่เวลา 14.00 น. ถึง 21.00 น. ตามเวลาไทย มีโอกาสสูงมากที่สึสึเคระจะปรากฏตัวที่เสาโปเกสต็อปที่มีอุปกรณ์ปล่อยลัวร์ทั่วไปเปิดใช้งานอยู่ สึสึเคระที่ถูกดึงดูดด้วยอุปกรณ์ปล่อยลัวร์ทั่วไปจะยังคงมีโอกาสเพิ่มขึ้นที่จะเป็นตัวสีแตกต่างและอาจมาพร้อมกับพื้นหลังพิเศษ นั่นหมายถึงโอกาสเพิ่มขึ้นที่จะได้เผชิญหน้ากับโปเกมอนเด่น แม้หลังจากเวลาอีเวนต์สิ้นสุดลง!', 'https://lh3.googleusercontent.com/bVcxjBqEJkt88b0bzoS31eSgv4moi__O2_rDrZW-J7BjSpGCgaGxJSpSBP91mkCrO0dPR-XeWjyGOGqlL9FKOaV9prBmnINFoQ=e365-pa-nu-w1920', '2025-11-25 03:49:26', 1),
(5, 'ปิดท้ายเรื่องเล่าแห่งการแปรเปลี่ยนด้วยอีเวนต์ช่วงเวลาแห่งศึกชี้ชะตา, ร่างแน่วแน่ของเคลดิโอ และการเปิดตัวสีแตกต่างของเคลดิโอ!', 'สรุปอีเวนต์: ช่วงเวลาแห่งศึกชี้ชะตา\nระยะเวลา: 25 - 30 พ.ย. 2025 (10.00 - 20.00 น.)\nไฮไลท์สำคัญ:\n- เปิดตัว เคลดิโอ (ร่างแน่วแน่) ครั้งแรก\n- วิธีเปลี่ยนร่าง: ใช้ลูกอมเคลดิโอ 50 เม็ด (ปลดล็อกผ่านงานวิจัยพิเศษส่วนสุดท้าย)\n- ท่าพิเศษ: เรียนรู้ท่า \"ดาบลึกลับ\" (Secret Sword)\nหมายเหตุ: ต้องกดรับงานวิจัยพิเศษภายใน 2 ธ.ค. 2025 (10.00 น.)', 'https://lh3.googleusercontent.com/V1RFaeLq3H8dCjoHfgThoVHecJijY-JLVtln5N_g6dPbqu5Xb8GK3XIB6KjvXZeo_yfNqsUusl3bcUKK2jyMRmdM-tXwVq1OB8Sn=e365-pa-nu-w1920', '2025-11-25 06:16:12', 1),
(6, 'อัปเดตโกแบตเทิลลีก: เส้นทางล่าสมบัติ', 'โกแบตเทิลลีก: เส้นทางล่าสมบัติ จะเริ่มขึ้นในวันอังคารที่ 2 ธันวาคม 2025 เวลา 13.00 น. PDT (GMT −7)\nสิ่งต่อไปนี้จะเกิดขึ้นในช่วงต้นฤดูกาล\nรับรางวัลเมื่อสิ้นสุดฤดูกาลได้ในหน้าจอการต่อสู้\nระดับโกแบตเทิลลีกของคุณจะถูกรีเซ็ต\nข้อกำหนดในการเพิ่มระดับจะยังคงเหมือนกับในฤดูกาลก่อนหน้า\nกำหนดการโกแบตเทิลลีก: เส้นทางล่าสมบัติ\nลีกต่อไปนี้จะเริ่มและสิ้นสุดเวลา 13.00 น. PDT (GMT −7) ตามวันที่ด้านล่างนี้', 'https://lh3.googleusercontent.com/RWNG582mmAJV1F1RbAkkOS9FkiO-4dW2Q0v7-XlssV4ztIOR3qySldKcweMYLRmVf2c4M3LfAa0sPd2JeE3zMaG_rVK1qJiiwYvQ=e365-pa-nu-w1920', '2025-12-02 04:04:59', 1),
(7, 'ออกเดินทางสู่การผจญภัยในพัลเดียในอีเวนต์ การเดินทางในภูมิภาคพัลเดีย!', 'อีเวนต์ภูมิภาคพัลเดียจัดวันที่ 2–9 ธ.ค. 2025 พร้อมเปิดตัวโคจีโอ ไลน์วิวัฒนาการครบ\nโบนัส: 2× XP ตีบอส, 2× XP วิวัฒนาการ และโอกาสเจอโยกิราส/ทัทซึเบสีแตกต่างเพิ่มขึ้น\nเผชิญหน้าในธรรมชาติใหม่ เช่น มาเมะบัตตะ พาโม มินีฟ และมีวันสลับโปเกมอนเด่น\nตีบอส 3 ดาวมีเคนเทารอสพัลเดียทุกร่าง, โอโตชิโดริ และเฮรัชเชอร์\nมีงานวิจัยภาคสนาม, คำท้านักสะสม และงานวิจัยจำกัดเวลาแบบเสียเงิน (รางวัลสตาร์ดัสต์/พรีเมียมพาส/เจอโปเกมอนธีม)', 'https://lh3.googleusercontent.com/6VWnagFi2rsW0vaNLVWFLdpEpJla0YlutIqenhRWflYI8l05LDAmrA79t7QLLcYhYwUZCejY-_Dam5XIgoH9At9184MnlB-KAJfP=e365-pa-nu-w1920', '2025-12-02 04:08:18', 1),
(8, 'พัลเกียและเครื่องฟักไข่จำกัดเวลากลับมาอีกครั้งในบัตรผ่าน GO: ธันวาคม!', 'บัตรผ่าน GO: ธันวาคม เปิดใช้งาน 2 ธ.ค. 2025–6 ม.ค. 2026 และสามารถเก็บแต้มได้ไม่จำกัดในวันที่ 3–4 ม.ค.\nอัปเกรดเป็น GO Deluxe ราคา $7.99 หรือ Deluxe + 10 ระดับ ราคา $9.99 เพื่อรับรางวัลมากขึ้นและเลื่อนระดับไวขึ้น\nซื้อผ่าน Web Store จะได้ของขวัญเพิ่ม เช่น ไฮเปอร์บอล, ยาคืนชีพ, พรีเมียมพาส และกล่องใหญ่พิเศษแบบเฉพาะเว็บ\nรางวัลรวม: เผชิญหน้าพัลเกีย, สตาร์ดัสต์, XP, อนุภาคแมกซ์ และไอเท็มพรีเมียม พร้อมโบนัสเมื่อถึงระดับ 25/50/75\nGO Deluxe มีเครื่องฟักไข่จำกัดเวลาที่ใช้ไม่จำกัดจนถึง 13 ม.ค. 2026 และโบนัสเปิด/รับของขวัญมากกว่าเวอร์ชันฟรี', 'https://lh3.googleusercontent.com/5lezZDzzpWfYHX-jkeY29-bBUlKDam8g4Hv7TSJ0JJX0z0vjbW62FSqhTnZxyc8_LeoM0fD6Ri85YUzFAPIoiw9NZV2k6MsfbBpE=e365-pa-nu-w1920', '2025-12-02 04:09:33', 1),
(9, 'ฝึกฝนและรับมือกับคำท้าสำหรับทั่วโลกในระหว่างอีเวนต์ ออกหมัดแล้วเตะ!', 'อีเวนต์ “ออกหมัดแล้วเตะ” จัดวันที่ 11–16 ธ.ค. 2025 พร้อมโบนัส 2× ลูกอมจับโปเกมอน และโอกาสเจอซาวามูลาร์/เอบิวาลาร์ไดแมกซ์สีแตกต่างเพิ่มขึ้น\nมีคำท้าทั่วโลก: ทำแบตเทิลแมกซ์รวมให้ครบเพื่อปลดล็อกทาทักโกะ (เปิดตัวใหม่), โคโจฟู/จาราโคธรรมชาติ, และลูกอมเพิ่มจากแมกซ์\nโปเกมอนธรรมชาติเด่นได้แก่ เนียวโรโมะ, วันริกี, มาคุโนชิตะ และออคตัน (มีโอกาสสีแตกต่าง)\nงานวิจัยภาคสนามให้ TM ต่าง ๆ และการเจอซาวามูลาร์/เอบิวาลาร์ไดแมกซ์\nงานวิจัยจำกัดเวลาแบบเสียเงินราคา $1.99 มีรางวัลลูกอมประหลาด, ลูกอม XL, อนุภาคแมกซ์ และต้องทำให้เสร็จภายใน 16 ธ.ค. 2025', 'https://lh3.googleusercontent.com/ksuG-r5m6PVf9_6ksXCfcB50tGNX63FkA3lFM4Jaka0KpXIbqvvKikuOELd4gcZv4a8X87crL2Aq4gMuX-gZAV2LfE7-1iZSyA=e365-pa-nu-w1920', '2025-12-02 04:11:16', 1),
(10, 'คาบิกอนกิกะแมกซ์กลับมาอีกครั้งในวันแบตเทิลแมกซ์ส่งท้ายปี!', 'วันแบตเทิลแมกซ์คาบิกอนกิกะแมกซ์\nวันอาทิตย์ที่ 14 ธันวาคม 2025 ตั้งแต่ 14.00 น. ถึง 17.00 น. ตามเวลาไทย\n\nโปเกมอนเด่น\nคาบิกอนกิกะแมกซ์*\n\nหากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nโบนัสอีเวนต์\nโบนัสต่อไปนี้จะเปิดใช้งานในระหว่างอีเวนต์\n\nขีดจำกัดการเก็บอนุภาคแมกซ์เพิ่มขึ้นเป็น 1,600\nพาวเวอร์สป็อตทั้งหมดจะมีแบตเทิลกิกะแมกซ์\nพาวเวอร์สป็อตจะรีเฟรชถี่ขึ้น\n8× อนุภาคแมกซ์จากพาวเวอร์สป็อต\nแลกเปลี่ยนแบบพิเศษเพิ่มเติม 2 ครั้ง\nตั้งแต่วันที่ 14 ธันวาคม เวลา 08.00 น. ถึงวันที่ 15 ธันวาคม เวลา 11.00 น. ตามเวลาไทย ขีดจำกัดตีบอสระยะไกลรายวันจะเพิ่มจาก 10 ครั้งเป็น 20 ครั้ง\nโบนัสต่อไปนี้จะเปิดใช้งานในวันที่ 14 ธันวาคม 2025 ตั้งแต่เวลา 00.00 น. ถึง 17.00 น. ตามเวลาไทย\n\n2× อนุภาคแมกซ์จากการสำรวจ*\n\n1/4 ระยะทางการผจญภัยเพื่อรับอนุภาคแมกซ์*\n\nคุณสามารถรวบรวมอนุภาคแมกซ์ทั้งหมดที่มีอยู่ในเมนูใกล้เคียงก่อน เทรนเนอร์สามารถรวบรวมอนุภาคแมกซ์ได้ผ่านเมนูใกล้เคียงทุกวันโดยการสำรวจ แอดเวนเจอร์ซิงค์จะช่วยให้แน่ใจว่าระยะทางของคุณไม่เสียเปล่า! จับตาดูเมนูใกล้เคียงเพื่อหาไอคอนที่จะปรากฏขึ้นเมื่ออนุภาคแมกซ์พร้อมให้รวบรวมแล้ว\n\nหากต้องการใช้โบนัสเหล่านี้ คุณจะต้องรวบรวมอนุภาคแมกซ์ทั้งหมดที่มีอยู่ในเมนูใกล้เคียงก่อน\n\nงานวิจัยแบบจำกัดเวลา\nจะมีงานวิจัยแบบจำกัดเวลาที่จะนำไปสู่อีเวนต์\n\nทำงานวิจัยแบบจำกัดเวลาให้เสร็จสิ้นเพื่อเผชิญหน้ากับโปเกมอนไดแมกซ์ ซึ่งเป็นคู่แข่งที่แข็งแกร่งในการต่อสู้กับคาบิกอนกิกะแมกซ์! ภารกิจเหล่านี้จะมอบลูกอมและอนุภาคแมกซ์เพื่อช่วยเสริมพลังให้กับทีมของคุณ\n\n8 ธันวาคม เวลา 06.00 น. – 14 ธันวาคม เวลา 17.00 น. ตามเวลาไทย**\nวันริกีไดแมกซ์*\n\nหากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nตั๋วอีเวนต์\nในราคา US$4.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) คุณจะสามารถเข้าถึงงานวิจัยแบบจำกัดเวลาเฉพาะอีเวนต์\n\nงานวิจัยแบบจำกัดเวลารวมถึงสิ่งต่อไปนี้\n\nไดมัชรูม 1 อัน\n25,000 XP\nคุณจะได้รับโบนัสต่อไปนี้ด้วย\n\n2× XP จากแบตเทิลแมกซ์\nขีดจำกัดการรวบรวมอนุภาคแมกซ์เพิ่มเป็น 5,600\nงานวิจัยแบบจำกัดเวลานี้จะมีผลในวันอาทิตย์ที่ 14 ธันวาคม 2025 ตั้งแต่ 14.00 น. ถึง 17.00 น. ตามเวลาไทย\n\nเทรนเนอร์ทุกคนจะสามารถซื้อและมอบตั๋วเป็นของขวัญให้กับเพื่อน Pokémon GO ที่มีระดับความสนิทสนมเป็นเพื่อนสนิทขึ้นไปอีกด้วย โปรดทราบว่าการซื้อ—รวมถึงการซื้อให้เทรนเนอร์คนอื่น—ไม่สามารถขอคืนเงินได้ (ขึ้นอยู่กับกฎหมายที่บังคับใช้และข้อยกเว้นที่กำหนดไว้ในข้อกำหนดในการให้บริการ) ไม่สามารถใช้โปเกคอยน์ซื้อตั๋วได้\n\nโปรดทราบว่าตั๋วจะวางจำหน่ายเฉพาะในร้านค้าในเกมเท่านั้น จนถึงวันอาทิตย์ที่ 14 ธันวาคม 2025 เวลา 17.00 น. ตามเวลาไทย\n\nการนัดเข้าร่วม (RSVP) แบตเทิลกิกะแมกซ์\nประสานงานกับเพื่อน, ครอบครัว และเทรนเนอร์คนอื่น ๆ ในชุมชนของคุณ และทั่วโลกได้ง่ายขึ้น เพื่อร่วมสนุกในการตีบอสและแบตเทิลกิกะแมกซ์ด้วยกัน!\n\nไปที่โพสต์บล็อกนัดเข้าร่วม (RSVP) เพื่อเรียนรู้เพิ่มเติมเกี่ยวกับฟีเจอร์นี้!\n\nเพิ่มโอกาสให้เต็มแมกซ์เพื่อชัยชนะด้วย Campfire!\nCampfire ทำให้การค้นหาแบตเทิลแมกซ์และเทรนเนอร์อื่น ๆ เป็นเรื่องง่ายกว่าที่เคย และจะช่วยให้คุณเอาชนะพวกมันได้ ดูกิจกรรมแบตเทิลแมกซ์และไฟที่อยู่ใกล้เคียงภายใน Pokémon GO ได้โดยแตะไอคอนสีเขียวใต้เข็มทิศที่มุมขวาบนของมุมมองแผนที่ และตรวจสอบการพบปะออนไลน์บนแผนที่ Campfire!\n\nPokemon GO Web Store - กล่องตั๋วชั้นยอดสุดสัปดาห์แบตเทิลแมกซ์คาบิกอนกิกะแมกซ์\nกล่องตั๋วชั้นยอดสุดสัปดาห์แบตเทิลแมกซ์คาบิกอนกิกะแมกซ์จะวางจำหน่ายในราคา US$4.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) และประกอบด้วยตั๋วอีเวนต์และโบนัสบัตรแบตเทิลพรีเมีย!\n\nตรวจสอบได้ใน Pokémon GO Web Store!\n\nไดมัชรูม\nไดมัชรูมเป็นไอเท็มที่เพิ่มแดเมจทั้งหมดที่โปเกมอนไดแมกซ์และกิกะแมกซ์สร้างในแบตเทิลแมกซ์เป็นสองเท่าชั่วคราว สามารถใช้ไดมัชรูมหลายชิ้นติดต่อกันเพื่อเพิ่มระยะเวลาของเอฟเฟกต์ได้ แต่จะไม่เพิ่มตัวคูณแดเมจ\n\nคุณสามารถใช้ไดมัชรูมจากกระเป๋าเก็บไอเท็มของคุณได้ในขณะที่อยู่ในล็อบบี้แบตเทิลแมกซ์ นอกจากนี้ คุณยังสามารถดูได้ว่าเทรนเนอร์คนอื่นในล็อบบี้ได้เปิดใช้งานไดมัชรูมแล้วหรือไม่', 'https://lh3.googleusercontent.com/y7aZmUU4GcZTYGUv7JEMP_ACZ1fXq1bVP9xPkjhxE852n8xAYGjSxFa-bIZRNGVOVQoRhcRyNIZdeROlltDxyhdTjWHm8xsmB_c=e365-pa-nu-w1920', '2025-12-09 02:03:07', 1),
(11, 'ร่วมฉลองวันหยุดกับโปเกมอนสวมชุดคอสตูมใหม่ในระหว่างวินเทอร์ฮอลิเดย์ - 1!', 'วินเทอร์ฮอลิเดย์ - 1\nวันพฤหัสที่ 18 ธันวาคม เวลา 10.00 น. ถึงวันพุธที่ 24 ธันวาคม 2025 เวลา 10.00 น. ตามเวลาไทย\n\nโปเกมอนเปิดตัวใหม่\nโปเกมอนในชุดคอสตูมใหม่จะปรากฏตัวระหว่างอีเวนต์นี้!\n\nอุซกกีสวมชุดฮอลิเดย์*\nเด็นจิมูชิสวมชุดฮอลิเดย์*\nคุวากานอนสวมชุดฮอลิเดย์^\n\nหากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\n^ในขณะที่คุณอยู่ใกล้กับอุปกรณ์ปล่อยลัวร์แม่เหล็กที่ทำงานอยู่ คุณสามารถใช้ลูกอมอโกจิมูชิ 100 เม็ดเพื่อวิวัฒนาการ เด็นจิมูชิสวมชุดฮอลิเดย์ เป็น คุวากานอนสวมชุดฮอลิเดย์\nโบนัสอีเวนต์\nโอกาสเพิ่มขึ้นที่จะฟัก สีแตกต่างพิชูสวมหมวกซานต้า และคูมะชุนติดโบออกจากไข่ 7 กม.\nนอกจากนี้ บรรลุความสำเร็จขั้นใหญ่ในบัตรผ่าน GO: วินเทอร์ฮอลิเดย์ 2025 เพื่อปลดล็อกโบนัสต่อไปนี้\n\nTier 1\n\n2× XP จากการส่งของขวัญ\nบัตรผ่าน GO Deluxe: 2× สตาร์ดัสต์จากการเปิดของขวัญ\nTier 2\n\nอาจได้รับไอเท็มเป็นรางวัลเพิ่มเติมจากการเปิดของขวัญ\nบัตรผ่าน GO Deluxe: ระยะทางฟักไข่ 1/2 เมื่อไข่ถูกวางไว้ในเครื่องฟักไข่ระหว่างช่วงเวลาอีเวนต์\nTier 3\n\nXP เพิ่มอีก 50% สำหรับการชนะแบตเทิลตีบอส\nบัตรผ่าน GO Deluxe: 2× XP จากการจับโปเกมอน\nเผชิญหน้าในธรรมชาติ\nคุณอาจได้เผชิญหน้ากับโปเกมอนธีมอีเวนต์ในธรรมชาติ รวมถึง อุริมู*, ยูกิวาราชิ*, ทามาซาราชิ* และโปเกมอนอื่น ๆ อีกมากมาย! และอาจได้เผชิญหน้ากับ อุซกกีสวมชุดฮอลิเดย์* และ เด็นจิมูชิสวมชุดฮอลิเดย์*!\n\n*หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nไข่\nโปเกมอนต่อไปนี้จะฟักออกจากไข่ 7 กม.\n\nพิชูสวมหมวกซานต้า*\nมุจูล*\nคูมะชุนติดโบ*\nฟรีจิโอ*\nยูกิฮามิ\n\n* หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nตีบอส\nโปเกมอนต่อไปนี้จะปรากฏตัวในการตีบอส\n\nตีบอสสามดาว\nอุซกกีสวมชุดฮอลิเดย์*\nเครเบส (ร่างฮิซุย)*\nเด็นจิมูชิสวมชุดฮอลิเดย์*\n\n*หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nไอเท็มอวาตาร์ใหม่\nสามารถซื้อไอเท็มอวาตาร์ต่อไปนี้ได้จากร้านค้าในเกมระหว่างอีเวนต์นี้ และจะยังคงซื้อได้หลังจากอีเวนต์สิ้นสุดลงแล้ว!\n\nกระเป๋าเด็นจิมูชิ\nเสื้อไหมพรมฮอลิเดย์อุซกกี\n\n\nการเผชิญหน้างานวิจัยภาคสนาม\nภารกิจงานวิจัยภาคสนามธีมอีเวนต์จะพร้อมให้ใช้งาน\n\nทำภารกิจงานวิจัยภาคสนามให้เสร็จสิ้นเพื่อรับสตาร์ดัสต์และการเผชิญหน้ากับโปเกมอนธีมอีเวนต์\n\nบัตรผ่าน GO: วินเทอร์ฮอลิเดย์ 2025\nตั้งแต่วันพฤหัสที่ 18 ธันวาคม เวลา 10.00 น. ถึงวันจันทร์ที่ 29 ธันวาคม 2025 เวลา 20.00 น. ตามเวลาไทย บัตรผ่าน GO และบัตรผ่าน GO Deluxe สำหรับวินเทอร์ฮอลิเดย์ - 1 และ 2 ที่มาใหม่จะวางจำหน่ายใน Pokémon GO!\n\nบัตรผ่าน GO และบัตรผ่าน GO Deluxe\nบัตรผ่าน GO คือแทร็กความคืบหน้าฟรีแบบจำกัดเวลาที่เปิดให้ใช้งานในช่วงระยะเวลาที่กำหนด การเก็บแต้ม GO จะช่วยให้เพิ่มระดับเพื่อรับรางวัล\n\nเทรนเนอร์จะได้รับบัตรผ่าน GO: วินเทอร์ฮอลิเดย์ 2025 โดยอัตโนมัติในวันพฤหัสที่ 18 ธันวาคม เวลา 10.00 น. ตามเวลาไทย คุณสามารถเก็บสะสมแต้ม GO และเลื่อนระดับเพื่อรับรางวัลเพิ่มเติมได้จนถึงวันจันทร์ที่ 29 ธันวาคม 2025 เวลา 20.00 น. ตามเวลาไทย\n\nในราคา US$7.99* คุณสามารถอัปเกรดเป็นบัตรผ่าน GO Deluxe ซึ่งเป็นเวอร์ชันเสียเงินของบัตรผ่าน GO ที่มอบรางวัลที่อัปเกรดขึ้นและความคืบหน้าที่รวดเร็วยิ่งขึ้น\n\nในราคา US$9.99* คุณสามารถอัปเกรดเป็นบัตรผ่าน GO Deluxe + 10 ระดับเพื่อรับแต้ม GO มากพอที่จะไปถึงระดับ 11 โดยอัตโนมัติ\n\nในขณะที่กำลังคืบหน้าผ่านบัตรผ่าน GO Deluxe คุณจะสามารถรับรางวัลทั้งหมดจากทั้งบัตรผ่าน GO ฟรีและบัตรผ่าน GO Deluxe คุณสามารถอัปเกรดเป็นบัตรผ่าน GO Deluxe ได้ตลอดเวลาและยังรับรางวัลจากระดับที่เคยปลดล็อกไว้ก่อนหน้านี้ได้อีกด้วย\n\nรางวัลที่ปลดล็อกในบัตรผ่าน GO จะหมดอายุในวันจันทร์ที่ 29 ธันวาคม 2025 เวลา 23.59 น. ตามเวลาไทย ดังนั้นอย่าลืมรับรางวัลของคุณก่อนที่รางวัลจะหายไป!\n\n* ราคาทั้งหมดที่ระบุไว้เป็นหน่วยดอลลาร์สหรัฐหรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ\nโปเกมอนเด่นและรางวัล\nทำภารกิจบัตรผ่านให้เสร็จสิ้นเพื่อเลื่อนระดับบัตรผ่าน GO ของคุณแล้วรับรางวัลต่อไปนี้\n\nการเผชิญหน้ากับยูกิฮามิ\nการเผชิญหน้ากับโปเกมอนธีมอีเวนต์\nสตาร์ดัสต์\nXP\nมอนสเตอร์บอล\nลูกอม\nและของแถมอีกมากมาย!\nเทรนเนอร์ที่อัปเกรดเป็นบัตรผ่าน GO Deluxe จะได้รับรางวัลต่อไปนี้ด้วย\n\nหมวกไหมพรมยูกิฮามิ\nการเผชิญหน้าเพิ่มเติมกับโปเกมอนธีมอีเวนต์เพิ่มเติม!\nบัตรแบตเทิลพรีเมียม\nลูกอมประหลาด XL\nลูกอม XL\nและของแถมอีกมากมาย!\n\nPokémon GO Web Store\nบัตรผ่าน GO Deluxe คือบัตรผ่าน GO เวอร์ชันเสียเงิน สามารถซื้อได้ใน Pokémon GO Web Store แล้ว! บัตรผ่าน GO Deluxe ของคุณที่ซื้อผ่าน Pokémon GO Web Store จะเปิดใช้งานทันทีที่บัตรผ่าน GO เริ่มต้น\n\nเทรนเนอร์ที่อัปเกรดเป็น บัตรผ่าน GO Deluxe: วินเทอร์ฮอลิเดย์ 2025 หรือ บัตรผ่าน GO Deluxe: วินเทอร์ฮอลิเดย์ 2025 + 10 ระดับ ใน Pokémon GO Web Store จะได้รับไฮเปอร์บอล 10 ลูก, ยาคืนชีพชั้นยอด 5 ชิ้น, บัตรแบตเทิลพรีเมียม 1 ใบ และยาฟื้นพลังกายเต็มถัง 5 ชิ้นเป็นของขวัญจากการซื้อ\n\nหรือตุนของจำเป็นไว้พร้อม ๆ กับการอัปเกรดของคุณด้วย กล่องไฮเปอร์บัตรผ่าน GO Deluxe: วินเทอร์ฮอลิเดย์ 2025 + 10 ระดับ พิเศษเฉพาะบนเว็บ ซึ่งรวมถึงไฮเปอร์บอล 20 ลูก, ยาคืนชีพชั้นยอด 10 ชิ้น, ยาฟื้นพลังกายเต็มถัง 10 ชิ้น, บัตรแบตเทิลพรีเมียม 2 ใบ, เครื่องฟักไข่ 1 เครื่อง และเครื่องฟักไข่ชั้นเยี่ยม 1 เครื่องเป็นของขวัญเมื่อซื้อสินค้า!', 'https://lh3.googleusercontent.com/1XIa5cjHtAIl_GCzuw7_nsCYqjYcc0Gt-4mV7J4ECyq9ekwgDRmGssQruUuTyF8dzvh6yhglOe14WZinrNR8TW9H4GINI2qg72Y=e365-pa-nu-w1920', '2025-12-09 02:04:09', 1),
(12, 'แลกเปลี่ยนระยะไกลกับ \"เพื่อนแท้ตลอดไป\"!', 'ระดับมิตร \"เพื่อนแท้ตลอดไป\" และการ \"แลกเปลี่ยนระยะไกล\" จะเริ่มเปิดให้ใช้ทีละขั้น เริ่มตั้งแต่วันจันทร์ที่ 8 ธันวาคม 2025 (ตามเวลาแปซิฟิค) โดยเริ่มจากที่นิวซีแลนด์ เราจะแจ้งรายละเอียดเพิ่มเติมอีกครั้งเมื่อฟีเจอร์นี้เปิดให้เล่นได้ทั่วโลกหลังจากนี้ คอยติดตามนะ!\nเทรนเนอร์ทุกท่าน\n\nเตรียมตัวเพิ่มระดับมิตรภาพใน Pokémon GO ได้เลย! ทุกคนจะสามารถเพิ่มระดับของมิตรภาพขั้นใหม่ล่าสุด นั่นก็คือ “เพื่อนแท้ตลอดไป” เมื่อคุณกลายเป็น”เพื่อนแท้ตลอดไป”แล้ว คุณจะสามารถ “แลกเปลี่ยนระยะไกล” ซึ่งคุณสามารถใช้เพื่อแลกเปลี่ยนโปเกมอนกับเพื่อนคนนั้นได้จากทุกที่!\n\nเป็น \"เพื่อนแท้ตลอดไป\"\nเทรนเนอร์ทุกท่านสามารถบรรลุระดับมิตรภาพใหม่ได้แล้ว…”เพื่อนแท้ตลอดไป”! ระดับมิตรภาพใหม่ที่สูงขึ้นนี้ (เหนือกว่าระดับเพื่อนแท้) จะมอบรางวัลและ XP พร้อมสิทธิพิเศษใหม่สองอย่าง\n\nเมื่อคุณกลายเป็น “เพื่อนแท้ตลอดไป” กับเทรนเนอร์อื่น คุณจะสามารถแลกเปลี่ยนระยะไกลร่วมกันได้!\nคุณสามารถร่วมสนุกกับ “เพื่อนแท้ตลอดไป” ของคุณเพื่อรับแต้มมิตรภาพได้เรื่อย ๆ ยิ่งสะสมแต้มมิตรภาพได้มากเท่าไหร่ ก็ยิ่งได้รับรางวัลมากขึ้นเท่านั้น รวมถึง XP และแลกเปลี่ยนระยะไกลเพิ่มเติม แต่โปรดทราบว่าเทรนเนอร์แต่ละคนสามารถ “แลกเปลี่ยนระยะไกล” ได้เพียงครั้งเดียวกับ “เพื่อนแท้ตลอดไป” แต่ละคน ดังนั้นควรพิจารณาการแลกเปลี่ยนให้ดีก่อนที่จะสะสมแต้มมิตรภาพได้มากพอสำหรับการแลกเปลี่ยนครั้งต่อไป\nสำหรับข้อมูลเพิ่มเติม โปรดดูบทความศูนย์ช่วยเหลือ Pokémon GO เกี่ยวกับรายชื่อเพื่อนและระดับมิตรภาพ\n\nแต้มมิตรภาพ\nแต้มมิตรภาพเป็นวิธีใหม่ในการติดตามความคืบหน้าของมิตรภาพกับเทรนเนอร์คนอื่น ๆ เทรนเนอร์ทุกท่านสามารถรับแต้มมิตรภาพได้สูงสุด 1 แต้มต่อวันกับเพื่อนแต่ละคน โดยการแบตเทิล แลกเปลี่ยน ส่งของขวัญ หรือทำกิจกรรมอื่น ๆ ร่วมกัน\n\nนอกจากนี้ คุณยังสามารถรับแต้มมิตรภาพเพิ่มเติมได้จากการทำคำท้ารายสัปดาห์ร่วมกัน\n\nสำหรับข้อมูลเพิ่มเติม โปรดดูบทความศูนย์ช่วยเหลือ Pokémon GO เกี่ยวกับรายชื่อเพื่อนและระดับมิตรภาพ\n\nแลกเปลี่ยนระยะไกล\nเพื่อเตรียมพร้อมสำหรับการ “แลกเปลี่ยนระยะไกล” ครั้งแรกของคุณ คุณจะถูกขอให้ใช้แท็กแลกเปลี่ยนระยะไกลพิเศษเพื่อทำเครื่องหมายโปเกมอนที่คุณยินดีจะแลกเปลี่ยนกับ”เพื่อนแท้ตลอดไป”ของคุณ เมื่อคุณกลายเป็น”เพื่อนแท้ตลอดไป”กับใครคนหนึ่งแล้ว ทั้งสองคนจะสามารถเห็นโปเกมอนที่อีกฝ่ายได้ทำเครื่องหมายไว้ด้วยแท็กแลกเปลี่ยนระยะไกล ซึ่งก็คือโปเกมอนที่พวกเขายินดีจะแลกเปลี่ยน\n\nหากต้องการเริ่มต้นการ “แลกเปลี่ยนระยะไกล” เทรนเนอร์แต่ละคนจะผลัดกันเลือกโปเกมอนที่เพื่อนของตนติดแท็กไว้สูงสุด 3 ตัว “รายชื่อโปเกมอนที่ต้องการ” นี้จะถูกส่งไปให้เทรนเนอร์อีกคน เทรนเนอร์แต่ละคนจะเลือกโปเกมอนที่เพื่อนขอมา 1 ตัวเพื่อมอบให้กับอีกฝ่าย จากนั้นเทรนเนอร์ทั้งสองจะตรวจสอบข้อเสนอสุดท้ายและมีสิทธิ์ยืนยันหรือยกเลิก ตลอดกระบวนการ “แลกเปลี่ยนระยะไกล” เทรนเนอร์แต่ละคนมีตัวเลือกที่จะปฏิเสธคำขอปัจจุบันและเริ่มกระบวนการใหม่\n\nหากพวกคุณเป็นเพื่อนนำโชคของกันและกัน การแลกเปลี่ยนครั้งต่อไปจะเป็นการแลกเปลี่ยนนำโชค แม้ว่าจะเป็นการ “แลกเปลี่ยนระยะไกล” ก็ตาม!* และการแลกเปลี่ยนระยะไกลจะไม่นับเป็นการแลกเปลี่ยนแบบพิเศษ ไม่ว่าจะแลกเปลี่ยนโปเกมอนตัวใดก็ตาม\n\nโปเกมอนต่อไปนี้จะไม่นับรวมในการ “แลกเปลี่ยนระยะไกล”\n\nโปเกมอนที่จับได้ในช่วง 30 วันที่ผ่านมา\nโปเกมอนที่เคยแลกเปลี่ยนมาก่อน\nโปเกมอนชาโดว์\nโปเกมอนมายา\nโปเกมอนป้องกันยิมหรือพาวเวอร์สป็อต\nโปเกมอนที่ปัจจุบันถูกตั้งเป็นคู่หูของคุณ\nโปเกมอนที่วิวัฒนาการเมก้าอยู่\nโปเกมอนรวมร่าง\nซาเชียน (ราชาแห่งดาบ) และซามาเซนตา (ราชาแห่งโล่)\nโปเกมอนที่ถูกวางไว้ที่สนามเด็กเล่นโปเกมอน\nสำหรับข้อมูลเพิ่มเติม โปรดดูบทความศูนย์ช่วยเหลือ Pokémon GO เกี่ยวกับการแลกเปลี่ยนโปเกมอน\n\nเมื่อคุณได้รับโปเกมอนนำโชคจากการ “แลกเปลี่ยนระยะไกล” แล้ว คุณจะเลิกเป็นเพื่อนนำโชคกัน\nคำท้ารายสัปดาห์\nคำท้ารายสัปดาห์จะให้โอกาสคุณได้รวมทีมกับเทรนเนอร์คนอื่น ๆ สูงสุด 3 คนจากรายชื่อเพื่อนของคุณ ไม่ว่าพวกเขาจะอยู่ที่ไหนก็ตาม เพื่อรับคำท้าแบบกลุ่มในแต่ละสัปดาห์ คุณสามารถรับรางวัลมากมาย รวมถึง XP และแต้มมิตรภาพเพิ่มเติม\n\nการอัปเดตเพิ่มเติม\nจำนวนเพื่อนสูงสุดจะเพิ่มจาก 450 เป็น 650 ภายในไม่กี่สัปดาห์ข้างหน้า โดยจะเพิ่มครั้งละ 50 คน\nงานวิจัยแบบจำกัดเวลา\nเทรนเนอร์จะมีโอกาสทำงานวิจัยแบบจำกัดเวลาได้ฟรี เริ่มตั้งแต่วันจันทร์ที่ 15 ธันวาคม เวลา 10.00 น. ถึงวันจันทร์ที่ 29 ธันวาคม 2025 เวลา 20.00 น. ตามเวลาไทย\n\nทำงานวิจัยแบบจำกัดเวลาให้เสร็จสิ้นเพื่อเผชิญหน้ากับโคฟูคิมูชิ ภารกิจงานวิจัยแบบจำกัดเวลาจะมอบ XP, สตาร์ดัสต์ และอื่น ๆ อีกมากมาย!\n\nโปรดทราบว่างานวิจัยแบบจำกัดเวลามีวันหมดอายุ ภารกิจที่เกี่ยวข้องกับงานวิจัยแบบจำกัดเวลานี้จะต้องเสร็จสิ้นและต้องรับรางวัลก่อนวันอาทิตย์ที่ 4 มกราคม 2026 เวลา 20.00 น. ตามเวลาไทย', 'https://lh3.googleusercontent.com/OYTYug-CJl0JMIub38A44t8hl9P-L53EnN9em75K17kxFiqaQMqkYe0UbaWi37WWI_jXMTQ5b5lts0amqyiARnBmanq4_TXy4vU=e365-pa-nu-w1920', '2025-12-09 02:09:44', 1),
(13, 'เตรียมพบกับงานวิจัยนภาไพศาลสุดเจ๋งทางดาราศาสตร์!', 'งานวิจัยนภาไพศาล\nวันเสาร์ที่ 20 ธันวาคม 2025 ตั้งแต่ 14.00 น. ถึง 17.00 น. ตามเวลาไทย\n\nโปเกมอนเด่น\nภารกิจงานวิจัยภาคสนามธีมอีเวนต์จะมอบรางวัลการเผชิญหน้ากับโปเกมอนเด่น!\n\nลูนาโทน*\nโซลร็อก*\n* คุณจะมีโอกาสเจอตัวสีแตกต่างมากขึ้น!\nงานวิจัยภาคสนาม\nงานวิจัยภาคสนามเฉพาะอีเวนต์ที่มอบการเผชิญหน้ากับลูนาโทน* หรือโซลร็อก* จะพร้อมให้ใช้งานในระหว่างงานวิจัยนภาไพศาล!\n\nโปรดทราบว่างานวิจัยภาคสนามจากเสาโปเกสต็อปจะมีการรีเฟรชโดยเริ่มตั้งแต่เวลา 14.00 น. ตามเวลาไทย\n\n* คุณจะมีโอกาสเจอตัวสีแตกต่างมากขึ้น!\nงานวิจัยแบบจำกัดเวลาแบบเสียเงิน\nภารกิจงานวิจัยภาคสนามธีมอีเวนต์จะมอบรางวัลการเผชิญหน้ากับโปเกมอนเด่น!\n\nลูนาโทน*\nโซลร็อก*\n* โปเกมอนที่ปรากฏตัวระหว่างงานวิจัยแบบจำกัดเวลานี้จะมีโอกาสเท่า ๆ กันในการปรากฏตัวเป็นโปเกมอนสีแตกต่างเช่นเดียวกับโปเกมอนที่สามารถเผชิญหน้าได้ผ่านงานวิจัยภาคสนามในระหว่างอีเวนต์\nโปรดทราบว่างานวิจัยแบบจำกัดเวลามีวันหมดอายุ ภารกิจที่เกี่ยวข้องกับงานวิจัยแบบจำกัดเวลาจะต้องเสร็จสิ้นและต้องรับรางวัลก่อนวันเสาร์ที่ 20 ธันวาคม 2025 เวลา 17.00 น. ตามเวลาไทย\nเทรนเนอร์ทุกคนจะสามารถซื้อและมอบตั๋วเป็นของขวัญให้กับเพื่อน Pokémon GO ที่มีระดับความสนิทสนมเป็นเพื่อนสนิทขึ้นไปอีกด้วย โปรดทราบว่าการซื้อ—รวมถึงการซื้อให้เทรนเนอร์คนอื่น—ไม่สามารถขอคืนเงินได้ (ขึ้นอยู่กับกฎหมายที่บังคับใช้และข้อยกเว้นที่กำหนดไว้ในข้อกำหนดในการให้บริการ) ไม่สามารถใช้โปเกคอยน์ซื้อตั๋วได้\nPokemon GO Web Store – กล่องตั๋วชั้นยอดงานวิจัยนภาไพศาล\nกล่องตั๋วชั้นยอดงานวิจัยนภาไพศาล จะวางจำหน่ายในราคา US$1.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) และประกอบด้วยตั๋วอีเวนต์และลูกอมประหลาด 2 เม็ด!\n\nตรวจสอบได้ใน Pokémon GO Web Store!', 'https://lh3.googleusercontent.com/_bTup9BEq4WVFORrKujTxU_iW5pHtCn_xD754vT0KjdyXS5QOBX1ppwG8VPbHaJWvqwRWi7MFajbvj3nzp3iYOnVL3SrDYZnLIlU=e365-pa-nu-w1920', '2025-12-09 02:10:26', 1),
(14, 'จดบันทึกวันที่ไว้ด้วย: Pokémon GO Fest กลับมาอีกครั้งในปี 2026! เตรียมพบเทศกาลในสถานที่จริงที่โตเกียว ชิคาโก และโคเปนเฮเกน', 'เทรนเนอร์ทุกท่าน\n\nฤดูร้อนหน้า เตรียมพบกับการผจญภัยครั้งยิ่งใหญ่ในชีวิต เมื่อ Pokémon GO Fest กลับมาอีกครั้งในปี 2026! Pokémon GO จะฉลองครบรอบ 10 ปีแห่งชุมชน การค้นพบ และการสำรวจ ติดตามข้อมูลเพิ่มเติมเกี่ยวกับวิธีการร่วมสนุกได้เป็นระยะ!\n\nวิธีสัมผัสประสบการณ์ Pokémon GO Fest ที่ดีที่สุดคือการไปสัมผัสด้วยตัวเอง! เราขอเชิญชวนเทรนเนอร์ทุกท่านมาร่วม 3 อีเวนต์ในสถานที่จริงในเมืองและวันเวลาต่อไปนี้\n\nGO Fest: โตเกียวที่ Bay Area\n\nวันที่อีเวนต์: วันศุกร์ที่ 29 พฤษภาคม – วันจันทร์ที่ 1 มิถุนายน 2026\nการเล่นเกมทั่วทั้งเมืองเวอร์ชันตั๋วจะเริ่มในวันจันทร์ที่ 25 พฤษภาคม 2026\nGO Fest: ชิคาโกที่ Grant Park\n\nวันที่อีเวนต์: วันศุกร์ที่ 5 มิถุนายน – วันอาทิตย์ที่ 7 มิถุนายน 2026\nการเล่นเกมทั่วทั้งเมืองเวอร์ชันตั๋วจะเริ่มในวันพฤหัสที่ 4 มิถุนายน 2026\nGO Fest: โคเปนเฮเกนที่ Fælledparken\n\nวันที่อีเวนต์: วันศุกร์ที่ 12 มิถุนายน – วันอาทิตย์ที่ 14 มิถุนายน 2026\nการเล่นเกมทั่วทั้งเมืองเวอร์ชันตั๋วจะเริ่มในวันพฤหัสที่ 11 มิถุนายน 2026', 'https://lh3.googleusercontent.com/ro0LLVfyOU9lIrtaHxRdzAXxr5h-dECXF0CBJiCkKo0GE1Z6GcE7_2FeC8w8T0y2_FaiaO0ByNR7aH7Y-KZY9uLpAHF9HCloNQ=e365-pa-nu-w1920', '2025-12-12 02:30:38', 1),
(15, 'คอมมิวนิตี้เดย์มกราคม: ซารุโนริ', 'คอมมิวนิตี้เดย์มกราคม 2026: ซารุโนริ\nวันอาทิตย์ที่ 18 มกราคม 2026 ตั้งแต่ 14.00 น. ถึง 17.00 น. ตามเวลาไทย\n\nโปเกมอนลูกลิง ซารุโนริ จะเป็นโปเกมอนเด่นในระหว่างคอมมิวนิตี้เดย์มกราคม!\n\nโปเกมอนเด่น\nซารุโนริจะปรากฏตัวถี่ขึ้นในธรรมชาติ*\n\nหากโชคดี อาจเจอตัวสีแตกต่างหรือตัวที่มาพร้อมกับพื้นหลังพิเศษก็ได้!\nท่าโจมตีเด่น\nวิวัฒนาการบาจินคี (ร่างวิวัฒนาการของซารุโนริ) ระหว่างอีเวนต์หรือภายใน 4 ชั่วโมงหลังจากนั้นเพื่อรับกอริลลันดาซึ่งรู้จักท่าโจมตีชาร์จ “ฮาร์ดแพลนท์”\n\nฮาร์ดแพลนท์\n\nอัปเดตความพร้อมในการใช้ท่าโจมตี\nเริ่มตั้งแต่อีเวนต์เป็นต้นไป กอริลลันดาจะสามารถเรียนรู้ท่าโจมตีชาร์จดรัมแอทแทกได้\n\nดรัมแอทแทก\n\nเทรนเนอร์แบตเทิล: ความแรง 60 และลดพลังโจมตีของโปเกมอนฝ่ายตรงข้ามลง 1 ขั้น\nยิมและการตีบอส: ความแรง 115\nเนื้อเรื่องงานวิจัยพิเศษคอมมิวนิตี้เดย์\nในราคา US$1.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) คุณจะสามารถเข้าถึงงานวิจัยพิเศษเฉพาะคอมมิวนิตี้เดย์ซารุโนริ ทำงานวิจัยนี้ให้เสร็จสิ้นเพื่อรับรางวัลให้มากยิ่งขึ้น รวมถึงสิ่งต่อไปนี้:\n\nการเผชิญหน้า 3 ครั้งกับซารุโนริที่มาพร้อมกับพื้นหลังพิเศษ\nการเผชิญหน้าเพิ่มเติมกับซารุโนริ\nบัตรแบตเทิลพรีเมียม 1 ใบ\nลูกอมประหลาด XL 1 เม็ด\nและของแถมพิเศษอีกมากมาย!\n\nโปรดติดตามข่าวสารว่าตั๋วสำหรับงานวิจัยพิเศษจะออกมาเมื่อไหร่\nอย่าลืม: ตอนนี้คุณสามารถซื้อและมอบตั๋วเป็นของขวัญให้เพื่อนของคุณที่มีระดับมิตรภาพเพื่อนสนิทหรือสูงกว่านั้นได้แล้ว\nหากต้องการมอบตั๋วเป็นของขวัญ ให้แตะที่ตั๋วงานวิจัยพิเศษในร้านค้าในเกม จากนั้นแตะปุ่มของขวัญแทนปุ่มซื้อ\nไม่สามารถแลกคืนตั๋วได้ (ขึ้นอยู่กับกฎหมายที่บังคับใช้และข้อยกเว้นที่กำหนดไว้ในข้อกำหนดในการให้บริการ) โปรดทราบว่างานวิจัยพิเศษนี้จะไม่รวมในเหรียญรางวัลในเกมและจะไม่มีเนื้อเรื่อง\n\nมีข้อจำกัดบางประการ ไม่สามารถมอบของขวัญได้หากผู้รับซื้อตั๋วงานวิจัยพิเศษหรือเคยได้รับของขวัญนี้แล้ว\nโบนัสอีเวนต์\n3× สตาร์ดัสต์จากการจับโปเกมอน\n\n2× ลูกอมจากการจับโปเกมอน\n\nโอกาส 2× สำหรับเทรนเนอร์เลเวล 31 ขึ้นไปที่จะได้รับลูกอม XL จากการจับโปเกมอน\n\nเครื่องหอม (ยกเว้นเครื่องหอมรายวัน) ที่ใช้งานระหว่างอีเวนต์จะอยู่ได้นาน 3 ชั่วโมง\n\nถ่ายสแนปช็อตสักเล็กน้อยระหว่างคอมมิวนิตี้เดย์แล้วจะเจอเซอร์ไพรส์!\n\nอุปกรณ์ปล่อยลัวร์จะอยู่ได้นาน 1 ชั่วโมง และอาจดึงดูดโปเกมอนเด่นได้*\n\nสามารถแลกเปลี่ยนพิเศษได้เพิ่ม 1 ครั้ง สูงสุดถึง 3 ครั้งสำหรับวันนั้น*\n\nการแลกเปลี่ยนจะใช้สตาร์ดัสต์น้อยลง 50%*\n\nแม้ว่าโบนัสส่วนใหญ่จะใช้งานได้เฉพาะในช่วงระยะเวลาอีเวนต์สามชั่วโมงเท่านั้น แต่โบนัสเหล่านี้จะใช้งานได้ตั้งแต่เวลา 14.00 น. ถึง 21.00 น. ตามเวลาไทย\n\nโบนัสอุปกรณ์ปล่อยลัวร์\nตั้งแต่เวลา 14.00 น. ถึง 21.00 น. ตามเวลาไทย มีโอกาสสูงมากที่ซารุโนริจะปรากฏตัวที่เสาโปเกสต็อปที่มีอุปกรณ์ปล่อยลัวร์ทั่วไปเปิดใช้งานอยู่ ซารุโนริที่ถูกดึงดูดด้วยอุปกรณ์ปล่อยลัวร์ทั่วไปจะยังคงมีโอกาสเพิ่มขึ้นที่จะเป็นตัวสีแตกต่างและอาจมาพร้อมกับพื้นหลังพิเศษ นั่นหมายถึงโอกาสเพิ่มขึ้นที่จะได้เผชิญหน้ากับโปเกมอนเด่น แม้หลังจากเวลาอีเวนต์สิ้นสุดลง!\n\nงานวิจัยภาคสนาม\nงานวิจัยภาคสนามในธีมคอมมิวนิตี้เดย์มกราคมจะพร้อมให้ใช้งานแล้ว! จับซารุโนริเพื่อรับรางวัล เช่น สตาร์ดัสต์, ไฮเปอร์บอล, การเผชิญหน้ากับซารุโนริเพิ่มเติม และอีกมากมาย! คุณอาจพบงานวิจัยภาคสนามที่นำไปสู่การเผชิญหน้ากับซารุโนริที่มีพื้นหลังพิเศษ หากโชคดีนะ!', 'https://lh3.googleusercontent.com/dzVdOkon24o8wgF_RBM2eHx5V-PjcK4XyfhggedkdXAQPtDpMQk3_acoodWgyaJbXD2eofvLITgC2gShPu-5wTfnNRp8elk4200=e365-pa-nu-w1920', '2025-12-12 02:31:26', 1),
(16, 'การเฉลิมฉลองจะดำเนินต่อไปในวินเทอร์ฮอลิเดย์ - 2 กับการเปิดตัวของทันด้ง พร้อมด้วยอีเวนต์พิเศษ สุดสัปดาห์ฤดูหนาว!', 'วินเทอร์ฮอลิเดย์ - 2\nวันพุธที่ 24 ธันวาคม เวลา 10.00 น. จนถึงวันจันทร์ที่ 29 ธันวาคม 2025 เวลา 20.00 น. ตามเวลาไทย\n\nโบนัสอีเวนต์\nการจับโปเกมอนธีมอีเวนต์ในธรรมชาติอาจทำให้ได้รับไอเท็มต่าง ๆ เช่น TM ท่าเร็ว, TM ท่าชาร์จ, ผลไพน์สีเงิน, ผลราสสีทอง และลูกอมประหลาด\nโอกาสเพิ่มขึ้นที่จะได้เผชิญหน้ากับโอโดชิชิสีแตกต่างติดกระดิ่งวันหยุดและเดเด็นเนะสีแตกต่างสวมชุดฮอลิเดย์\nนอกจากนี้ บรรลุความสำเร็จขั้นใหญ่บนบัตรผ่าน GO: วินเทอร์ฮอลิเดย์ 2025 เพื่อปลดล็อกโบนัสต่อไปนี้\n\nTier 1\n\n2× XP จากการส่งของขวัญ\nบัตรผ่าน GO Deluxe: 2× สตาร์ดัสต์จากการเปิดของขวัญ\nTier 2\n\nอาจได้รับไอเท็มเป็นรางวัลเพิ่มเติมจากการเปิดของขวัญ\nบัตรผ่าน GO Deluxe: ระยะทางฟักไข่ 1/2 เมื่อไข่ถูกวางไว้ในเครื่องฟักไข่ระหว่างช่วงเวลาอีเวนต์\nTier 3\n\nXP เพิ่มอีก 50% สำหรับการชนะแบตเทิลตีบอส\nบัตรผ่าน GO Deluxe: 2× XP จากการจับโปเกมอน\nโปเกมอนเปิดตัวใหม่\nโปเกมอนต่อไปนี้ที่ค้นพบครั้งแรกในภูมิภาคกาลาร์จะเปิดตัวใน Pokémon GO แล้ว!\n\nทันด้ง\nโทร็อกกอน\nเซคิทันซัง\n\nคุณสามารถใช้ลูกอมทันด้ง 25 เม็ดวิวัฒนาการทันด้งเป็นโทร็อกกอนและใช้ลูกอมทันด้ง 100 เม็ดวิวัฒนาการโทร็อกกอนเป็นเซคิทันซัง\nเผชิญหน้าในธรรมชาติ\nคุณอาจได้เผชิญหน้ากับโปเกมอนธีมอีเวนต์ในธรรมชาติ รวมถึง ดารุมักกะ (ร่างกาลาร์), คาจิคอล, อารุคุจิระ* และโปเกมอนอื่น ๆ อีกมากมาย! และอาจได้เผชิญหน้ากับเดเด็นเนะสวมชุดฮอลิเดย์* หรือทันด้งด้วย!\n\n*หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nไข่\nโปเกมอนต่อไปนี้จะฟักออกจากไข่ 7 กม.\n\nพิชูสวมหมวกซานต้า*\nมุจูล*\nคูมะชุนติดโบ*\nฟรีจิโอ*\nยูกิฮามิ\n\n* หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nตีบอส\nโปเกมอนต่อไปนี้จะปรากฏตัวในการตีบอส\n\nตีบอสหนึ่งดาว\nแซนด์ (ร่างอโลลา)*\nดารุมักกะ (ร่างกาลาร์)*\nทันด้ง\n\nตีบอสสามดาว\nบาร์เรียด (ร่างกาลาร์)*\nอุซกกีสวมชุดฮอลิเดย์*\nเด็นจิมูชิสวมชุดฮอลิเดย์*\n\n*หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nการเผชิญหน้างานวิจัยภาคสนาม\nภารกิจงานวิจัยภาคสนามธีมอีเวนต์จะพร้อมให้ใช้งาน\n\nทำภารกิจงานวิจัยภาคสนามให้เสร็จสิ้นเพื่อรับสตาร์ดัสต์และการเผชิญหน้ากับโปเกมอนธีมอีเวนต์\n\nสุดสัปดาห์ฤดูหนาว\nวันเสาร์ที่ 27 ธันวาคม เวลา 10.00 น. จนถึงวันอาทิตย์ที่ 28 ธันวาคม 2025 เวลา 20.00 น. ตามเวลาไทย\n\nโบนัสอีเวนต์\nไม่มีการจำกัดจำนวนแต้ม GO ที่คุณสามารถรับได้ต่อวัน!\nเควสต์โบนัสรายวันสำหรับบัตรผ่าน GO: วินเทอร์ฮอลิเดย์ 2025\nโอกาสเพิ่มขึ้นที่จะได้เผชิญหน้ากับอีวุยสีแตกต่างสวมหมวกวันหยุดจากภารกิจงานวิจัยแบบจำกัดเวลา\nงานวิจัยแบบจำกัดเวลา\nจะมีโอกาสทำงานวิจัยแบบจำกัดเวลาฟรี\n\nรางวัลงานวิจัยแบบจำกัดเวลารวมถึงสิ่งต่อไปนี้\n\nXP\nสตาร์ดัสต์\nการเผชิญหน้ากับอีวุยสวมหมวกวันหยุด*\nโปรดทราบว่างานวิจัยแบบจำกัดเวลามีวันหมดอายุ ภารกิจที่เกี่ยวข้องกับงานวิจัยแบบจำกัดเวลานี้จะต้องเสร็จสิ้นและต้องรับรางวัลก่อนวันอาทิตย์ที่ 28 ธันวาคม 2025 เวลา 20.00 น. ตามเวลาไทย', 'https://lh3.googleusercontent.com/IbB54nXimLLbwTHvJy1wmiQ8mBYDz5xqdGrJQeJzKorncqZaAegI4SSCnb20Qv4Zds4HvrEE1RYlNB3OYaqS_r649cKNmQFBZmY=e365-pa-nu-w1920', '2025-12-12 02:31:51', 1),
(17, 'คอมมิวนิตี้เดย์ (รีเทิร์น) มกราคม 2026: โพจจามะ', 'วันอาทิตย์ที่ 4 มกราคม 2026 ตั้งแต่ 14.00 น. ถึง 17.00 น. ตามเวลาไทย\n\nโปเกมอนเพนกวิน โพจจามะจะเป็นโปเกมอนเด่นในระหว่างคอมมิวนิตี้เดย์ (รีเทิร์น) มกราคม!\n\nโปเกมอนเด่น\nโพจจามะจะปรากฏตัวถี่ขึ้นในธรรมชาติ*\n\n* หากโชคดี อาจเจอตัวสีแตกต่างหรือตัวที่มาพร้อมกับพื้นหลังพิเศษก็ได้!\nท่าโจมตีเด่น\nวิวัฒนาการโพจไทชิ (ร่างวิวัฒนาการของโพจจามะ) ตั้งแต่เริ่มต้นอีเวนต์จนถึงวันที่ 4 มกราคม 2026 เวลา 21.00 น. ตามเวลาไทย เพื่อรับเอ็มเพลท์ซึ่งรู้ท่าโจมตีชาร์จ “ไฮโดรแคนนอน”\n\nไฮโดรแคนนอน\n\nเทรนเนอร์แบตเทิล: ความแรง 80\nยิมและการตีบอส: ความแรง 90\nเนื้อเรื่องงานวิจัยพิเศษคอมมิวนิตี้เดย์\nในราคา US$1.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) คุณจะสามารถเข้าถึงงานวิจัยพิเศษเฉพาะคอมมิวนิตี้เดย์โพจจามะ ทำงานวิจัยนี้ให้เสร็จสิ้นเพื่อรับรางวัลให้มากยิ่งขึ้น รวมถึงสิ่งต่อไปนี้:\n\nการเผชิญหน้า 3 ครั้งกับโพจจามะที่มาพร้อมกับพื้นหลังพิเศษ\nการเผชิญหน้าเพิ่มเติมกับโพจจามะ\nบัตรแบตเทิลพรีเมียม 1 ใบ\nลูกอมประหลาด XL 1 เม็ด\nและของแถมพิเศษอีกมากมาย!\n\nโปรดติดตามข่าวสารว่าตั๋วสำหรับงานวิจัยพิเศษจะออกมาเมื่อไหร่\nอย่าลืม: ตอนนี้คุณสามารถซื้อและมอบตั๋วเป็นของขวัญให้เพื่อนของคุณที่มีระดับมิตรภาพเพื่อนสนิทหรือสูงกว่านั้นได้แล้ว*\nหากต้องการมอบตั๋วเป็นของขวัญ ให้แตะที่ตั๋วงานวิจัยพิเศษในร้านค้าในเกม จากนั้นแตะปุ่มของขวัญแทนปุ่มซื้อ**\n*ไม่สามารถแลกคืนตั๋วได้ (เป็นไปตามกฎหมายที่มีผลและข้อยกเว้นที่กำหนดไว้ล่วงหน้าในเงื่อนไขการให้บริการ) โปรดทราบว่างานวิจัยพิเศษนี้จะไม่รวมในเหรียญรางวัลในเกมและจะไม่มีเนื้อเรื่อง\n**มีข้อจำกัดบางประการ ไม่สามารถมอบของขวัญได้หากผู้รับซื้อตั๋วงานวิจัยพิเศษหรือเคยได้รับของขวัญนี้แล้ว\nโบนัสอีเวนต์\nระยะทางฟักไข่ 1/4 เมื่อไข่ถูกวางเข้าไปในเครื่องฟักไข่ระหว่างอีเวนต์\nเครื่องหอม (ยกเว้นเครื่องหอมรายวัน) ที่ใช้งานระหว่างอีเวนต์จะอยู่ได้นาน 3 ชั่วโมง\nถ่ายสแนปช็อตสักเล็กน้อยระหว่างคอมมิวนิตี้เดย์แล้วจะเจอเซอร์ไพรส์!\nอุปกรณ์ปล่อยลัวร์จะอยู่ได้นาน 1 ชั่วโมงและอาจดึงดูดโปเกมอนเด่น\n* แม้ว่าโบนัสส่วนใหญ่จะใช้งานได้ในระหว่างอีเวนต์ 3 ชั่วโมง แต่โบนัสเหล่านี้จะใช้งานได้ตั้งแต่ 14.00 น. ถึง 21.00 น. ตามเวลาไทยเท่านั้น\nโบนัสอุปกรณ์ปล่อยลัวร์\nในวันที่ 4 มกราคม 2026 ตั้งแต่เวลา 14.00 น. ถึง 21.00 น. ตามเวลาไทย มีโอกาสสูงมากที่โพจจามะจะปรากฏตัวที่เสาโปเกสต็อปที่มีอุปกรณ์ปล่อยลัวร์มาตรฐานเปิดใช้งานอยู่ โพจจามะที่ถูกดึงดูดด้วยอุปกรณ์ปล่อยลัวร์มาตรฐานจะยังคงมีโอกาสเพิ่มขึ้นที่จะเป็นตัวสีแตกต่างและอาจมาพร้อมกับพื้นหลังพิเศษ นั่นหมายถึงโอกาสเพิ่มขึ้นที่จะได้เผชิญหน้ากับโปเกมอนเด่น แม้หลังจากเวลาอีเวนต์สิ้นสุดลง!\n\nงานวิจัยภาคสนาม\nงานวิจัยภาคสนามในธีมคอมมิวนิตี้เดย์ (รีเทิร์น) มกราคมจะพร้อมให้ใช้งานแล้ว! จับโพจจามะเพื่อรับรางวัล เช่น สตาร์ดัสต์, ซูเปอร์บอล, การเผชิญหน้ากับโพจจามะเพิ่มเติม และอีกมากมาย! คุณอาจพบงานวิจัยภาคสนามที่นำไปสู่การเผชิญหน้ากับโพจจามะที่มีพื้นหลังพิเศษ หากโชคดีนะ!\n\nPokemon GO Web Store – กล่องตั๋วไฮเปอร์คอมมิวนิตี้เดย์\nกล่องไฮเปอร์คอมมิวนิตี้เดย์ จะวางจำหน่ายในราคา US$1.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) และประกอบด้วยตั๋วอีเวนต์และไฮเปอร์บอล 5 ลูก!\n\nข้อเสนอ Web Store นี้จะวางจำหน่ายตั้งแต่วันที่ 1 มกราคม 2026 เวลา 10.00 น. ตามเวลาไทย\n\nตรวจสอบได้ใน Pokémon GO Web Store!\n\nกำลังหาเพื่อนเทรนเนอร์มาเข้าร่วมหรือเปล่า?\nหากคุณกำลังหาเทรนเนอร์อื่นในพื้นที่ของคุณเพื่อแลกเปลี่ยน, แบตเทิล หรือเข้าร่วมตีบอสในคอมมิวนิตี้เดย์ ลองไปดูแผนที่วันคอมมิวนิตี้เดย์ของเราสิ! คุณจะพบกับอีเวนต์ผู้นำชุมชนและสวนสาธารณะชุมชนที่นี่\n\nผู้นำชุมชนคือคนที่จัดอีเวนต์ Pokémon GO สำหรับชุมชนของตน ซึ่งได้รับการสนับสนุนจาก Niantic หากไม่มีผู้นำคอมมิวนิตี้ใกล้ ๆ คุณ คุณสามารถค้นหา Campfire ได้โดยดาวน์โหลดแอป และค้นหาการพบปะในพื้นที่อื่น ๆ ในละแวกใกล้เคียง\n\nสวนสาธารณะชุมชนคือพื้นที่ในเมืองของคุณที่เคยเป็นสถานที่ยอดนิยมในอดีตสำหรับคอมมิวนิตี้เดย์ สวนสาธารณะเหล่านี้อาจเป็นสถานที่เล่นที่สนุกที่จะเล่นกับชุมชนในพื้นที่ของคุณในขณะที่เพลิดเพลินไปกับอากาศบริสุทธิ์* เราหวังว่าแผนที่นี้จะช่วยให้เทรนเนอร์ได้เชื่อมต่อกัน!\n\nเราแจ้งสถานที่ยอดนิยมเพื่อเป็นข้อมูลเท่านั้น: Niantic ไม่ได้จัดหรือดำเนินอีเวนต์ทางการหรือไม่เป็นทางการในสถานที่เหล่านี้ โปรดระวังสภาพแวดล้อมรอบ ๆ ของคุณในขณะที่เล่นเกมของ Niantic\n\nกิจกรรมของผู้แทนคอมมิวนิตี้\nกิจกรรมของผู้นำคอมมิวนิตี้\nสวนสาธารณะยอดนิยม\nเช็คอินเข้าร่วมอีเวนต์ผู้นำชุมชนเพื่อรับงานวิจัยแบบจำกัดเวลาที่จะนำไปสู่การเผชิญหน้าเพิ่มเติมกับโพจจามะที่มาพร้อมกับพื้นหลังพิเศษ เช่นเดียวกับรางวัลไอเท็มพรีเมียมอื่น ๆ!', 'https://lh3.googleusercontent.com/xFKPZa9hcKpzYwlH_LkWMvl2G1L1oQV4GbkATRA52w0Nyrn3PIjyURpE9lj9KqGoJukjWvox7VmxMxn8Ufz4u-L-VE0GxVdvxA=e365-pa-nu-w1920', '2025-12-12 02:32:23', 1),
(20, 'ต้อนรับปี 2026 กับอีเวนต์ปีใหม่ใน Pokémon GO!', 'ปีใหม่ 2026\nวันพุธที่ 31 ธันวาคม 2025 เวลา 10.00 น. ถึงวันอาทิตย์ที่ 4 มกราคม 2026 เวลา 20.00 น. ตามเวลาไทย\n\nโบนัสอีเวนต์\n2× XP จากตีบอส\n2× สตาร์ดัสต์จากการตีบอส\nโอกาสเพิ่มขึ้นที่จะได้เผชิญหน้ากับพิคาชูสีแตกต่างสวมหมวกปาร์ตี้ทรงสูงในธรรมชาติและในการตีบอส\nสำรวจพร้อมการตกแต่ง\nในระหว่างอีเวนต์นี้ ดอกไม้ไฟฉลองเทศกาลจะสว่างขึ้นบนท้องฟ้า เราหวังว่าคุณจะสนุกกับการตกแต่งสีสันสวยงามนี้!\n\nเผชิญหน้าในธรรมชาติ\nอาจได้เผชิญหน้ากับโปเกมอนธีมอีเวนต์ในธรรมชาติ รวมถึง ฟุชิกิดาเนะสวมหมวกปาร์ตี้*, พูรินติดโบ*, โฮโฮสวมชุดปีใหม่* และโปเกมอนอื่น ๆ อีกมากมาย! และอาจได้เผชิญหน้ากับพิคาชูสวมหมวกปาร์ตี้ทรงสูงด้วย*!\n\n*หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nตีบอส\nโปเกมอนต่อไปนี้จะปรากฏตัวในการตีบอส\n\nตีบอสหนึ่งดาว\nพิคาชูสวมหมวกปาร์ตี้ทรงสูง*\nเคมุตโสะสวมหมวกปาร์ตี้*\n\nตีบอสสามดาว\nรัตตาสวมหมวกปาร์ตี้*\nนิโดริโนสวมหมวกปาร์ตี้*\nเก็งกาสวมหมวกปาร์ตี้*\nโซนานส์สวมหมวกปาร์ตี้*\n\n*หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nการเผชิญหน้างานวิจัยภาคสนาม\nภารกิจงานวิจัยภาคสนามธีมอีเวนต์จะพร้อมให้ใช้งาน\n\nทำภารกิจงานวิจัยภาคสนามให้เสร็จสิ้นเพื่อรับสตาร์ดัสต์\n\nงานวิจัยภาคสนามรายวัน\nในระหว่างอีเวนต์ เทรนเนอร์ทุกท่านจะได้รับโบนัสภารกิจงานวิจัยภาคสนามประจำวันในแต่ละวันที่ล็อกอิน ซึ่งจะมอบรางวัลเป็นไข่แห่งความสุขหนึ่งฟองหรือเครื่องหอม 1 เครื่อง*\n\n* หากต้องการรับภารกิจงานวิจัยภาคสนามโบนัส คุณต้องมีภารกิจงานวิจัยภาคสนามที่ทำงานอยู่ไม่เกิน 3 ภารกิจ เมื่อคุณล็อกอินเป็นครั้งแรกในแต่ละวัน\nการแลกเปลี่ยนนำโชค!\nจำนวนโปเกมอนนำโชคที่รับประกันว่าเทรนเนอร์จะได้รับจากการแลกเปลี่ยนเพิ่มขึ้นจาก 35 ตัวเป็น 45 ตัว! และเริ่มตั้งแต่อีเวนต์นี้เป็นต้นไป หากคุณแลกเปลี่ยนโปเกมอนที่อยู่ในที่จัดเก็บโปเกมอนของคุณตั้งแต่ปี 2020 คุณจะได้รับประกันว่ามันจะกลายเป็นโปเกมอนนำโชคจนกว่าจะถึงขีดจำกัด! การเปลี่ยนแปลงนี้มีผลถาวร\n\nงานวิจัยแบบจำกัดเวลาแบบเสียเงิน\nในราคา US$1.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) คุณจะสามารถเข้าถึงงานวิจัยแบบจำกัดเวลาเฉพาะอีเวนต์ การซื้อตั๋วใบนี้จะทำให้ได้รับโบนัสดังต่อไปนี้ในอีเวนต์ปีใหม่ 2026\n\nบัตรตีบอสเพิ่มเติม 1 ใบต่อวันจากการหมุนแผ่นภาพที่ยิม (รวมเป็น 2 ใบต่อวัน)\nรางวัลงานวิจัยแบบจำกัดเวลามีดังต่อไปนี้\n\nบัตรแบตเทิลพรีเมียม 2 ใบ\n3,000 สตาร์ดัสต์\nการเผชิญหน้ากับพิคาชูสวมหมวกปาร์ตี้ทรงสูง\nเทรนเนอร์ทุกคนจะสามารถซื้อและมอบตั๋วเป็นของขวัญให้กับเพื่อน Pokémon GO ที่มีระดับความสนิทสนมเป็นเพื่อนสนิทขึ้นไปอีกด้วย โปรดทราบว่าการซื้อ—รวมถึงการซื้อให้เทรนเนอร์คนอื่น—ไม่สามารถขอคืนเงินได้ (ขึ้นอยู่กับกฎหมายที่บังคับใช้และข้อยกเว้นที่กำหนดไว้ในข้อกำหนดในการให้บริการ) ไม่สามารถใช้โปเกคอยน์ซื้อตั๋วได้\n\nโปรดทราบว่างานวิจัยแบบจำกัดเวลามีวันหมดอายุ ภารกิจที่เกี่ยวข้องกับงานวิจัยแบบจำกัดเวลานี้จะต้องเสร็จสิ้นและต้องรับรางวัลก่อนวันอาทิตย์ที่ 4 มกราคม 2026 เวลา 20.00 น. ตามเวลาไทย', 'https://lh3.googleusercontent.com/JvFmn36fH62yDIhVqUAfO8L7S_lco6KJ_q629XaWv1P9immIqBfWGrcXDpc8ffbj1WAC26U-i47z9NtaIzCA2oigE05H7okNjao=e365-pa-nu-w1920', '2025-12-17 01:54:33', 1),
(21, 'ต่อสู้กับฮีโร่ฝาแฝดเพื่อความจริงหรืออุดมคติในระหว่างวันตีบอสรวมร่างคิวเรม!', 'วันตีบอสรวมร่างคิวเรม\nวันเสาร์ที่ 10 มกราคม 2026 ตั้งแต่ 14.00 น. ถึง 17.00 น. ตามเวลาไทย\n\nโบนัสอีเวนต์\nเรชิรัม, เซครอม, แบล็กคิวเรม* และไวท์คิวเรม* จะปรากฏตัวถี่ขึ้นในการตีบอส และบอสเหล่านี้จะสลับกันทุกครึ่งชั่วโมงในระหว่างช่วงเวลาอีเวนต์ เรชิรัมและแบล็กคิวเรมจะปรากฏตัวในการตีบอสก่อน ตามด้วยเซครอมและไวท์คิวเรม รับมือการตีบอสเหล่านี้เพื่อรับพลังงานรวมร่างที่สามารถนำมาใช้รวมร่างคิวเรมให้เป็นร่างที่น่าเกรงขามยิ่งขึ้น!\n\nรับบัตรตีบอสเพิ่มฟรีสูงสุดถึง 5 ใบจากการหมุนแผ่นภาพยิม (รวมเป็น 6 ใบ)\n\nโอกาสเพิ่มขึ้นที่จะเผชิญหน้ากับเรชิรัมสีแตกต่าง, เซครอมสีแตกต่าง และคิวเรมสีแตกต่างในการตีบอส\n\nขีดจำกัดบัตรตีบอสระยะไกลจะเพิ่มขึ้นเป็น 20 ครั้งตั้งแต่วันศุกร์ที่ 9 มกราคม เวลา 17.00 น. ถึงวันเสาร์ที่ 10 มกราคม 2026 เวลา 20.00 น. ตามเวลามาตรฐานแปซิฟิค\n\nเทรนเนอร์ทุกท่านจะมีโอกาสจับคิวเรมได้หลังจากเอาชนะแบล็กคิวเรมหรือไวท์คิวเรม\n\nท่าโจมตีเด่น\nเรชิรัมที่เผชิญหน้าในการตีบอสจะรู้จักท่าโจมตีชาร์จ “ครอสเฟลม”ด้วย\nเซครอมที่เผชิญหน้าในการตีบอสจะรู้จักท่าโจมตีชาร์จ “ครอสธันเดอร์”ด้วย\nคิวเรมที่เผชิญหน้าในการตีบอสอาจรู้จักท่าโจมตีชาร์จ “โลกเยือกแข็ง”\nตั๋วอีเวนต์\nในราคา US$4.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) คุณสามารถซื้อตั๋วที่มอบโบนัสต่อไปนี้ได้\n\nบัตรตีบอสเพิ่มเติม 8 ใบจากการหมุนแผ่นภาพยิม (รวมเป็น 14 ใบต่อวัน)\nโอกาสในการได้รับลูกอมประหลาด XL จากตีบอสเพิ่มขึ้น\nXP เพิ่มอีก 50% จากตีบอส\n2× สตาร์ดัสต์จากตีบอส\nโบนัสเหล่านี้จะมีผลในวันเสาร์ที่ 10 มกราคม 2026 ตั้งแต่เวลา 14.00 น. ถึง 17.00 น. ตามเวลาไทย\n\nเทรนเนอร์ทุกคนจะสามารถซื้อและมอบตั๋วเป็นของขวัญให้กับเพื่อน Pokémon GO ที่มีระดับมิตรภาพเป็นเพื่อนสนิทขึ้นไปอีกด้วย โปรดทราบว่าการซื้อ—รวมถึงการซื้อให้เทรนเนอร์คนอื่น—ไม่สามารถขอคืนเงินได้ (ขึ้นอยู่กับกฎหมายที่บังคับใช้และข้อยกเว้นที่กำหนดไว้ในข้อกำหนดในการให้บริการ) ไม่สามารถใช้โปเกคอยน์ซื้อตั๋วได้\n\nโปรดทราบว่าตั๋วใบนี้จะวางจำหน่ายในร้านค้าในเกมเท่านั้นจนถึงวันเสาร์ที่ 10 มกราคม 2026 เวลา 17.00 น. ตามเวลาไทย\nPokemon GO Web Store – กล่องตั๋วชั้นยอดวันตีบอสรวมร่างคิวเรม\nกล่องตั๋วชั้นยอดวันตีบอสรวมร่างคิวเรม จะวางจำหน่ายในราคา US$4.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) และประกอบด้วยตั๋วอีเวนต์และโบนัสบัตรแบตเทิลพรีเมียม!\n\nการรวมร่างโปเกมอน\nการรวมร่างโปเกมอนคือความสามารถในการรวมโปเกมอนบางตัวให้กลายเป็นร่างเดียวที่ทรงพลังยิ่งขึ้นโดยมีรูปลักษณ์ที่เปลี่ยนไป\n\nแบล็กคิวเรมและไวท์คิวเรม\nหากมีพลังงานรวมร่างเพียงพอ ก็สามารถรวมร่างคิวเรมกับเซครอมให้กลายเป็นแบล็กคิวเรมหรือรวมร่างกับเรชิรัมให้กลายเป็นไวท์คิวเรมได้\n\nเทรนเนอร์ทุกท่านสามารถรวมร่างคิวเรมและเซครอมได้โดยใช้พลังงานรวมร่างโวลต์ 1,000 หน่วย, ลูกอมคิวเรม 30 เม็ด และลูกอมเซครอม 30 เม็ด\nเทรนเนอร์สามารถรวมร่างคิวเรมและเรชิรัมได้โดยใช้พลังงานรวมร่างเบลซ 1,000 หน่วย, ลูกอมคิวเรม 30 เม็ด และลูกอมเรชิรัม 30 เม็ด\nคิวเรมที่ถูกรวมร่างแล้วจะยังคงอยู่ในร่างนี้จนกว่าเทรนเนอร์จะแยกพวกมันออกจากกัน การแยกร่างจะไม่เสียค่าพลังงานรวมร่างหรือลูกอมโปเกมอน\n\nแบล็กคิวเรมและไวท์คิวเรมไม่สามารถแลกเปลี่ยน, ถ่ายโอนไปยังศาสตราจารย์ หรือย้ายไปยัง Pokémon HOME ได้\n\nพลังงานรวมร่างโวลต์และพลังงานรวมร่างเบลซ\nพลังงานรวมร่างโวลต์และพลังงานรวมร่างเบลซเป็นแหล่งพลังงานที่หายากมาก ซึ่งสามารถใช้เพื่อรวมร่างคิวเรมให้กลายเป็นร่างที่น่าเกรงขามยิ่งขึ้น\n\nเทรนเนอร์ทุกท่านสามารถรับพลังงานรวมร่างโวลต์หรือพลังงานรวมร่างเบลซจากการเอาชนะแบล็กคิวเรมหรือไวท์คิวเรมในตีบอส\n\nเอฟเฟกต์ผจญภัย: ฟรีซโวลต์\nหลังจากรวมร่างเซครอมกับคิวเรมที่รู้จักท่าโจมตีชาร์จ “โลกเยือกแข็ง” แล้ว “โลกเยือกแข็ง” จะกลายเป็นท่าโจมตีชาร์จ “ฟรีซโวลต์” “ฟรีซโวลต์” จะเปลี่ยนกลับเป็น “โลกเยือกแข็ง” เมื่อเซครอมแยกร่างออกจากคิวเรม*\n\nเทรนเนอร์ทุกท่านสามารถใช้ 5,000 สตาร์ดัสต์และลูกอมคิวเรม 5 เม็ดเพื่อเปิดใช้งานเอฟเฟกต์ผจญภัยของ “ฟรีซโวลต์” ซึ่งจะปล่อยน้ำแข็งที่มีประจุไฟฟ้าเป็นเวลา 10 นาที ในระหว่างเวลานี้ โปเกมอนที่เผชิญหน้าจะไม่สามารถเคลื่อนไหวได้ ทำให้จับได้ง่ายขึ้น รวมถึงการใช้อุปกรณ์เสริมเชื่อมต่อด้วย\n\nคุณสามารถขยายเวลาเอฟเฟกต์ผจญภัยของ “ฟรีซโวลต์” ได้ครั้งละ 10 นาทีโดยใช้สตาร์ดัสต์และลูกอมคิวเรมเพิ่ม สามารถขยายเวลาได้สูงสุดถึง 2 ชั่วโมงในแต่ละครั้งที่คุณแตะใช้ และคุณสามารถแตะใช้อีกครั้งเพื่อเพิ่มเวลา—รวมสูงสุดถึง 24 ชั่วโมง!\n\nไม่สามารถใช้งาน “ฟรีซโวลต์” พร้อมกับเอฟเฟกต์ผจญภัยอื่น ๆ\n\nในเวลานี้ แบล็กคิวเรมจะไม่สามารถเรียนรู้ “ฟรีซโวลต์” ผ่าน TM ท่าชาร์จหรือ TM ท่าชาร์จชั้นเลิศได้\nเอฟเฟกต์ผจญภัย: โคลด์แฟลร์\nหลังจากรวมร่างเรชิรัมกับคิวเรมที่รู้จักท่าโจมตีชาร์จ “โลกเยือกแข็ง” แล้ว “โลกเยือกแข็ง” จะกลายเป็นท่าโจมตีชาร์จ “โคลด์แฟลร์” “โคลด์แฟลร์” จะเปลี่ยนกลับเป็น “โลกเยือกแข็ง” เมื่อเรชิรัมแยกร่างออกจากคิวเรม*\n\nเทรนเนอร์ทุกท่านสามารถใช้ 5,000 สตาร์ดัสต์และลูกอมคิวเรม 5 เม็ดเพื่อเปิดใช้งานเอฟเฟกต์ผจญภัยของ “โคลด์แฟลร์” ซึ่งจะเปิดใช้งานพลังงานเยือกแข็งเป็นเวลา 10 นาที ในระหว่างเวลานี้ วงแหวนเป้าหมายในการเผชิญหน้ากับโปเกมอนจะเคลื่อนที่ช้าลง การขว้างได้สุดยอดจึงทำได้ง่ายขึ้น และการจับโปเกมอนก็ง่ายขึ้นมากด้วย รวมถึงการใช้อุปกรณ์เสริมเชื่อมต่อด้วย\n\nคุณสามารถขยายเวลาเอฟเฟกต์ผจญภัยของ “โคลด์แฟลร์” ได้ครั้งละ 10 นาทีโดยใช้สตาร์ดัสต์และลูกอมคิวเรมเพิ่ม สามารถขยายเวลาได้สูงสุดถึง 2 ชั่วโมงในแต่ละครั้งที่คุณแตะใช้ และคุณสามารถแตะใช้อีกครั้งเพื่อเพิ่มเวลา—รวมสูงสุดถึง 24 ชั่วโมง!\n\nไม่สามารถใช้งาน “โคลด์แฟลร์” พร้อมกับเอฟเฟกต์ผจญภัยอื่น ๆ\n\nในเวลานี้ ไวท์คิวเรมจะไม่สามารถเรียนรู้ “โคลด์แฟลร์” ผ่าน TM ท่าชาร์จหรือ TM ท่าชาร์จชั้นเลิศได้', 'https://lh3.googleusercontent.com/CeXPlMxdc5YhFVVxshsOUaJ5P0xx53Sr6h-urfhuDAEX5F4Zi1nFas_u3kjf_0o8qK1yGU0Cp1fTXfpLEuvrxY8_NYH7GhUqH8Q=e365-pa-nu-w1920', '2025-12-17 01:58:13', 1),
(22, 'Pokémon GO is coming to IIT-Bombay for Techfest 2025!', 'ผู้ฝึกสอน\n\nPokémon GO จะมาปรากฏตัวที่ IIT-Bombay ในงาน Techfest 2025 ระหว่างวันที่ 22-24 ธันวาคม 2025 เหล่าเทรนเนอร์จะได้พบกับโบนัสในเกมสุดเร้าใจ และบูธ Pokémon GO อย่างเป็นทางการภายในวิทยาเขต IIT-Bombay ในมุมไบ นอกจากนี้ เทรนเนอร์ที่อยู่ใกล้เคียงยังสามารถเข้าร่วมการแข่งขัน Catch Cup ได้อีกด้วย!\n\nPokémon GO ในงาน Techfest 2025\nวันจันทร์ที่ 22 ธันวาคม เวลา 10:00 น. ถึงวันพุธที่ 24 ธันวาคม พ.ศ. 2568 เวลา 20:00 น. ตามเวลาท้องถิ่น\n\nการเผชิญหน้าในป่า\nเทรนเนอร์อาจได้พบกับบูลบาซอร์*, ชาร์แมนเดอร์*, สควอร์ตเติล*, ปิกาชู* และอีวี* นอกจากนี้ คุณอาจได้พบกับลาพราส* และสนอร์แล็กซ์* ด้วย!\n\n*ถ้าโชคดี คุณอาจเจอตัวสีพิเศษก็ได้!\n\nโบนัสกิจกรรม\n• โมดูลล่อโปเกมอนจะใช้งานได้นานสามชั่วโมง\n• รับลูกอมเพิ่มจากการแลกเปลี่ยน\n• วิวัฒนาการ Ivysaur (วิวัฒนาการของ Bulbasaur) เพื่อให้ได้ Venusaur ที่รู้ท่า Frenzy Plant\n• วิวัฒนาการ Charmeleon (วิวัฒนาการของ Charmander) เพื่อให้ได้ Charizard ที่รู้ท่า Blast Burn\n• วิวัฒนาการ Wartortle (วิวัฒนาการของ Squirtle) เพื่อให้ได้ Blastoise ที่รู้ท่า Hydro Cannon\n\nการวิจัยแบบกำหนดเวลา\nจะมีโอกาสให้ทำวิจัยแบบจำกัดเวลาได้ฟรี\n\nรางวัลจากการทำภารกิจวิจัยแบบจำกัดเวลา ได้แก่ สิ่งของต่อไปนี้\n\n• ค่าประสบการณ์ (XP)\n• สตาร์ดัสต์\n• โมดูลล่อโปเกมอน\n• การเผชิญหน้ากับโปเกมอนตามธีมกิจกรรม\n• และอื่นๆ อีกมากมาย!\n\nโปรดทราบว่าภารกิจวิจัยแบบจำกัดเวลาจะหมดอายุลง ภารกิจที่เกี่ยวข้องกับภารกิจวิจัยแบบจำกัดเวลานี้จะต้องทำเสร็จและรับรางวัลก่อนวันพุธที่ 31 ธันวาคม 2025 เวลา 20:00 น. ตามเวลาท้องถิ่น', 'https://lh3.googleusercontent.com/96uTH3bDdZOftuKQPlpJXhgdgGA8lElCzdWjYZNnUzz8yfvFxJB_4rAKDLy4_yHqbKQEb9t3Xi98ecIsplrGChgZ6auj0u_bt7JkiYSPIhvk1GE=w1440-e365', '2025-12-22 07:03:47', 1),
(23, 'ระวังตัวให้ดีและเตรียมรับมือกับ Klawf และอีกมากมายในงาน Pinch Perfect!', 'หยิกให้สมบูรณ์แบบ\nวันอังคารที่ 6 มกราคม เวลา 10:00 น. ถึงวันอาทิตย์ที่ 11 มกราคม พ.ศ. 2569 เวลา 20:00 น. ตามเวลาท้องถิ่น\n\nโปเกมอนเปิดตัวครั้งแรก\nKlawf โปเกมอนจอมซุ่มโจมตี จะปรากฏตัวครั้งแรกใน Pokémon GO!\n\nนอกจากนี้ เป็นครั้งแรกในเกม Pokémon GO ที่คุณจะสามารถพบกับ Dhelmise สีเงาได้ หากคุณโชคดี!\n\nโบนัสกิจกรรม\nได้รับ XP 2 เท่าเมื่อจับโปเกมอน\n\nมีโอกาสมากขึ้นที่จะพบโปเกมอน Corphish สีเงา, Dwebble สีเงา และ Clauncher สีเงา\n\nการเผชิญหน้าในป่า\nคุณอาจพบโปเกมอนธีมกิจกรรมในป่า รวมถึง Corphish*, Dwebble*, Clauncher* และอีกมากมาย คุณอาจพบ Tirtouga* และ Archen* ด้วย!\n\n*ถ้าโชคดี คุณอาจเจอตัวสีพิเศษก็ได้*\nการบุกค้น\nโปเกมอนต่อไปนี้จะปรากฏในการต่อสู้แบบเรด\n\nการโจมตีระดับหนึ่งดาว\nCorphish*\nDwebble*\nClauncher*\n\nการโจมตีระดับสามดาว\nDhelmise*\nDondozo*\n\n*ถ้าโชคดี คุณอาจเจอตัวสีพิเศษก็ได้*\nการเผชิญหน้าในภารกิจการวิจัยภาคสนาม\nจะมีภารกิจวิจัยภาคสนามที่เกี่ยวข้องกับกิจกรรมต่างๆ ให้เลือกทำ!\n\nโปเกมอนต่อไปนี้จะพร้อมให้คุณพบเจอเมื่อคุณทำภารกิจวิจัยภาคสนามสำเร็จ!\n\nคอร์ฟิช*\nดเวเบิล*\nคลาวน์เซอร์*\n\nเทรนเนอร์บางคนอาจพบเจอกับสิ่งต่อไปนี้ด้วย\nDhelmise*\nKlawf\n\n*ถ้าโชคดี คุณอาจเจอตัวสีพิเศษก็ได้*\nการวิจัยแบบกำหนดเวลา\nจะมีภารกิจวิจัยแบบจำกัดเวลา 3 ภารกิจที่เกี่ยวข้องกับการจับโปเกมอน ซึ่งจะเปิดให้เล่นตลอดช่วงกิจกรรมตามตารางเวลาดังต่อไปนี้!\n\nวันอังคารที่ 6 มกราคม เวลา 10:00 น. ถึงวันพฤหัสบดีที่ 8 มกราคม พ.ศ. 2569 เวลา 10:00 น. ตามเวลาท้องถิ่น\n\nทำภารกิจวิจัยให้สำเร็จเพื่อพบกับโปเกมอนประจำกิจกรรมต่อไปนี้\n\nดเวเบิล*\nคลอว์ฟ\nวันพฤหัสบดีที่ 8 มกราคม เวลา 10:00 น. ถึงวันเสาร์ที่ 10 มกราคม พ.ศ. 2569 เวลา 10:00 น. ตามเวลาท้องถิ่น\n\nทำภารกิจวิจัยให้สำเร็จเพื่อพบกับโปเกมอนประจำกิจกรรมต่อไปนี้\n\nคอร์ฟิช*\nคลอว์ฟ\nวันเสาร์ที่ 10 มกราคม เวลา 10:00 น. ถึงวันอาทิตย์ที่ 11 มกราคม พ.ศ. 2569 เวลา 20:00 น. ตามเวลาท้องถิ่น\n\nทำภารกิจวิจัยให้สำเร็จเพื่อพบกับโปเกมอนประจำกิจกรรมต่อไปนี้\n\nตัวปล่อยจรวด*\nคลอว์ฟ\n*ถ้าโชคดี คุณอาจเจอตัวสีพิเศษก็ได้*\nการวิจัยแบบมีกำหนดเวลาและได้รับค่าตอบแทน\nในราคา 1.99 ดอลลาร์สหรัฐ (หรือราคาเทียบเท่าในสกุลเงินท้องถิ่นของคุณ) คุณจะสามารถเข้าถึงการวิจัยแบบจำกัดเวลาพิเศษเฉพาะกิจกรรมนี้ได้\n\nรางวัลจากการทำภารกิจวิจัยแบบจำกัดเวลา ได้แก่ สิ่งของต่อไปนี้\n\nบัตรผ่านการต่อสู้ระดับพรีเมียม 2 ใบ\nการเผชิญหน้ากับคอร์ฟิช ดเวเบิล คลอนเชอร์ เดลไมส์ และคลอว์ฟ\nและยังมีอีกมากมาย!\nโปรดทราบว่าภารกิจวิจัยแบบจำกัดเวลาจะหมดอายุลง ภารกิจที่เกี่ยวข้องกับภารกิจวิจัยแบบจำกัดเวลานี้จะต้องทำเสร็จและรับรางวัลก่อนวันอาทิตย์ที่ 11 มกราคม 2569 เวลา 20:00 น. ตามเวลาท้องถิ่น\n\nผู้เล่นสามารถซื้อและมอบตั๋วให้กับเพื่อนใน Pokémon GO ที่มีระดับมิตรภาพตั้งแต่ระดับ \"เพื่อนดี\" ขึ้นไปได้ โปรดทราบว่าการซื้อ—รวมถึงการซื้อให้ผู้เล่นคนอื่น—ไม่สามารถขอคืนเงินได้ (ยกเว้นในกรณีที่กฎหมายบังคับใช้และข้อยกเว้นที่ระบุไว้ในข้อกำหนดในการให้บริการ) ไม่สามารถซื้อตั๋วด้วย PokéCoins ได้\n\n*โปรดทราบว่าตั๋ววิจัยแบบจำกัดเวลา Pinch Perfect Premium Timed Research จะวางจำหน่ายในร้านค้าในเกมจนถึงวันที่ 11 มกราคม 2026 เวลา 20:00 น. เท่านั้น\n\nร้านค้าออนไลน์ Pokémon GO – กล่องตั๋วอัลตร้า Pinch Perfect\nชุดตั๋ว Pinch Perfect Ultra Ticket Box จะวางจำหน่ายในราคา 1.99 ดอลลาร์สหรัฐ (หรือราคาเทียบเท่าในสกุลเงินท้องถิ่นของคุณ) และประกอบด้วยตั๋วเข้าชมงานและลูกบอล Ultra Ball จำนวน 5 ลูก!', 'https://lh3.googleusercontent.com/oA5TgQgS0U-PZWEWY7miK-kD0vrxrBnWYl79JVxbtdr79yxvkXQaLohyBODc2x-F5FmpPLZ7hY6T5VlWIuF2KRYBl9yI3qUwNgp9=e365-pa-nu-w1920', '2025-12-22 07:04:18', 1);
INSERT INTO `events` (`id`, `title`, `description`, `image`, `created_at`, `created_by`) VALUES
(24, 'Dialga และเครื่องรางนำโชคกลับมาอีกครั้งใน GO Pass: เดือนมกราคม!', 'GO Pass: มกราคม\nตั้งแต่วันอังคารที่ 6 มกราคม เวลา 10:00 น. ถึงวันอังคารที่ 3 กุมภาพันธ์ เวลา 10:00 น. ตามเวลาท้องถิ่น GO Pass และ GO Pass Deluxe สำหรับเดือนมกราคมจะพร้อมให้ใช้งานใน Pokémon GO!\n\nGO Pass และ GO Pass Deluxe\nผู้เล่นทุกคนจะได้รับ GO Pass: เดือนมกราคมโดยอัตโนมัติในวันอังคารที่ 6 มกราคม เวลา 10:00 น. ตามเวลาท้องถิ่น และสามารถสะสม GO Points และเลื่อนระดับเพื่อรับรางวัลเพิ่มเติมได้จนถึงวันอังคารที่ 3 กุมภาพันธ์ เวลา 10:00 น. ตามเวลาท้องถิ่น\n\nนอกจากนี้ ตั้งแต่วันเสาร์ที่ 31 มกราคม เวลา 00:00 น. ถึงวันอาทิตย์ที่ 1 กุมภาพันธ์ เวลา 23:59 น. ตามเวลาท้องถิ่นคุณสามารถสะสม GO Points ได้ไม่จำกัดจำนวนต่อวัน!\n\nในราคา 7.99 ดอลลาร์สหรัฐ เทรนเนอร์สามารถอัปเกรดเป็น GO Pass Deluxe ซึ่งเป็นเวอร์ชันแบบชำระเงินของ GO Pass ที่มอบรางวัลที่ได้รับการอัปเกรดและความก้าวหน้าที่เร็วขึ้น\n\nในราคา 9.99 ดอลลาร์สหรัฐ* เทรนเนอร์สามารถอัปเกรดเป็น GO Pass Deluxe + 10 Ranks เพื่อรับ GO Points โดยอัตโนมัติเพียงพอที่จะเลื่อนระดับไปถึง Rank 11 ได้\n\nเมื่อคุณใช้งาน GO Pass Deluxe ไปเรื่อยๆ คุณจะสามารถรับรางวัลทั้งหมดจากทั้ง GO Pass ฟรีและ GO Pass Deluxe ได้ คุณสามารถอัปเกรดเป็น GO Pass Deluxe ได้ทุกเมื่อและยังคงรับรางวัลจากระดับที่ปลดล็อกไว้ก่อนหน้านี้ได้เช่นกัน\n\nรางวัลที่ปลดล็อกได้ใน GO Pass จะหมดอายุในวันพฤหัสบดีที่ 5 กุมภาพันธ์ เวลา 10:00 น. ตามเวลาท้องถิ่น ดังนั้นอย่าลืมรับรางวัลของคุณก่อนที่จะหมดอายุ!\n\n*ราคาทั้งหมดที่แสดงเป็นสกุลเงินดอลลาร์สหรัฐ หรือเทียบเท่าในสกุลเงินท้องถิ่นของคุณ\nร้านค้าออนไลน์ Pokémon GO\nบัตร GO Pass Deluxe ที่คุณซื้อผ่านทาง Pokémon GO Web Store จะเปิดใช้งานทันทีที่ GO Pass เริ่มใช้งาน\n\nเทรนเนอร์ที่อัปเกรดเป็นGO Pass Deluxe: มกราคมหรือGO Pass Deluxe: มกราคม + 10 Ranksบน Pokémon GO Web Store จะได้รับ Ultra Ball 10 ลูก, Max Revive 5 ชิ้น, Premium Battle Pass 1 ใบ และ Max Potion 5 ชิ้น เป็นของแถมเมื่อซื้อ\n\nหรือจะตุนของจำเป็นไปพร้อมกับการอัปเกรดของคุณด้วยGO Pass Deluxe: January + 10 Ranks Ultra Box ที่มีจำหน่ายเฉพาะบนเว็บไซต์เท่านั้น ซึ่งประกอบด้วย Ultra Ball 20 ลูก, Max Revive 10 ชิ้น, Max Potion 10 ชิ้น, Premium Battles Pass สองใบ, Incubator หนึ่งอัน และ Super Incubator หนึ่งอัน เป็นของแถมเมื่อซื้อ!\n\nโปเกมอนเด่นและรางวัล\nทำภารกิจใน GO Pass ให้สำเร็จเพื่อเพิ่มระดับ GO Pass ของคุณและรับรางวัลดังต่อไปนี้\n\nการเผชิญหน้ากับไดอัลก้า*\nฝุ่นดาว\nเอ็กซ์พี\nอนุภาคสูงสุด\nและยังมีของดีอีกมากมาย!\nเทรนเนอร์ที่อัปเกรดเป็น GO Pass Deluxe จะได้รับรางวัลต่อไปนี้ด้วย\n\nเครื่องรางนำโชค\nตู้ฟักไข่ซุปเปอร์หนึ่งตู้\nพบกับโปเกมอนเพิ่มเติมอีกมากมาย!\nไอเทมระดับพรีเมียม เช่น พรีเมียมแบทเทิลพาส, ธูปหอม, ตู้ฟักไข่, โมดูลล่อ และอื่นๆ อีกมากมาย!\nและยังมีของดีอีกมากมาย!\n*คุณอาจเจอตัวสีพิเศษ (Shiny) ด้วยก็ได้ ถ้าโชคดี!\n\nโบนัสความสำเร็จครั้งสำคัญ\nบรรลุเป้าหมายสำคัญต่างๆ บน GO Pass ของคุณเพื่อปลดล็อกโบนัสต่อไปนี้\n\nระดับ 1 – อันดับที่ 25\n\nเปิดของขวัญได้สูงสุด 40 ชิ้นต่อวัน\nรับของขวัญได้สูงสุด 125 ชิ้นต่อวันจากการหมุน PokéStop และ Photo Disc ใน Gym\nสามารถเก็บของขวัญได้อีก 10 ชิ้นในกระเป๋าใส่ของของคุณ\nระดับ 2 – อันดับ 50\n\nระยะเวลาการใช้งานธูปผจญภัยประจำวัน 2 เท่า\nระดับ 3 – อันดับ 75\n\nรางวัลเพิ่มเติมสำหรับการพิชิตการบุกโจมตีแบบตัวต่อตัวและการต่อสู้ระดับสูงสุด\nอัปเกรดเป็น GO Pass Deluxe เพื่อเพิ่มโบนัสต่อไปนี้:\n\nระดับ 1 – อันดับที่ 25\n\nเปิดของขวัญได้สูงสุด 50 ชิ้นต่อวัน\nรับของขวัญได้สูงสุด 150 ชิ้นต่อวันจากการหมุน PokéStop และ Photo Disc ใน Gym\nสามารถเก็บของขวัญได้มากถึง 20 ชิ้นในถุงใส่ของของคุณ\nเครื่องรางนำโชค\nเครื่องรางนำโชคจะกลับมาอีกครั้งในฐานะรางวัลสุดท้ายใน GO Pass Deluxe ประจำเดือนนี้\n\nเครื่องรางนำโชคเป็นไอเทมที่ใช้ได้เพียงครั้งเดียว สามารถใช้เปลี่ยนเพื่อนหนึ่งคนในรายชื่อเพื่อนของคุณให้กลายเป็นเพื่อนนำโชคได้ เมื่อใช้แล้ว เครื่องรางนำโชคจะเปลี่ยนสถานะของคุณและเพื่อนที่คุณเลือกให้เป็นเพื่อนนำโชค แม้ว่าคุณจะยังไม่ได้เป็นเพื่อนสนิทกันก็ตาม! เมื่อคุณเป็นเพื่อนนำโชคกับใครสักคนแล้ว ครั้งต่อไปที่คุณแลกเปลี่ยนโปเกมอนกัน โปเกมอนทั้งสองตัวจะกลายเป็นโปเกมอนนำโชค หลังจากแลกเปลี่ยนเสร็จ สถานะเพื่อนนำโชคของคุณจะถูกล้างออก\n\nไอเทมสุดพิเศษนี้จะอยู่ในกระเป๋าไอเทมของคุณได้เพียงช่วงเวลาจำกัดเท่านั้น อย่าลืมใช้มันนะ! เครื่องรางนำโชคที่ได้รับจาก GO Pass: เดือนมกราคม จะหมดอายุในวันอาทิตย์ที่ 8 กุมภาพันธ์ 2026 เวลา 23:59 น. ตามเวลาท้องถิ่น ไม่ว่าคุณจะรับมันเมื่อไหร่ก็ตาม\n\nคุณต้องมีสถานะอย่างน้อยเป็นเพื่อนระดับ Great กับเทรนเนอร์ที่คุณต้องการใช้เครื่องรางนำโชคด้วย คุณไม่สามารถใช้เครื่องรางนำโชคกับเทรนเนอร์ที่คุณมีสถานะเป็นเพื่อนระดับ Lucky Friends อยู่แล้วได้ การใช้เครื่องรางนำโชคกับเพื่อนไม่ได้เปลี่ยนแปลงระยะทางที่คุณสามารถทำการแลกเปลี่ยนได้ หากคุณไม่ต้องการอนุญาตให้เทรนเนอร์คนอื่นใช้เครื่องรางนำโชคกับคุณ คุณสามารถปิดใช้งานสิทธิ์นี้ได้ในหน้าการตั้งค่าของคุณ', 'https://lh3.googleusercontent.com/r4r8-Lwf4V4L6bOApnwtV9RDxaOOLMyrIiPtnjEDSdosCigLUxCQ55eHRwqHdJ6prOkWq5jhCiL-nWC6I7JeTtYIHgLHEht11Pkj=e365-pa-nu-w1920', '2025-12-22 07:04:38', 1),
(25, 'ชาร์จพลังเพื่อต้อนรับอีเวนต์กำลังไฟสูงและปลดล็อกการเปิดตัวของไคเด็น!', 'กำลังไฟสูง\nวันอังคารที่ 13 มกราคม เวลา 10.00 น. ถึงวันอาทิตย์ที่ 18 มกราคม 2026 เวลา 20.00 น. ตามเวลาไทย\n\nโบนัสอีเวนต์\nโอกาสเพิ่มขึ้นที่จะได้ฟักไข่ซุพีคาสีแตกต่าง\nคำท้าสำหรับทั่วโลก\nคำท้าสำหรับทั่วโลกจะจัดขึ้นตลอดอีเวนต์กำลังไฟสูง! สำรวจพร้อมไปกับเทรนเนอร์ทั่วโลกเพื่อปลดล็อกโบนัสให้ทุกคนได้เพลิดเพลิน เมื่อทำภารกิจเสร็จสิ้นแล้ว โบนัสพิเศษจะถูกปลดล็อกสำหรับช่วงเวลาที่เหลือของอีเวนต์และคำท้าสำหรับทั่วโลกถัดไปจะเริ่มต้นขึ้น\n\nรางวัลระดับที่ 1\n2× XP จากการจับโปเกมอน\nรางวัลระดับที่ 2\n2× สตาร์ดัสต์จากการจับโปเกมอน\nโปเกมอนนกนางแอ่นทะเล ไคเด็นและร่างวิวัฒนาการของมัน ไทไคเด็นจะเปิดตัวใน Pokémon GO เป็นครั้งแรกในธรรมชาติและงานวิจัยภาคสนาม!\nคุณสามารถใช้ลูกอมไคเด็น 50 เม็ดเพื่อวิวัฒนาการไคเด็นเป็นไทไคเด็นได้\nรางวัลระดับที่ 3\n2× XP จากการฟักไข่โปเกมอน\n2× สตาร์ดัสต์จากการฟักไข่โปเกมอน\nเผชิญหน้าในธรรมชาติ\nอาจได้เผชิญหน้ากับโปเกมอนธีมอีเวนต์ในธรรมชาติ รวมถึง ชอนชี*, เอลิคิเทล*, ซุพีคา* และโปเกมอนอื่น ๆ อีกมากมาย! และอาจได้เผชิญหน้ากับโคลิงก์* ด้วย!\n\n*หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nไข่\nโปเกมอนต่อไปนี้จะฟักออกจากไข่ 2 กม.\n\nพิชู*\nเอเลคิด*\nเอเลซัน*\nซุพีคา*\n\n* หากโชคดี อาจเจอตัวสีแตกต่างก็ได้!\nการเผชิญหน้างานวิจัยภาคสนาม\nภารกิจงานวิจัยภาคสนามธีมอีเวนต์จะพร้อมให้ใช้งาน\n\nทำภารกิจงานวิจัยภาคสนามให้เสร็จสิ้นเพื่อรับการเผชิญหน้ากับโปเกมอนธีมอีเวนต์\n\nงานวิจัยแบบจำกัดเวลาแบบเสียเงิน\nในราคา US$1.99 (หรือราคาเทียบเท่าสกุลเงินท้องถิ่นของคุณ) คุณจะสามารถเข้าถึงงานวิจัยแบบจำกัดเวลาเฉพาะอีเวนต์ การซื้อตั๋วใบนี้จะทำให้ได้รับโบนัสต่อไปนี้ในระหว่างอีเวนต์กำลังไฟสูง\n\nระยะทางฟักไข่ 1/2 เมื่อไข่ถูกวางไว้ในเครื่องฟักไข่ในระหว่างช่วงเวลาอีเวนต์\nงานวิจัยแบบจำกัดเวลามีดังต่อไปนี้\n\nเครื่องฟักไข่ 1 เครื่อง\nเครื่องฟักไข่ชั้นเยี่ยม 1 เครื่อง\nการเผชิญหน้ากับซุพีคา\nและอีกมากมาย!\nเทรนเนอร์ทุกคนจะสามารถซื้อและมอบตั๋วเป็นของขวัญให้กับเพื่อน Pokémon GO ของพวกเขาที่มีระดับความสนิทสนมเป็นเพื่อนสนิทขึ้นไปอีกด้วย โปรดทราบว่าการซื้อ—รวมถึงการซื้อให้เทรนเนอร์คนอื่น—ไม่สามารถขอคืนเงินได้ (ขึ้นอยู่กับกฎหมายที่บังคับใช้และข้อยกเว้นที่กำหนดไว้ในข้อกำหนดในการให้บริการ) ไม่สามารถใช้โปเกคอยน์ซื้อตั๋วได้\n\nโปรดทราบว่างานวิจัยแบบจำกัดเวลามีวันหมดอายุ ภารกิจที่เกี่ยวข้องกับงานวิจัยแบบจำกัดเวลานี้จะต้องเสร็จสิ้นและต้องรับรางวัลก่อนวันอาทิตย์ที่ 18 มกราคม 2026 เวลา 20.00 น. ตามเวลาไทย', 'https://lh3.googleusercontent.com/BZh6ZEXetBW4bU6LFokwo5F0fWk1h2p823B4_MHLrwFEC8xze1M40qO-TKOQU8Yo6l2Ntot3gvLRgwgXxD0mWR90nwTs-F0WvPM=e365-pa-nu-w1920', '2026-01-14 09:31:12', 1);

-- --------------------------------------------------------

--
-- Table structure for table `friendships`
--

CREATE TABLE `friendships` (
  `id` int(20) NOT NULL,
  `requester_id` int(20) NOT NULL COMMENT 'คนที่กดขอเป็นเพื่อน',
  `addressee_id` int(20) NOT NULL COMMENT 'คนถูกขอ',
  `status` enum('pending','accepted','declined') NOT NULL DEFAULT 'pending',
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `friendships`
--

INSERT INTO `friendships` (`id`, `requester_id`, `addressee_id`, `status`, `created_at`, `updated_at`) VALUES
(124, 139, 135, 'accepted', '2025-12-21 12:59:44', '2026-01-16 13:14:42'),
(125, 139, 138, 'pending', '2025-12-21 12:59:56', NULL),
(126, 139, 137, 'declined', '2025-12-21 13:00:01', '2025-12-24 14:45:42'),
(128, 139, 143, 'pending', '2025-12-21 23:54:05', NULL),
(129, 142, 139, 'pending', '2025-12-22 13:42:26', NULL),
(132, 142, 138, 'pending', '2025-12-23 11:43:41', NULL),
(137, 143, 142, 'accepted', '2026-01-29 15:52:34', '2026-02-19 13:43:50'),
(143, 135, 143, 'pending', '2026-02-18 14:13:12', NULL),
(144, 144, 135, 'declined', '2026-02-19 09:48:02', '2026-02-19 10:02:11'),
(149, 151, 143, 'pending', '2026-03-19 15:06:25', NULL),
(150, 151, 148, 'pending', '2026-03-19 15:54:30', NULL),
(151, 151, 150, 'pending', '2026-06-18 10:10:21', NULL),
(152, 155, 150, 'pending', '2026-06-18 11:32:51', NULL),
(153, 155, 147, 'pending', '2026-06-18 11:32:56', NULL),
(154, 155, 144, 'pending', '2026-06-18 11:33:01', NULL),
(155, 155, 139, 'pending', '2026-06-18 11:33:11', NULL),
(156, 155, 143, 'pending', '2026-06-18 11:37:08', NULL),
(157, 155, 151, 'accepted', '2026-06-18 15:52:53', '2026-06-18 15:53:19');

-- --------------------------------------------------------

--
-- Table structure for table `menu`
--

CREATE TABLE `menu` (
  `id` int(11) NOT NULL,
  `menu` varchar(255) NOT NULL,
  `menu_eng` varchar(255) NOT NULL,
  `type` enum('feature','menu') NOT NULL,
  `icon` varchar(255) NOT NULL,
  `icon_color` varchar(255) NOT NULL,
  `router` varchar(255) NOT NULL,
  `status` tinyint(1) NOT NULL,
  `updated_at` datetime NOT NULL,
  `badge_type` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `menu`
--

INSERT INTO `menu` (`id`, `menu`, `menu_eng`, `type`, `icon`, `icon_color`, `router`, `status`, `updated_at`, `badge_type`) VALUES
(4, 'ดูโปรไฟล์', 'Profile', 'menu', 'person', '#c03939', '/settings/profile', 1, '2025-12-25 13:35:24', NULL),
(5, 'ตั้งค่าโปรไฟล์', 'Profile Setting', 'menu', 'people', '#2fc669', '/settings/ocr-edit', 1, '2025-12-25 13:35:50', NULL),
(6, 'ประวัติ', 'History', 'menu', 'archive', '#2ea2dc', '/settings/user-log', 1, '2025-12-25 13:36:13', NULL),
(7, 'ตั้งค่าแอพ', 'Settings', 'menu', 'settings', '#dd9836', '/settings/setting-app', 1, '2025-12-25 13:36:31', NULL),
(18, 'ปฏิทินกิจกรรม', 'Calendar', 'feature', 'calendar-number', '#d79251ff', '/calendar/calendar', 1, '2025-12-29 12:55:48', NULL),
(19, 'วิจัยภาคสนาม', 'Field Research', 'feature', 'compass', '#475ac2', '/calendar/research', 1, '2025-12-29 12:56:06', NULL),
(20, 'ฟักไข่', 'Egg Incubator', 'feature', 'egg', '#7e7dcf', '/calendar/eggs', 1, '2025-12-29 12:56:22', NULL),
(26, 'Feedback', 'Feedback', 'menu', 'alert-circle', '#8f3cd3', '/settings/feedback', 1, '2026-01-08 09:34:54', NULL),
(27, 'หาปาตี้รายสัปดาห์', '', 'feature', 'person', '#e4aad7', '/party', 0, '2026-01-08 14:44:43', NULL),
(30, 'ภาษา', '', 'menu', 'language-outline', '#000000', '/language', 0, '2026-02-16 10:09:06', NULL),
(31, 'Discord', 'Discord', 'menu', 'discord', '#5160d2', 'https://discord.gg/rG4rnXAA7', 1, '2026-02-27 11:10:32', NULL),
(32, 'OCR', 'OCR', 'menu', 'camera', '#5160d2', '/settings/ocr', 1, '2026-03-16 08:28:19', NULL),
(33, 'ร้านค้าแลกรางวัล', 'Party Shop', 'menu', 'cart', '#EAB308', '/shop', 1, '2026-06-18 14:29:07', 'new'),
(34, 'ทัวร์นาเมนต์', 'Tournament', 'menu', 'trophy', '#6B7280', '/tournament', 1, '0000-00-00 00:00:00', 'soon');

-- --------------------------------------------------------

--
-- Table structure for table `notifications`
--

CREATE TABLE `notifications` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `message` text NOT NULL,
  `target` enum('all','user','room') NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `room_id` int(11) DEFAULT NULL,
  `sent_by` int(11) NOT NULL,
  `status` enum('sended','schedule','daily','weekly') NOT NULL,
  `schedule_at` datetime DEFAULT NULL,
  `schedule_status` enum('success','failed','waiting') DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `notifications`
--

INSERT INTO `notifications` (`id`, `title`, `message`, `target`, `user_id`, `room_id`, `sent_by`, `status`, `schedule_at`, `schedule_status`, `created_at`, `updated_at`) VALUES
(24, 'กิจกรรมบอส Gmax Snorlax เริ่มแล้ว', 'เวลา 14:00 - 17:00 น.', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-12 08:25:06', NULL),
(25, 'ทดสอบ บอร์ดแคส', 'เวลา 14:00 - 17:00 น.', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-16 09:56:51', NULL),
(26, 'กิจกรรม Community Day', 'XP x2 ตลอดการจับ มาจับกันเถอะ', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-16 15:04:17', NULL),
(28, '🕕 Raid Hour วันนี้! บอส 5 ดาวเกิดเต็มแมพ', 'เตรียมปาร์ตี้ให้พร้อม! 18:00 น. นี้ เจอกัน หาเพื่อนช่วยตีบอส หรือสร้างห้องรอเพื่อนได้เลยที่ Pogopartyth 🚀', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-17 06:07:35', NULL),
(29, '❄️ ลมหนาวมาแล้ว พร้อมบอสใหม่!', 'กิจกรรม Winter Holiday เริ่มแล้ว! อย่าพลาดโอกาสจับโปเกมอนคอสตูมพิเศษและบอสน้ำแข็งสุดแกร่ง เข้ามาเช็คห้องว่างเลย! ☃️', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-20 09:04:51', NULL),
(30, '🔥 ห้องเต็มไวมาก! เทรนเนอร์รออยู่', 'เพื่อนๆ กำลังหาคนช่วยตีบอสอยู่เพียบ! ขาดอีกแค่ไม่กี่คนก็เริ่มตีได้แล้ว เข้ามาจองที่ด่วน 🏃💨', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-23 07:43:21', NULL),
(31, '⚔️ ได้เวลาตีบอสแล้ว!', 'เพื่อนๆ กำลังหาคนช่วยตีบอสอยู่เพียบ! ขาดอีกแค่ไม่กี่คนก็เริ่มตีได้แล้ว เข้ามาจองที่ด่วน 🏃💨', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-23 07:49:04', NULL),
(33, 'เย็นนี้ 6 โมง! น้องแมวน้ำ Spheal กลิ้งมาแจก XP', 'Spotlight Hour วันนี้พบกับ Spheal (ชิมาซึ) พร้อมโบนัส XP x2 เมื่อวิวัฒนาการ! 📈 ใครดองของไว้เตรียมกดยาวๆ จบแล้วมาหาเพื่อนตีบอสต่อได้เลย!', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-23 08:11:37', NULL),
(34, '⚡️ Zekrom มังกรสายฟ้า กลับมาแล้ว!', 'บอส 5 ดาวตัวใหม่ Zekrom และเมก้า Mega Glalie ❄️ เริ่มเกิดแล้ว! ใครยังไม่มีตัว หรือตามล่าไชนี่เท่ๆ เข้ามาจองห้องตีบอสด่วน เพื่อนรอเพียบ!', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-23 08:20:44', NULL),
(37, '🎄 โค้งสุดท้าย Winter Holiday Part 1', 'พรุ่งนี้กิจกรรมจะเปลี่ยนพาร์ทแล้ว! รีบเก็บตกโปเกมอนคอสตูมชุดคริสต์มาสก่อนหมดเวลา 🎅 แล้วมาจัดปาร์ตี้ตีบอสส่งท้ายปีกันที่ Pogopartyth', 'all', NULL, NULL, 1, 'sended', NULL, NULL, '2025-12-24 13:20:27', NULL),
(42, '🎁 แกะกล่องของขวัญ! Winter Holiday Part 2 เริ่มแล้ว', 'เหล่าโปเกมอนสวมชุดคริสต์มาสชุดใหม่มาแล้ว! 🎄 อย่าลืมเข้ามาหาเพื่อนตีบอสเก็บ Candy ส่งท้ายปีกันนะ ห้องว่างเพียบ!', 'all', NULL, NULL, 1, 'schedule', '2025-12-26 13:00:00', 'success', '2025-12-26 10:40:47', NULL),
(43, '🔥 ศุกร์สิ้นปี... ต้องมีตัวเทพ!', 'ทำงานวันสุดท้ายของสัปดาห์แล้ว มาปลดปล่อยพลังตีบอสกันเถอะ! ⚡️ Zekrom (หรือบอสปัจจุบัน) ไชนี่รอคุณอยู่ เข้ามาจอยปาร์ตี้เลย', 'all', NULL, NULL, 1, 'schedule', '2025-12-26 17:30:00', 'success', '2025-12-26 10:41:21', NULL),
(44, '❄️ หนาวนี้ไม่เหงา... มาหาเพื่อนตีบอสกัน', 'ขาดคนช่วยตีบอสใช่ไหม? หรืออยากหาเพื่อนส่งของขวัญ? 🎁 เข้า Pogopartyth ตอนนี้ เจอเพื่อนเทรนเนอร์ใจดีรออยู่แน่นอน!', 'all', NULL, NULL, 1, 'schedule', '2025-12-27 08:00:00', 'success', '2025-12-26 10:42:01', NULL),
(50, 'asdasd', 'asd', 'all', NULL, NULL, 1, 'daily', NULL, 'success', '2026-03-05 11:36:18', '2026-03-05 11:49:08'),
(51, 'สัปดาห์ใหม่ เริ่มแล้ว', 'กิจกรรมใหม่ รอคุณอยู่ เช็คข้อมูลแล้วไปลุยกัน', 'all', NULL, NULL, 1, 'weekly', NULL, 'success', '2026-03-05 11:51:33', '2026-03-05 11:51:51');

-- --------------------------------------------------------

--
-- Table structure for table `otp`
--

CREATE TABLE `otp` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `otp` varchar(6) NOT NULL,
  `type` enum('register','reset') NOT NULL,
  `status` enum('active','expire','verify') NOT NULL DEFAULT 'active',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `raid_boss`
--

CREATE TABLE `raid_boss` (
  `id` int(11) NOT NULL,
  `pokemon_id` int(11) DEFAULT NULL,
  `pokemon_name` varchar(100) NOT NULL,
  `pokemon_image` varchar(255) DEFAULT NULL,
  `pokemon_tier` int(11) NOT NULL,
  `pokemon_type` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`pokemon_type`)),
  `start_date` datetime NOT NULL,
  `end_date` datetime NOT NULL,
  `type` enum('normal','shadow','mega','dynamax','gigantamax','super_mega') NOT NULL,
  `special` tinyint(1) NOT NULL,
  `boss_event_id` int(1) DEFAULT NULL,
  `cp_normal_min` int(11) NOT NULL,
  `cp_normal_max` int(11) NOT NULL,
  `cp_boost_min` int(11) NOT NULL,
  `cp_boost_max` int(11) NOT NULL,
  `maximum` int(11) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `raid_boss`
--

INSERT INTO `raid_boss` (`id`, `pokemon_id`, `pokemon_name`, `pokemon_image`, `pokemon_tier`, `pokemon_type`, `start_date`, `end_date`, `type`, `special`, `boss_event_id`, `cp_normal_min`, `cp_normal_max`, `cp_boost_min`, `cp_boost_max`, `maximum`, `created_at`) VALUES
(59, 1, 'Gigantamax Grimmsnarl', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/861_f2.png', 6, '[\"Fire\",\"Water\"]', '2025-11-18 00:00:00', '2025-11-30 00:00:00', 'gigantamax', 1, NULL, 0, 0, 0, 1628, 10, '2025-11-07 11:46:59'),
(63, 0, 'Magneton', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm82.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-11-18 00:00:00', '2025-11-30 00:00:00', 'normal', 0, NULL, 1348, 1420, 1686, 1775, 0, '2025-11-18 16:56:16'),
(64, 0, 'Charjabug', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm737.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-22 00:00:00', '2025-12-29 00:00:00', 'normal', 0, NULL, 912, 970, 1140, 1212, 10, '2025-11-18 16:56:16'),
(65, 0, 'Shadow Heatran', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm485.icon.png', 5, '[\"Fire\",\"Water\"]', '2025-12-02 00:00:00', '2026-01-01 00:00:00', 'shadow', 0, NULL, 2058, 2145, 2573, 2681, 10, '2025-11-18 16:56:16'),
(66, 1, 'Mega Ampharos', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm181.fMEGA.icon.png', 4, '[\"Fire\",\"Water\"]', '2025-11-18 00:00:00', '2025-11-30 00:00:00', 'mega', 0, NULL, 1554, 1630, 1943, 2037, 0, '2025-11-18 16:56:16'),
(67, 0, 'Mega Manectric', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm310.fMEGA.icon.png', 4, '[\"Fire\",\"Water\"]', '2025-11-18 00:00:00', '2026-02-22 00:00:00', 'mega', 0, NULL, 1267, 1337, 1585, 1672, 6, '2025-11-18 16:56:16'),
(68, 1, 'Shadow Latios', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/001.png', 5, '[\"Fire\",\"Water\"]', '2025-11-18 00:00:00', '2026-03-31 00:00:00', 'super_mega', 0, NULL, 2021, 2178, 2526, 2723, 10, '2025-11-18 16:56:16'),
(69, 249, 'Dynamax Lugia', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/249.png', 5, '[\"Fire\",\"Water\"]', '2025-12-06 00:00:00', '2025-12-07 00:00:00', 'dynamax', 1, NULL, 2028, 2115, 2028, 2115, 4, '2025-11-24 14:55:26'),
(74, 249, 'Galarian Farfetch\'d', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm83.fGALARIAN.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2025-12-03 00:00:00', 'normal', 0, NULL, 898, 956, 1123, 1196, 10, '2025-11-26 14:01:32'),
(75, 0, 'Throh', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm538.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2025-12-03 00:00:00', 'normal', 0, NULL, 1391, 1464, 1739, 1830, 10, '2025-11-26 14:01:32'),
(76, 0, 'Sawk', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm539.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2026-04-30 00:00:00', 'normal', 0, NULL, 1517, 1593, 1897, 1991, 10, '2025-11-26 14:01:32'),
(77, 0, 'Cobalion', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm638.icon.png', 5, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2026-08-31 12:00:00', 'normal', 0, NULL, 1649, 1727, 2061, 2159, 10, '2025-11-26 14:01:32'),
(78, 0, 'Mega Terrakion', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm639.icon.png', 5, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2026-04-30 00:00:00', 'shadow', 0, 4, 2026, 2113, 2533, 2641, 10, '2025-11-26 14:01:32'),
(79, 0, 'Virizion', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm640.icon.png', 5, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2026-04-30 00:00:00', 'mega', 0, 1, 1649, 1727, 2061, 2159, 10, '2025-11-26 14:01:32'),
(80, 0, 'Super Mega Aerodactyl', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm142.fMEGA.icon.png', 4, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2026-03-31 00:00:00', 'super_mega', 0, NULL, 1515, 1590, 1894, 1988, 10, '2025-11-26 14:01:32'),
(81, 0, 'Mega Medicham', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm308.fMEGA.icon.png', 4, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2025-12-03 00:00:00', 'mega', 0, NULL, 764, 817, 955, 1022, 10, '2025-11-26 14:01:32'),
(82, 0, 'Mega Garchomp', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm445.fMEGA.icon.png', 4, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2026-02-23 00:00:00', 'mega', 1, NULL, 2174, 2264, 2718, 2830, 10, '2025-11-26 14:01:32'),
(87, 0, 'Scyther', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm123.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2025-11-30 00:00:00', 'normal', 0, NULL, 1414, 1546, 1768, 1933, 0, '2025-11-26 14:01:32'),
(88, 0, 'Aerodactyl', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm142.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2025-11-30 00:00:00', 'normal', 0, NULL, 1456, 1590, 1821, 1988, 0, '2025-11-26 14:01:32'),
(89, 0, 'Sableye', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm302.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2026-04-30 00:00:00', 'normal', 0, NULL, 747, 843, 934, 1054, 0, '2025-11-26 14:01:32'),
(90, 0, 'Latios', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm381.icon.png', 5, '[\"Fire\",\"Water\"]', '2025-11-25 00:00:00', '2025-11-30 00:00:00', 'normal', 0, NULL, 2021, 2178, 2526, 2723, 0, '2025-11-26 14:01:32'),
(95, 646, 'Kyurem', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/646.png', 5, '[\"Fire\",\"Water\"]', '2025-12-04 00:00:00', '2025-12-13 00:00:00', 'normal', 0, NULL, 1791, 2042, 2239, 2553, 10, '2025-12-04 10:11:09'),
(103, 0, 'Paldean Aqua Tauros', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm128.fPALDEA_AQUA.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-04 00:00:00', '2025-12-11 00:00:00', 'normal', 0, NULL, 1546, 1621, 1932, 2026, 10, '2025-12-08 15:53:27'),
(104, 0, 'Bombirdier', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm962.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-04 00:00:00', '2025-12-11 00:00:00', 'normal', 0, NULL, 1351, 1421, 1688, 1777, 10, '2025-12-08 15:53:27'),
(105, 0, 'Dondozo', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm977.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-04 00:00:00', '2025-12-11 00:00:00', 'normal', 0, NULL, 1633, 1712, 2041, 2140, 10, '2025-12-08 15:53:27'),
(115, 0, 'Mega Gyarados', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm130.fMEGA.icon.png', 4, '[\"Fire\",\"Water\"]', '2025-12-04 00:00:00', '2025-12-13 00:00:00', 'mega', 0, NULL, 1855, 1937, 2319, 2422, 10, '2025-12-09 08:56:59'),
(120, 643, 'Reshiram', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/643.png', 5, '[\"Fire\",\"Water\"]', '2025-12-13 00:00:00', '2025-12-21 00:00:00', 'normal', 0, NULL, 2217, 2307, 2771, 2884, 10, '2025-12-12 13:52:58'),
(121, 644, 'Zekrom', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 5, '[\"Fire\",\"Water\"]', '2025-12-22 00:00:00', '2025-12-31 00:00:00', 'normal', 0, NULL, 2217, 2307, 2771, 2884, 10, '2025-12-12 13:54:33'),
(122, 460, 'Mega Abomasnow', 'https://sg.portal-pokemon.com/play/resources/pokedex/img/pm/e7aead89c6404be16d7c69ced223b9f5567d6bed.png', 4, '[\"Fire\",\"Water\"]', '2025-12-13 00:00:00', '2025-12-21 00:00:00', 'mega', 0, NULL, 1148, 1349, 1436, 1687, 10, '2025-12-12 14:00:17'),
(123, 362, 'Glalie', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/362.png', 4, '[\"Fire\",\"Water\"]', '2025-12-22 00:00:00', '2025-12-31 00:00:00', 'mega', 0, NULL, 1764, 1845, 2205, 2307, 10, '2025-12-12 14:07:21'),
(124, 28, 'Sandslash', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/028.png', 3, '[\"Fire\",\"Water\"]', '2025-12-05 00:00:00', '2025-12-13 00:00:00', 'normal', 0, NULL, 1288, 1356, 1610, 1696, 10, '2025-12-12 14:20:07'),
(125, 36, 'Clefable', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/036.png', 3, '[\"Fire\",\"Water\"]', '2025-12-05 00:00:00', '2025-12-13 00:00:00', 'normal', 0, NULL, 1322, 1392, 1653, 1741, 10, '2025-12-12 14:21:30'),
(126, 437, 'Bronzong', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/437.png', 3, '[\"Fire\",\"Water\"]', '2025-12-05 00:00:00', '2025-12-13 00:00:00', 'normal', 0, NULL, 1212, 1279, 1515, 1599, 10, '2025-12-12 14:22:29'),
(127, 143, 'Snorlax', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/video-games/_tiles/pokemon-go/art/gigantamax-snorlax.png', 6, '[\"Fire\",\"Water\"]', '2025-12-14 14:00:00', '2025-12-14 17:00:00', 'gigantamax', 1, NULL, 1760, 1843, 1760, 1843, 10, '2025-12-12 14:37:47'),
(128, 0, 'Scyther', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm123.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-01 00:00:00', '2025-12-31 00:00:00', 'shadow', 0, NULL, 1414, 1546, 1768, 1933, 10, '2025-12-12 15:12:13'),
(129, 0, 'Aerodactyl', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm142.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-01 00:00:00', '2025-12-31 00:00:00', 'shadow', 0, NULL, 1456, 1590, 1821, 1988, 10, '2025-12-12 15:12:13'),
(130, 0, 'Sableye', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm302.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-01 00:00:00', '2025-12-31 00:00:00', 'shadow', 0, NULL, 747, 843, 934, 1054, 10, '2025-12-12 15:12:13'),
(131, 112, 'Rhydon', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/112.png', 3, '[\"Fire\",\"Water\"]', '2025-12-15 00:00:00', '2025-12-21 00:00:00', 'normal', 0, NULL, 1736, 1816, 2170, 2270, 10, '2025-12-15 15:17:22'),
(132, 297, 'Hariyama', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/297.png', 3, '[\"Fire\",\"Water\"]', '2025-12-15 00:00:00', '2025-12-21 00:00:00', 'normal', 0, NULL, 1537, 1616, 1616, 2020, 10, '2025-12-15 15:23:28'),
(133, 0, 'Crustle', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm558.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-15 00:00:00', '2025-12-21 00:00:00', 'normal', 0, NULL, 1381, 1452, 1726, 1815, 10, '2025-12-16 10:31:31'),
(134, 0, 'Sudowoodo', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm185.fWINTER_2025.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-22 00:00:00', '2025-12-29 00:00:00', 'normal', 0, NULL, 1162, 1227, 1452, 1534, 10, '2025-12-21 16:34:46'),
(135, 0, 'Hisuian Avalugg', 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm713.fHISUIAN.icon.png', 3, '[\"Fire\",\"Water\"]', '2025-12-22 00:00:00', '2025-12-29 00:00:00', 'normal', 0, NULL, 1892, 1975, 2365, 2469, 10, '2025-12-21 16:34:46'),
(140, 103, 'Charizard', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/006.png', 5, '[\"Fire\",\"Flying\"]', '2026-03-13 00:00:00', '2026-03-16 00:00:00', 'shadow', 1, NULL, 0, 0, 0, 0, 10, '2026-01-12 09:40:43'),
(141, 3, 'Venusaur', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/003_f2.png', 4, '[\"Grass\",\"Poison\"]', '2026-01-12 00:00:00', '2026-01-13 00:00:00', 'mega', 0, NULL, 0, 0, 0, 0, 10, '2026-01-12 09:53:18'),
(142, 6, 'Charizard', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/006_f2.png', 4, '[\"Fire\",\"Dragon\"]', '2026-01-12 00:00:00', '2026-01-13 00:00:00', 'mega', 0, NULL, 1499, 1800, 2000, 2500, 10, '2026-01-12 10:08:30'),
(143, 6, 'Charizard', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/006_f3.png', 4, '[\"Fire\",\"Flying\"]', '2026-01-12 00:00:00', '2026-01-13 00:00:00', 'mega', 0, NULL, 2449, 2546, 3061, 3182, 10, '2026-01-12 11:10:38'),
(144, 641, 'Tornadus', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/641.png', 5, '[\"Flying\"]', '2026-01-12 00:00:00', '2026-02-04 00:00:00', 'normal', 0, NULL, 1828, 1911, 2285, 2389, 6, '2026-01-12 11:20:21'),
(145, 68, 'Machamp', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/068.png', 4, '[\"Fighting\"]', '2026-03-20 00:00:00', '2026-03-21 00:00:00', 'normal', 0, NULL, 0, 0, 0, 0, 10, '2026-01-12 11:51:33'),
(146, 254, 'Sceptile', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/254_f2.png', 4, '[\"Grass\",\"Dragon\"]', '2026-03-17 12:00:00', '2026-03-29 12:00:00', 'mega', 0, NULL, 2224, 2317, 2780, 2897, 6, '2026-01-12 15:02:41'),
(147, 260, 'Swampert', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/260_f2.png', 4, '[\"Water\",\"Ground\"]', '2026-03-04 12:00:00', '2026-03-09 12:00:00', 'mega', 0, NULL, 2420, 2514, 3025, 3143, 6, '2026-01-12 17:37:21'),
(148, 257, 'Blaziken', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/257_f2.png', 4, '[\"Fire\",\"Fighting\"]', '2026-01-05 12:00:00', '2026-02-28 12:00:00', 'mega', 0, NULL, 1550, 1627, 1938, 2034, 6, '2026-01-13 15:35:48'),
(149, 56, 'Mankey', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/056.png', 6, '[\"Dragon\",\"Flying\"]', '2026-03-08 15:51:00', '2026-03-15 15:51:00', 'super_mega', 0, 1, 2079, 2167, 2599, 2709, 10, '2026-02-27 15:53:57');

-- --------------------------------------------------------

--
-- Table structure for table `raid_boss_counter`
--

CREATE TABLE `raid_boss_counter` (
  `id` int(11) NOT NULL,
  `raid_boss_id` int(11) NOT NULL,
  `pokemon_id` int(11) NOT NULL,
  `pokemon_name` varchar(255) NOT NULL,
  `pokemon_image` varchar(500) NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `raid_boss_counter`
--

INSERT INTO `raid_boss_counter` (`id`, `raid_boss_id`, `pokemon_id`, `pokemon_name`, `pokemon_image`, `created_at`) VALUES
(23, 141, 0, 'Charizard', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/006.png', '2026-01-12 09:53:18'),
(24, 141, 0, 'Beedrill', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/015.png', '2026-01-12 09:53:18'),
(25, 141, 0, 'Caterpie', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/010.png', '2026-01-12 09:53:18'),
(26, 141, 0, 'Pidgey', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/016.png', '2026-01-12 09:53:18'),
(27, 141, 0, 'Sandslash', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/028.png', '2026-01-12 09:53:18'),
(28, 141, 0, 'Pidgeot', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/018.png', '2026-01-12 09:53:18'),
(37, 142, 0, 'White Kyurem', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/646_f2.png', '2026-01-12 10:30:44'),
(38, 142, 0, 'Black Kyurem', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/646_f3.png', '2026-01-12 10:30:44'),
(39, 142, 0, 'Blastoise', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/009_f2.png', '2026-01-12 10:30:44'),
(61, 144, 646, 'White Kyurem', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/646_f2.png', '2026-01-12 12:00:47'),
(62, 144, 646, 'Black Kyurem', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/646_f3.png', '2026-01-12 12:00:47'),
(63, 144, 719, 'Mega Diancie', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/719_f2.png', '2026-01-12 12:00:47'),
(64, 144, 384, 'Mega Rayquaza', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/384_f2.png', '2026-01-12 12:00:47'),
(65, 144, 243, 'Raikou', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/243.png', '2026-01-12 12:00:47'),
(66, 144, 462, 'Magnezone', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/462.png', '2026-01-12 12:00:47'),
(67, 143, 719, 'Diancie', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/719_f2.png', '2026-01-12 12:03:56'),
(68, 143, 464, 'Rhyperior', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/464.png', '2026-01-12 12:03:56'),
(69, 143, 697, 'Tyrantrum', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/697.png', '2026-01-12 12:03:56'),
(70, 143, 248, 'Tyranitar', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/248_f2.png', '2026-01-12 12:03:56'),
(71, 143, 409, 'Rampardos', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/409.png', '2026-01-12 12:03:56'),
(72, 143, 142, 'Aerodactyl', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/142_f2.png', '2026-01-12 12:03:56'),
(85, 148, 384, 'Rayquaza', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/384_f2.png', '2026-01-13 15:35:48'),
(86, 148, 382, 'Kyogre', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/382_f2.png', '2026-01-13 15:35:48'),
(87, 148, 383, 'Groudon', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/383_f2.png', '2026-01-13 15:35:48'),
(88, 148, 150, 'Mewtwo', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/150.png', '2026-01-13 15:35:48'),
(89, 148, 445, 'Garchomp', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/445_f2.png', '2026-01-13 15:35:48'),
(90, 148, 381, 'Latios', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/381_f2.png', '2026-01-13 15:35:48'),
(91, 147, 254, 'Sceptile', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/254_f2.png', '2026-03-05 14:58:42'),
(92, 147, 798, 'Kartana', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/798.png', '2026-03-05 14:58:42'),
(93, 147, 3, 'Venusaur', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/003_f2.png', '2026-03-05 14:58:42'),
(94, 147, 492, 'Shaymin', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/492_f2.png', '2026-03-05 14:58:42'),
(95, 147, 893, 'Zarude', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/893.png', '2026-03-05 14:58:42'),
(96, 147, 465, 'Tangrowth', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/465.png', '2026-03-05 14:58:42'),
(97, 146, 646, 'Kyurem', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/646_f2.png', '2026-03-05 14:58:57'),
(98, 146, 384, 'Rayquaza', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/384_f2.png', '2026-03-05 14:58:57'),
(99, 146, 646, 'Kyurem', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/646_f3.png', '2026-03-05 14:58:57'),
(100, 146, 890, 'Eternatus', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/890.png', '2026-03-05 14:58:57'),
(101, 146, 998, 'Baxcalibur', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/998.png', '2026-03-05 14:58:57'),
(102, 146, 460, 'Abomasnow', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/460_f2.png', '2026-03-05 14:58:57'),
(103, 145, 10, 'Caterpie', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/010.png', '2026-03-05 14:59:16'),
(104, 145, 1, 'Bulbasaur', 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/001.png', '2026-03-05 14:59:16');

-- --------------------------------------------------------

--
-- Table structure for table `raid_cancel_reasons`
--

CREATE TABLE `raid_cancel_reasons` (
  `id` int(11) NOT NULL,
  `room_id` int(11) NOT NULL,
  `cancel_reasons_id` int(11) NOT NULL,
  `reason` varchar(500) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `raid_cancel_reasons`
--

INSERT INTO `raid_cancel_reasons` (`id`, `room_id`, `cancel_reasons_id`, `reason`, `created_at`) VALUES
(10, 897, 1, 'Changed my mind, not doing the raid', '2026-02-18 07:14:37'),
(12, 903, 1, 'Changed my mind, not doing the raid', '2026-02-19 03:11:19'),
(38, 1036, 1, 'Changed my mind, not doing the raid', '2026-06-18 04:08:08'),
(39, 1037, 1, 'Changed my mind, not doing the raid', '2026-06-18 04:32:46');

-- --------------------------------------------------------

--
-- Table structure for table `raid_member_reviews`
--

CREATE TABLE `raid_member_reviews` (
  `id` int(11) NOT NULL,
  `room_id` int(11) NOT NULL,
  `reviewer_id` int(11) NOT NULL,
  `target_user_id` int(11) NOT NULL,
  `rating` tinyint(4) NOT NULL,
  `comment` text DEFAULT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `raid_member_reviews`
--

INSERT INTO `raid_member_reviews` (`id`, `room_id`, `reviewer_id`, `target_user_id`, `rating`, `comment`, `created_at`) VALUES
(62, 901, 135, 144, 5, NULL, '2026-02-19 10:02:06');

-- --------------------------------------------------------

--
-- Table structure for table `raid_reviews`
--

CREATE TABLE `raid_reviews` (
  `id` int(11) NOT NULL,
  `room_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `result` tinyint(1) NOT NULL COMMENT 'สำเร็จ / ไม่สำเร็จ',
  `rating` tinyint(4) NOT NULL,
  `comment` text DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `raid_reviews`
--

INSERT INTO `raid_reviews` (`id`, `room_id`, `user_id`, `result`, `rating`, `comment`, `created_at`, `updated_at`) VALUES
(277, 683, 135, 0, 5, 'Raid success', '2025-12-18 14:49:23', NULL),
(283, 688, 135, 0, 1, 'FAILED: ทีม/ตัวคาวน์เตอร์ไม่เหมาะ (CP ต่ำ ดาเมจน้อย)', '2025-12-18 16:16:42', NULL),
(290, 695, 135, 0, 5, 'Raid success', '2025-12-19 14:53:18', NULL),
(293, 709, 135, 0, 5, 'Raid success', '2025-12-20 16:01:00', NULL),
(296, 714, 144, 0, 5, 'Raid success', '2025-12-21 17:42:30', NULL),
(297, 714, 139, 0, 5, 'Raid success', '2025-12-21 17:42:43', NULL),
(298, 717, 142, 0, 3, 'Raid success', '2025-12-22 14:19:46', NULL),
(300, 718, 142, 0, 5, 'Raid success', '2025-12-22 15:13:59', NULL),
(334, 809, 135, 1, 5, 'Raid success', '2026-01-16 13:05:18', NULL),
(426, 893, 135, 1, 5, 'Raid success', '2026-02-18 13:35:06', NULL),
(432, 901, 135, 1, 5, 'Raid success', '2026-02-19 10:02:06', NULL),
(457, 917, 142, 1, 5, 'Raid success', '2026-02-19 13:54:12', NULL),
(477, 943, 147, 1, 5, 'Raid success', '2026-02-20 16:00:25', NULL),
(487, 949, 147, 1, 5, 'Raid success', '2026-02-20 17:35:16', NULL),
(495, 956, 148, 1, 5, 'Raid success', '2026-02-23 13:01:28', NULL),
(503, 961, 148, 0, 1, 'FAILED: ทีม/ตัวคาวน์เตอร์ไม่เหมาะ (CP ต่ำ ดาเมจน้อย)', '2026-02-23 15:27:34', NULL),
(506, 962, 148, 1, 5, 'Raid success', '2026-02-23 16:05:04', NULL),
(509, 964, 148, 1, 5, 'Raid success', '2026-02-23 16:07:26', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `raid_rooms`
--

CREATE TABLE `raid_rooms` (
  `id` int(11) NOT NULL,
  `raid_boss_id` int(11) NOT NULL,
  `pokemon_image` varchar(255) NOT NULL,
  `boss` varchar(255) NOT NULL,
  `start_time` datetime NOT NULL,
  `max_members` int(11) NOT NULL,
  `status` enum('active','closed','canceled','invited') NOT NULL DEFAULT 'active',
  `owner_id` int(11) NOT NULL,
  `min_level` int(11) DEFAULT NULL,
  `vip_only` tinyint(1) DEFAULT NULL,
  `lock_room` tinyint(1) DEFAULT NULL,
  `password_room` varchar(10) DEFAULT NULL,
  `note` varchar(255) DEFAULT NULL,
  `avg_rating` decimal(3,2) DEFAULT NULL,
  `review_count` int(11) NOT NULL DEFAULT 0,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `raid_rooms`
--

INSERT INTO `raid_rooms` (`id`, `raid_boss_id`, `pokemon_image`, `boss`, `start_time`, `max_members`, `status`, `owner_id`, `min_level`, `vip_only`, `lock_room`, `password_room`, `note`, `avg_rating`, `review_count`, `created_at`) VALUES
(683, 120, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/643.png', 'Reshiram', '2025-12-18 14:40:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, 5.00, 2, '2025-12-18 13:50:38'),
(688, 65, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm485.icon.png', 'Shadow Heatran', '2025-12-18 17:05:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, 1.00, 2, '2025-12-18 16:15:46'),
(690, 120, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/643.png', 'Reshiram', '2025-12-18 16:35:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-18 16:29:07'),
(695, 131, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/112.png', 'Rhydon', '2025-12-19 14:50:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, 5.00, 2, '2025-12-19 14:02:34'),
(696, 120, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/643.png', 'Reshiram', '2025-12-19 14:55:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-19 14:48:28'),
(698, 120, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/643.png', 'Reshiram', '2025-12-19 17:20:00', 3, 'closed', 135, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-19 16:32:16'),
(699, 65, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm485.icon.png', 'Shadow Heatran', '2025-12-19 16:50:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-19 16:34:18'),
(702, 122, 'https://sg.portal-pokemon.com/play/resources/pokedex/img/pm/e7aead89c6404be16d7c69ced223b9f5567d6bed.png', 'Mega Abomasnow', '2025-12-19 17:50:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-19 17:02:19'),
(709, 122, 'https://sg.portal-pokemon.com/play/resources/pokedex/img/pm/e7aead89c6404be16d7c69ced223b9f5567d6bed.png', 'Mega Abomasnow', '2025-12-20 16:45:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, 5.00, 2, '2025-12-20 15:57:58'),
(710, 120, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/643.png', 'Reshiram', '2025-12-20 22:20:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-20 21:33:44'),
(712, 131, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/112.png', 'Rhydon', '2025-12-21 13:45:00', 6, 'closed', 139, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-21 12:58:57'),
(713, 120, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/643.png', 'Reshiram', '2025-12-21 17:10:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-21 17:06:24'),
(714, 120, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/643.png', 'Reshiram', '2025-12-21 18:25:00', 6, 'closed', 144, NULL, NULL, NULL, NULL, NULL, 5.00, 2, '2025-12-21 17:37:10'),
(715, 120, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/643.png', 'Reshiram', '2025-12-22 00:20:00', 6, 'closed', 139, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-21 23:30:19'),
(716, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-22 00:05:00', 6, 'closed', 139, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-22 00:01:45'),
(717, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-22 14:30:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, NULL, 4.00, 3, '2025-12-22 13:43:05'),
(718, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-22 15:50:00', 6, 'closed', 142, 40, 1, 1, '654312', 'เข้ามาเลยครับ พวก VIP ทั้งหลาย', 5.00, 2, '2025-12-22 15:04:53'),
(719, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-22 16:00:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-22 15:14:17'),
(720, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-23 09:35:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, 'ขอ 3 คน ไหวครับ', NULL, 0, '2025-12-23 08:46:39'),
(721, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-23 12:30:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-23 11:41:00'),
(722, 65, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm485.icon.png', 'Shadow Heatran', '2025-12-23 12:30:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-23 11:43:03'),
(723, 123, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/362.png', 'Glalie', '2025-12-23 12:30:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-23 11:45:19'),
(724, 64, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm737.icon.png', 'Charjabug', '2025-12-23 12:35:00', 2, 'closed', 142, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-23 11:47:39'),
(726, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-23 17:00:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-23 16:13:21'),
(727, 65, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm485.icon.png', 'Shadow Heatran', '2025-12-23 17:45:00', 6, 'closed', 139, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-23 16:57:37'),
(728, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-23 17:05:00', 6, 'closed', 139, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-23 17:01:01'),
(762, 123, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/362.png', 'Glalie', '2025-12-24 14:50:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-24 14:43:16'),
(763, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-24 14:50:00', 6, 'closed', 143, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-24 14:43:35'),
(764, 135, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm713.fHISUIAN.icon.png', 'Hisuian Avalugg', '2025-12-24 14:50:00', 6, 'closed', 144, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-24 14:43:50'),
(765, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-24 15:20:00', 6, 'closed', 137, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-24 15:11:18'),
(766, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-24 16:20:00', 6, 'closed', 137, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2025-12-24 15:33:43'),
(768, 121, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/644.png', 'Zekrom', '2025-12-25 10:05:00', 6, 'closed', 142, NULL, NULL, NULL, NULL, 'หาคนช่วย 5 คนครับ', NULL, 0, '2025-12-25 09:17:05'),
(792, 146, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/254_f2.png', 'Sceptile', '2026-01-13 16:55:00', 6, 'closed', 144, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-01-13 16:07:13'),
(809, 144, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/641.png', 'Tornadus', '2026-01-16 13:10:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, 3.67, 3, '2026-01-16 13:02:11'),
(893, 82, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm445.fMEGA.icon.png', 'Mega Garchomp', '2026-02-18 14:20:00', 6, 'closed', 135, NULL, NULL, NULL, NULL, NULL, 5.00, 2, '2026-02-18 13:33:08'),
(897, 82, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm445.fMEGA.icon.png', 'Mega Garchomp', '2026-02-18 14:55:00', 6, 'canceled', 135, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-02-18 14:14:17'),
(898, 67, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm310.fMEGA.icon.png', 'Mega Manectric', '2026-02-18 15:20:00', 5, 'closed', 135, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-02-18 14:30:33'),
(901, 82, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm445.fMEGA.icon.png', 'Mega Garchomp', '2026-02-19 10:20:00', 6, 'invited', 135, NULL, NULL, NULL, NULL, NULL, 4.67, 3, '2026-02-19 09:34:26'),
(903, 148, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/257_f2.png', 'Blaziken', '2026-02-19 11:00:00', 6, 'canceled', 135, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-02-19 10:11:03'),
(917, 67, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm310.fMEGA.icon.png', 'Mega Manectric', '2026-02-19 14:35:00', 6, 'closed', 142, NULL, 1, NULL, NULL, NULL, 5.00, 2, '2026-02-19 13:48:32'),
(943, 148, 'https://www.pokemon.com/static-assets/content-assets/cms2/img/pokedex/full/257_f2.png', 'Blaziken', '2026-02-20 16:25:00', 6, 'closed', 147, NULL, NULL, NULL, NULL, NULL, 5.00, 1, '2026-02-20 15:35:59'),
(949, 67, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm310.fMEGA.icon.png', 'Mega Manectric', '2026-02-20 17:35:00', 6, 'closed', 147, NULL, NULL, NULL, NULL, NULL, 5.00, 1, '2026-02-20 17:30:52'),
(956, 68, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm381.icon.png', 'Shadow Latios', '2026-02-23 13:35:00', 6, 'closed', 148, NULL, NULL, NULL, NULL, NULL, 5.00, 1, '2026-02-23 12:47:32'),
(961, 78, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm639.icon.png', 'Terrakion', '2026-02-23 15:35:00', 6, 'closed', 148, NULL, NULL, NULL, NULL, NULL, 1.00, 2, '2026-02-23 15:09:11'),
(962, 79, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm640.icon.png', 'Virizion', '2026-02-23 16:05:00', 6, 'closed', 148, NULL, NULL, NULL, NULL, NULL, 5.00, 2, '2026-02-23 15:19:23'),
(964, 78, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm639.icon.png', 'Terrakion', '2026-02-23 16:10:00', 6, 'closed', 148, NULL, NULL, NULL, NULL, NULL, 5.00, 1, '2026-02-23 16:05:10'),
(966, 79, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm640.icon.png', 'Virizion', '2026-02-23 16:25:00', 6, 'closed', 148, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-02-23 16:19:42'),
(968, 68, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm381.icon.png', 'Shadow Latios', '2026-02-23 16:55:00', 6, 'active', 148, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-02-23 16:47:53'),
(1030, 78, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm639.icon.png', 'Mega Terrakion', '2026-03-19 15:56:49', 6, 'closed', 151, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-03-19 15:06:49'),
(1036, 77, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm638.icon.png', 'Cobalion', '2026-06-18 11:22:30', 6, 'canceled', 151, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-06-18 11:02:30'),
(1037, 77, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm638.icon.png', 'Cobalion', '2026-06-18 11:52:39', 6, 'canceled', 155, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-06-18 11:32:39'),
(1038, 77, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm638.icon.png', 'Cobalion', '2026-06-18 15:39:59', 6, 'closed', 151, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-06-18 14:49:59'),
(1039, 77, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm638.icon.png', 'Cobalion', '2026-06-18 16:13:27', 6, 'closed', 151, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-06-18 15:53:27'),
(1040, 77, 'https://cdn.leekduck.com/assets/img/pokemon_icons/pm638.icon.png', 'Cobalion', '2026-06-18 17:42:30', 6, 'closed', 151, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-06-18 16:52:30');

-- --------------------------------------------------------

--
-- Table structure for table `raid_rooms_log`
--

CREATE TABLE `raid_rooms_log` (
  `id` int(11) NOT NULL,
  `room_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `type` enum('join','leave','invite','review','create','cancel','update','close') NOT NULL,
  `target` varchar(255) DEFAULT NULL,
  `description` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `raid_rooms_log`
--

INSERT INTO `raid_rooms_log` (`id`, `room_id`, `user_id`, `type`, `target`, `description`, `created_at`) VALUES
(787, 683, 135, 'create', '', 'สร้างห้อง', '2025-12-18 13:50:38'),
(791, 683, 135, 'invite', '', 'เชิญในเกมแล้ว', '2025-12-18 14:27:12'),
(792, 683, 135, 'review', '5 ดาว', 'ทำการรีวิวแล้ว ตีบอสสำเร็จ', '2025-12-18 14:49:23'),
(809, 688, 135, 'create', '', 'สร้างห้อง', '2025-12-18 16:15:46'),
(811, 688, 135, 'invite', '', 'เชิญในเกมแล้ว', '2025-12-18 16:15:54'),
(813, 688, 135, 'review', 'ทีม/ตัวคาวน์เตอร์ไม่เหมาะ (CP ต่ำ ดาเมจน้อย)', 'ทำการรีวิวแล้ว ตีบอสไม่สำเร็จ', '2025-12-18 16:16:42'),
(817, 690, 135, 'create', '', 'สร้างห้อง', '2025-12-18 16:29:07'),
(837, 695, 135, 'create', '', 'สร้างห้อง', '2025-12-19 14:02:34'),
(839, 695, 135, 'invite', '', 'เชิญในเกมแล้ว', '2025-12-19 14:10:49'),
(840, 696, 135, 'create', '', 'สร้างห้อง', '2025-12-19 14:48:28'),
(842, 695, 135, 'review', '5 ดาว', 'ทำการรีวิวแล้ว ตีบอสสำเร็จ', '2025-12-19 14:53:18'),
(845, 698, 135, 'create', '', 'สร้างห้อง', '2025-12-19 16:32:16'),
(846, 699, 135, 'create', '', 'สร้างห้อง', '2025-12-19 16:34:18'),
(849, 698, 137, 'join', '', 'เข้าร่วมห้อง', '2025-12-19 16:37:23'),
(850, 702, 135, 'create', '', 'สร้างห้อง', '2025-12-19 17:02:19'),
(866, 709, 135, 'create', '', 'สร้างห้อง', '2025-12-20 15:57:59'),
(868, 709, 135, 'invite', '', 'เชิญในเกมแล้ว', '2025-12-20 16:00:17'),
(869, 709, 135, 'review', '5 ดาว', 'ทำการรีวิวแล้ว ตีบอสสำเร็จ', '2025-12-20 16:01:01'),
(870, 710, 135, 'create', '', 'สร้างห้อง', '2025-12-20 21:33:44'),
(873, 710, 139, 'join', '', 'เข้าร่วมห้อง', '2025-12-20 22:02:27'),
(876, 712, 139, 'create', '', 'สร้างห้อง', '2025-12-21 12:58:57'),
(877, 712, 139, 'invite', 'AvenderMasterTH', 'ทำการเชิญเพื่อนเข้าร่วมห้อง', '2025-12-21 13:05:32'),
(878, 713, 142, 'create', '', 'สร้างห้อง', '2025-12-21 17:06:24'),
(879, 714, 144, 'create', '', 'สร้างห้อง', '2025-12-21 17:37:10'),
(880, 714, 139, 'join', '', 'เข้าร่วมห้อง', '2025-12-21 17:38:35'),
(881, 714, 144, 'invite', '', 'เชิญในเกมแล้ว', '2025-12-21 17:41:34'),
(882, 714, 144, 'review', '5 ดาว', 'ทำการรีวิวแล้ว ตีบอสสำเร็จ', '2025-12-21 17:42:30'),
(883, 714, 139, 'review', '5 ดาว', 'ทำการรีวิวแล้ว ตีบอสสำเร็จ', '2025-12-21 17:42:43'),
(884, 715, 139, 'create', '', 'สร้างห้อง', '2025-12-21 23:30:19'),
(885, 715, 139, 'invite', 'AvenderMasterTH', 'ทำการเชิญเพื่อนเข้าร่วมห้อง', '2025-12-21 23:30:29'),
(886, 715, 139, 'invite', 'AvenderMasterTH', 'ทำการเชิญเพื่อนเข้าร่วมห้อง', '2025-12-21 23:56:14'),
(887, 716, 139, 'create', '', 'สร้างห้อง', '2025-12-22 00:01:45'),
(888, 717, 142, 'create', '', 'สร้างห้อง', '2025-12-22 13:43:05'),
(894, 717, 142, 'invite', '', 'เชิญในเกมแล้ว', '2025-12-22 14:18:00'),
(895, 717, 142, 'review', '3 ดาว', 'ทำการรีวิวแล้ว ตีบอสสำเร็จ', '2025-12-22 14:19:46'),
(897, 718, 142, 'create', '', 'สร้างห้อง', '2025-12-22 15:04:53'),
(899, 718, 142, 'invite', '', 'เชิญในเกมแล้ว', '2025-12-22 15:12:48'),
(900, 718, 142, 'review', '5 ดาว', 'ทำการรีวิวแล้ว ตีบอสสำเร็จ', '2025-12-22 15:13:59'),
(901, 719, 142, 'create', '', 'สร้างห้อง', '2025-12-22 15:14:17'),
(905, 720, 142, 'create', '', 'สร้างห้อง', '2025-12-23 08:46:40'),
(911, 721, 142, 'create', '', 'สร้างห้อง', '2025-12-23 11:41:00'),
(912, 722, 142, 'create', '', 'สร้างห้อง', '2025-12-23 11:43:03'),
(913, 723, 142, 'create', '', 'สร้างห้อง', '2025-12-23 11:45:19'),
(914, 724, 142, 'create', '', 'สร้างห้อง', '2025-12-23 11:47:39'),
(920, 726, 142, 'create', '', 'สร้างห้อง', '2025-12-23 16:13:21'),
(921, 726, 139, 'join', '', 'เข้าร่วมห้อง', '2025-12-23 16:54:51'),
(922, 727, 139, 'create', '', 'สร้างห้อง', '2025-12-23 16:57:37'),
(923, 728, 139, 'create', '', 'สร้างห้อง', '2025-12-23 17:01:01'),
(976, 762, 142, 'create', '', 'สร้างห้อง', '2025-12-24 14:43:16'),
(977, 763, 143, 'create', '', 'สร้างห้อง', '2025-12-24 14:43:35'),
(978, 764, 144, 'create', '', 'สร้างห้อง', '2025-12-24 14:43:50'),
(981, 765, 137, 'create', '', 'สร้างห้อง', '2025-12-24 15:11:18'),
(982, 765, 137, 'update', '', 'ปิดห้อง', '2025-12-24 15:21:03'),
(983, 766, 137, 'create', '', 'สร้างห้อง', '2025-12-24 15:33:44'),
(987, 768, 142, 'create', '', 'สร้างห้อง', '2025-12-25 09:17:05'),
(1034, 792, 144, 'create', '', 'สร้างห้อง', '2026-01-13 16:07:13'),
(1128, 809, 135, 'create', '', 'สร้างห้อง', '2026-01-16 13:02:11'),
(1131, 809, 135, 'invite', '', 'เชิญในเกมแล้ว', '2026-01-16 13:05:11'),
(1132, 809, 135, 'review', '5 ดาว', 'ทำการรีวิว ตีบอสสำเร็จ', '2026-01-16 13:05:18'),
(1159, 792, 144, 'update', '', 'ปิดห้อง เนื่องจากหมดเวลา', '2026-01-29 17:25:29'),
(1667, 893, 135, 'create', '', 'สร้างห้อง', '2026-02-18 13:33:08'),
(1669, 893, 135, 'invite', '', 'เชิญในเกมแล้ว', '2026-02-18 13:34:56'),
(1670, 893, 135, 'review', '', 'รีวิวผู้เข้าร่วม 1 คน', '2026-02-18 13:35:06'),
(1706, 897, 135, 'create', '', 'สร้างห้อง', '2026-02-18 14:14:17'),
(1707, 897, 135, 'cancel', 'Changed my mind, not doing the raid', 'ยกเลิกห้อง', '2026-02-18 14:14:37'),
(1714, 898, 135, 'create', '', 'สร้างห้อง', '2026-02-18 14:30:33'),
(1716, 898, 135, 'update', '', 'ปิดห้อง เนื่องจากหมดเวลา', '2026-02-18 15:26:04'),
(1720, 901, 135, 'create', '', 'สร้างห้อง', '2026-02-19 09:34:26'),
(1721, 901, 135, 'invite', 'AvenderMasterTH', 'ทำการเชิญเพื่อนเข้าร่วมห้อง', '2026-02-19 09:35:34'),
(1728, 901, 144, 'join', '', 'เข้าร่วมห้อง', '2026-02-19 09:54:31'),
(1729, 901, 144, 'invite', 'AvenderMasterTH', 'ทำการเชิญเพื่อนเข้าร่วมห้อง', '2026-02-19 09:56:49'),
(1734, 901, 135, 'invite', '', 'เชิญในเกมแล้ว', '2026-02-19 10:01:06'),
(1735, 901, 135, 'review', '', 'รีวิวผู้เข้าร่วม 3 คน', '2026-02-19 10:02:06'),
(1737, 903, 135, 'create', '', 'สร้างห้อง', '2026-02-19 10:11:03'),
(1738, 903, 135, 'cancel', 'Changed my mind, not doing the raid', 'ยกเลิกห้อง', '2026-02-19 10:11:20'),
(1806, 917, 142, 'create', '', 'สร้างห้อง', '2026-02-19 13:48:32'),
(1812, 917, 142, 'invite', '', 'เชิญในเกมแล้ว', '2026-02-19 13:54:03'),
(1813, 917, 142, 'review', '', 'รีวิวผู้เข้าร่วม 1 คน', '2026-02-19 13:54:12'),
(1976, 943, 147, 'create', '', 'สร้างห้อง', '2026-02-20 15:35:59'),
(1978, 943, 147, 'invite', '', 'เชิญในเกมแล้ว', '2026-02-20 15:59:31'),
(1980, 943, 147, 'review', '', 'รีวิวผู้เข้าร่วม 1 คน', '2026-02-20 16:00:25'),
(1981, 943, 147, 'close', '', 'ปิดห้อง เนื่องจากรีวิวครบ', '2026-02-20 16:00:25'),
(2010, 949, 147, 'create', '', 'สร้างห้อง', '2026-02-20 17:30:52'),
(2014, 949, 147, 'invite', '', 'เชิญในเกมแล้ว', '2026-02-20 17:31:33'),
(2020, 949, 147, 'review', '', 'รีวิวผู้เข้าร่วม 1 คน', '2026-02-20 17:35:16'),
(2021, 949, 147, 'close', '', 'ปิดห้อง เนื่องจากรีวิวครบ', '2026-02-20 17:35:16'),
(2060, 956, 148, 'create', '', 'สร้างห้อง', '2026-02-23 12:47:32'),
(2066, 956, 148, 'invite', '', 'เชิญในเกมแล้ว', '2026-02-23 13:01:07'),
(2068, 956, 148, 'review', '', 'รีวิวผู้เข้าร่วม 1 คน', '2026-02-23 13:01:28'),
(2069, 956, 148, 'close', '', 'ปิดห้อง เนื่องจากรีวิวครบ', '2026-02-23 13:01:28'),
(2103, 961, 148, 'create', '', 'สร้างห้อง', '2026-02-23 15:09:11'),
(2104, 962, 148, 'create', '', 'สร้างห้อง', '2026-02-23 15:19:24'),
(2112, 961, 148, 'invite', '', 'เชิญในเกมแล้ว', '2026-02-23 15:26:53'),
(2114, 961, 148, 'review', '1', 'ทำการรีวิว ตีบอสไม่สำเร็จ', '2026-02-23 15:27:34'),
(2115, 961, 148, 'close', '', 'ปิดห้อง เนื่องจากรีวิวครบ', '2026-02-23 15:27:34'),
(2142, 962, 148, 'invite', '', 'เชิญในเกมแล้ว', '2026-02-23 16:04:40'),
(2143, 962, 148, 'review', '', 'รีวิวผู้เข้าร่วม 1 คน', '2026-02-23 16:05:04'),
(2144, 964, 148, 'create', '', 'สร้างห้อง', '2026-02-23 16:05:10'),
(2148, 964, 148, 'invite', '', 'เชิญในเกมแล้ว', '2026-02-23 16:06:49'),
(2150, 964, 148, 'review', '', 'รีวิวผู้เข้าร่วม 1 คน', '2026-02-23 16:07:26'),
(2151, 964, 148, 'close', '', 'ปิดห้อง เนื่องจากรีวิวครบ', '2026-02-23 16:07:26'),
(2157, 966, 148, 'create', '', 'สร้างห้อง', '2026-02-23 16:19:42'),
(2171, 966, 148, 'update', '', 'ปิดห้อง เนื่องจากหมดเวลา', '2026-02-23 16:46:01'),
(2172, 968, 148, 'create', '', 'สร้างห้อง', '2026-02-23 16:47:53'),
(2393, 1030, 151, 'create', '', 'สร้างห้อง', '2026-03-19 15:06:49'),
(2394, 1030, 151, 'close', NULL, 'ปิดห้อง', '2026-03-19 15:59:43'),
(2405, 1036, 151, 'create', '', 'สร้างห้อง', '2026-06-18 11:02:30'),
(2406, 1036, 151, 'cancel', 'Changed my mind, not doing the raid', 'ยกเลิกห้อง', '2026-06-18 11:08:08'),
(2407, 1037, 155, 'create', '', 'สร้างห้อง', '2026-06-18 11:32:39'),
(2408, 1037, 155, 'cancel', 'Changed my mind, not doing the raid', 'ยกเลิกห้อง', '2026-06-18 11:32:46'),
(2409, 1038, 151, 'create', '', 'สร้างห้อง', '2026-06-18 14:49:59'),
(2410, 1038, 151, 'close', NULL, 'ปิดห้อง', '2026-06-18 15:40:05'),
(2411, 1039, 151, 'create', '', 'สร้างห้อง', '2026-06-18 15:53:27'),
(2412, 1039, 151, 'close', NULL, 'ปิดห้อง', '2026-06-18 16:22:31'),
(2413, 1040, 151, 'create', '', 'สร้างห้อง', '2026-06-18 16:52:30'),
(2414, 1040, 155, 'join', '', 'เข้าร่วมห้อง', '2026-06-18 17:03:53'),
(2415, 1040, 155, 'close', NULL, 'ปิดห้อง', '2026-06-18 17:54:18');

-- --------------------------------------------------------

--
-- Table structure for table `redemption_history`
--

CREATE TABLE `redemption_history` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `points_spent` int(11) NOT NULL,
  `redeemed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `redemption_history`
--

INSERT INTO `redemption_history` (`id`, `user_id`, `item_id`, `points_spent`, `redeemed_at`) VALUES
(8, 155, 3, 150, '2026-06-18 11:04:06'),
(9, 155, 3, 150, '2026-06-18 11:04:14'),
(10, 155, 3, 150, '2026-06-18 11:05:12'),
(11, 155, 3, 150, '2026-06-18 11:05:19');

-- --------------------------------------------------------

--
-- Table structure for table `reports`
--

CREATE TABLE `reports` (
  `id` int(11) NOT NULL,
  `report_type` enum('user','room','other') NOT NULL,
  `target_id` int(11) NOT NULL,
  `reporter_id` int(11) NOT NULL,
  `reason` text NOT NULL,
  `status` enum('pending','reviewed','resolved') DEFAULT 'pending',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `reports`
--

INSERT INTO `reports` (`id`, `report_type`, `target_id`, `reporter_id`, `reason`, `status`, `created_at`, `updated_at`) VALUES
(34, 'other', 0, 139, 'ระบบทีมาดีมากเลยครับ', 'resolved', '2025-12-20 15:04:12', '2025-12-26 07:13:50'),
(36, 'other', 0, 139, 'อยากให้มีฟีเจอร์ นัดเพื่อนเทรดโปรเกม่อน คนไทย ครับ', 'resolved', '2025-12-21 16:55:45', '2025-12-26 07:13:42'),
(37, 'other', 0, 142, 'อยากจะติดต่อ แอดมิน ครับ สำหรับการทำแอพ', 'resolved', '2025-12-25 02:19:55', '2025-12-25 02:20:57'),
(38, 'other', 0, 135, 'ระบบทำมาค่อนข้างแจ่มว้าวเลยครับ', 'pending', '2026-02-18 07:34:18', '2026-02-18 07:34:18'),
(40, 'user', 150, 151, 'Impersonation / not the account owner', 'pending', '2026-06-18 03:15:21', '2026-06-18 03:15:21'),
(41, 'user', 143, 155, 'สแปม / ชวนเรื่อยเปื่อย', 'pending', '2026-06-18 04:33:21', '2026-06-18 04:33:21');

-- --------------------------------------------------------

--
-- Table structure for table `shop_items`
--

CREATE TABLE `shop_items` (
  `id` int(11) NOT NULL,
  `name_th` varchar(100) NOT NULL,
  `name_en` varchar(100) NOT NULL,
  `description_th` text DEFAULT NULL,
  `description_en` text DEFAULT NULL,
  `cost_points` int(11) NOT NULL DEFAULT 0,
  `item_type` varchar(50) NOT NULL,
  `item_value` varchar(100) DEFAULT NULL,
  `image_url` varchar(255) DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `shop_items`
--

INSERT INTO `shop_items` (`id`, `name_th`, `name_en`, `description_th`, `description_en`, `cost_points`, `item_type`, `item_value`, `image_url`, `is_active`, `created_at`) VALUES
(1, 'บัตร VIP 3 วัน', 'VIP Pass 3 Days', 'ปลดล็อกสิทธิ์ VIP ตีบอสไม่มีคูลดาวน์ และเข้าห้องได้ก่อน 10 วินาที นาน 3 วัน', 'Unlock VIP status, no room cooldown, and 10s early entry for 3 days', 300, 'vip_pass', '3', NULL, 1, '2026-06-18 07:23:42'),
(2, 'บัตร VIP 7 วัน', 'VIP Pass 7 Days', 'ปลดล็อกสิทธิ์ VIP ตีบอสไม่มีคูลดาวน์ และเข้าห้องได้ก่อน 10 วินาที นาน 7 วัน (สุดคุ้ม)', 'Unlock VIP status, no room cooldown, and 10s early entry for 7 days (Best Value)', 600, 'vip_pass', '7', NULL, 1, '2026-06-18 07:23:42'),
(3, 'บัตร VIP 1 วัน', 'VIP Pass 1 Days', 'ปลดล็อกสิทธิ์ VIP ตีบอสไม่มีคูลดาวน์ และเข้าห้องได้ก่อน 10 วินาที นาน 1 วัน', 'Unlock VIP status, no room cooldown, and 10s early entry for 1 days (Best Value)', 150, 'vip_pass', '1', NULL, 1, '2026-06-18 07:23:42'),
(4, 'สิทธิ์เปลี่ยนชื่อ 1 ครั้ง', 'Trainer Rename Pass', 'รับสิทธิ์ในการเปลี่ยนชื่อตัวละคร (Trainer Name) ของคุณในระบบจำนวน 1 ครั้ง', 'Allows you to change your Trainer Name in the system once', 200, 'rename_pass', '1', NULL, 1, '2026-06-18 07:23:42');

-- --------------------------------------------------------

--
-- Table structure for table `system_configs`
--

CREATE TABLE `system_configs` (
  `id` int(11) NOT NULL DEFAULT 1,
  `maintenance_mode` tinyint(1) DEFAULT 0 COMMENT '0=เปิด, 1=ปิดปรับปรุง',
  `maintenance_message` text DEFAULT NULL COMMENT 'ข้อความที่จะขึ้นเตือน',
  `min_version_android` varchar(10) DEFAULT '1.0.0',
  `min_version_ios` varchar(10) DEFAULT '1.0.0',
  `store_url_android` varchar(255) DEFAULT 'https://play.google.com/...',
  `store_url_ios` varchar(255) DEFAULT 'https://apps.apple.com/...',
  `vip` tinyint(1) DEFAULT 0,
  `feature` tinyint(1) DEFAULT 0,
  `ads_enabled` tinyint(1) NOT NULL,
  `show_announcement` tinyint(1) DEFAULT 0,
  `announcement_title` varchar(100) DEFAULT NULL,
  `announcement_body` text DEFAULT NULL,
  `announcement_link` varchar(255) DEFAULT NULL,
  `contact_line_id` varchar(50) DEFAULT '@pogopartyth',
  `privacy_policy_url` varchar(255) DEFAULT 'https://...'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `system_configs`
--

INSERT INTO `system_configs` (`id`, `maintenance_mode`, `maintenance_message`, `min_version_android`, `min_version_ios`, `store_url_android`, `store_url_ios`, `vip`, `feature`, `ads_enabled`, `show_announcement`, `announcement_title`, `announcement_body`, `announcement_link`, `contact_line_id`, `privacy_policy_url`) VALUES
(1, 0, 'ระบบกำลังปิดปรับปรุงชั่วคราว กรุณากลับมาใหม่เวลา 04:00 น.', '1.1.7', '1.0.3', 'https://play.google.com/store/apps/details?id=com.ppshken.pogopartyth', 'https://apps.apple.com/us/app/pokeraid-raid-from-home/id1507659524', 1, 1, 1, 0, 'เย็นนี้ 6 โมง! น้องแมวน้ำ Spheal กลิ้งมาแจก XP', 'Spotlight Hour วันนี้พบกับ Spheal (ชิมาซึ) พร้อมโบนัส XP x2 เมื่อวิวัฒนาการ!', 'https://pogopartyth.com/events/special', '@pogopartyth', 'https://pogopartyth.com/privacy');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `email` varchar(191) NOT NULL,
  `username` varchar(191) DEFAULT NULL,
  `password_hash` varchar(255) DEFAULT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `friend_code` varchar(32) DEFAULT NULL,
  `team` enum('Instinct','Mystic','Valor') DEFAULT NULL,
  `level` int(11) DEFAULT NULL,
  `device_token` varchar(255) DEFAULT NULL,
  `noti_status` enum('on','off') NOT NULL DEFAULT 'on',
  `setup_status` enum('yes','no') NOT NULL DEFAULT 'no',
  `role` enum('member','admin') NOT NULL,
  `status` enum('active','banned','inactive') DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `google_sub` varchar(64) DEFAULT NULL,
  `plan` enum('free','premium') NOT NULL DEFAULT 'free',
  `plan_expires_at` datetime DEFAULT NULL,
  `premium_since` datetime DEFAULT NULL,
  `points` int(11) DEFAULT 0,
  `last_checkin_date` date DEFAULT NULL,
  `checkin_streak` int(11) DEFAULT 0,
  `last_online_at` datetime DEFAULT NULL,
  `last_ad_checkin_date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `email`, `username`, `password_hash`, `avatar`, `friend_code`, `team`, `level`, `device_token`, `noti_status`, `setup_status`, `role`, `status`, `created_at`, `google_sub`, `plan`, `plan_expires_at`, `premium_since`, `points`, `last_checkin_date`, `checkin_streak`, `last_online_at`, `last_ad_checkin_date`) VALUES
(1, 'admin@pogopartyth.com', 'Admin System', '$2y$10$4vE5jbNVHAKg6/frHx2Hy.CEnTt/OQ3v6glsYrchnAGpEeBCY7asC', 'https://ui-avatars.com/api/?name=A&background=random&size=256&bold=true', '', '', 0, '', '', 'yes', 'admin', '', '2025-08-28 10:00:24', '', '', NULL, NULL, 0, NULL, 0, NULL, NULL),
(135, 'Puwanatz.30334@gmail.com', 'PuwanatzGZ', '$2y$10$LbsruHrNHk0qb2hCcd6DGO.7kGjQW20hBI3zHUgKrSirN8CavInLW', 'https://ui-avatars.com/api/?name=P&background=random&size=96&bold=true', '824692345348', 'Valor', 55, NULL, 'off', 'yes', 'member', 'active', '2025-12-17 11:44:44', NULL, 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(137, 'UprisingGZ007@gmail.com', 'UprisingGZ', '$2y$10$drBdReUi.QAf3e5pERyY9OEAbtn7JpBNbNM4PdLfAaTnRNw0hbCrO', 'https://ui-avatars.com/api/?name=U&background=random&size=256&bold=true', '824729034234', 'Mystic', 55, NULL, 'on', 'yes', 'member', 'active', '2025-12-19 16:35:11', NULL, 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(138, 'test@gmail.com', 'test', '$2y$10$h2Ra1sj.SNhwi22.PALuQ.ATWQUgJy7VnHX9.jr6JiK1Efc4fYRbi', 'https://ui-avatars.com/api/?name=T&background=random&size=256&bold=true', '827364923432', 'Valor', 44, 'ExponentPushToken[7s7jU1HvC8mjrx_gDmcKmw]', 'on', 'yes', 'member', 'active', '2025-12-19 17:21:28', NULL, 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(139, 'pogopartyth@gmail.com', 'PogopartyTH', '$2y$10$us.rpuMr5bdOUAowT7aXxOfB37Fe9IVafF1CbM6Oza0.pkVOU9Xdm', 'https://lh3.googleusercontent.com/a/ACg8ocKFHg0L3gkCDjCyQLuynuEoGYRi64oMvpAmdCE7zkThLaEh8ek=s96-c', '639864321898', 'Mystic', 55, NULL, 'on', 'yes', 'member', 'active', '2025-12-20 21:38:42', '115561654006424609279', 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(140, 'investlevelofficial@gmail.com', NULL, NULL, 'https://lh3.googleusercontent.com/a/ACg8ocK1WLVUPxWUbg3dzHRSoYc-_ya3T5BYe-Oe5mXnfh2pz5j8sA=s96-c', NULL, NULL, NULL, '', 'on', 'no', 'member', NULL, '2025-12-20 23:13:16', '104087667463534414306', 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(141, 'zenrales@gmail.com', NULL, NULL, 'https://lh3.googleusercontent.com/a/ACg8ocJ45DXguWMLvYYsucb51gMT9e5OEypaWmVwXwSv7--HiN22yANU=s96-c', NULL, NULL, NULL, 'ExponentPushToken[Dh8_J7JiT9lqzoaI6rOaRU]', 'on', 'no', 'member', NULL, '2025-12-20 23:38:06', '114111931583965674160', 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(142, 'developerappsheetappify@gmail.com', 'DevoloperGZ', '$2y$10$ZkYgLSpkUvW4cmQH.oGMF.EXA4ElgtCKU0scbIlX.cAn.hxjJzXK6', 'https://lh3.googleusercontent.com/a/ACg8ocJG1JEPE8TDmbkdpV8kEColfelL2LOX_2ZdIbjfyL_-tZgEvcE=s96-c', '873642349823', 'Mystic', 55, 'ExponentPushToken[5hGBOECcgA7A9Ce50cnSHf]', 'on', 'yes', 'member', 'active', '2025-12-21 17:05:14', '114543549743557516789', 'premium', '2026-01-21 15:04:12', '2025-12-22 15:04:12', 0, NULL, 0, NULL, NULL),
(143, 'hero17game@gmail.com', 'Hero17Game', '$2y$10$L1IKE.r9DDYONjrJzZI0.ej4NMHWnO.XcLKe1BIPSEHcrg4waTFwG', 'https://lh3.googleusercontent.com/a/ACg8ocKO0kGoqsnqkUppKm3CHb-ydaC0eLNUI75lyayLaCdFxaBYHw=s96-c', '923648258417', 'Valor', 43, NULL, 'on', 'yes', 'member', 'active', '2025-12-21 17:11:20', '102786861919023135724', 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(144, 'rme.mgth@gmail.com', 'Rme.mgTH', '$2y$10$VEnNEcafOijW/P83izdvveAAV.c1KPBxQhW9.UzTmsnUTSHIpEPAa', 'https://lh3.googleusercontent.com/a/ACg8ocJHezcRrbmhI-3MCM6T9xlqTFGyG4I66ZQqQBR23ABe1kuT7A=s96-c', '748123723482', 'Valor', 44, NULL, 'on', 'yes', 'member', 'active', '2025-12-21 17:16:36', '107021139216885329925', 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(147, 'appsheet@kingwintransport.com', 'AppsheetKW', '$2y$10$IIVR2qm2Khx2gS21aWxa1.TW2Q8QGLr.v8sYF5..8B9Ga9adodpOK', 'https://ui-avatars.com/api/?name=K&background=random&size=256&bold=true', '356164843185', 'Instinct', 75, '', 'on', 'yes', 'member', 'active', '2026-02-20 15:11:13', '101467392080872934287', 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(148, 'usertest1@gmail.com', 'Kuyrisus', '$2y$10$UqKYeGkzqYXMTKvWgd65Je6FQUnh9x1m1VJReZQo2sQw.Ac/q7BGa', 'https://ui-avatars.com/api/?name=U&background=random&size=256&bold=true', '294023405435', 'Valor', 70, NULL, 'on', 'yes', 'member', 'active', '2026-02-23 11:44:07', NULL, 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(150, 'pogotest1@gmail.com', 'AkenzaMasterTHZ', '$2y$10$6w4R5akeq5gYIjSk/YharOpztbIuX3Qr1DXEim4yf3Czu9K2i.qV.', 'https://ui-avatars.com/api/?name=P&background=random&size=256&bold=true', '577493721629', 'Instinct', 37, NULL, 'on', 'yes', 'member', 'active', '2026-03-16 17:40:06', NULL, 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(151, 'kenzanaqq@gmail.com', 'AkenzaMasterTH', '$2y$10$HFBtLG3vbZ8qe.A4wJM/xeO5wd1i2TTnaW0wCjX2Fift3sim9HLJy', 'http://110.100.101.65/PogopartyTH/api/uploads/avatars/u151_1773909684_8e5f7664.jpg', '577493721629', 'Instinct', 37, NULL, 'on', 'yes', 'member', 'active', '2026-03-17 10:47:04', NULL, 'free', NULL, NULL, 20, '2026-06-18', 1, '2026-06-18 17:00:16', '2026-06-18'),
(152, 'sldkfj@sdf.com', NULL, NULL, 'https://ui-avatars.com/api/?name=S&background=random&size=256&bold=true', NULL, NULL, NULL, NULL, 'on', 'no', 'member', 'active', '2026-04-07 10:26:25', NULL, 'free', NULL, NULL, 0, NULL, 0, NULL, NULL),
(155, 'kensaohin@gmail.com', 'AvenderMasterTH', '$2y$10$rhPfOgaGdENqrZkafAGDdeQh49G/ppPockN6X78Af4dw1wDgyfZ0y', 'https://ui-avatars.com/api/?name=K&background=random&size=256&bold=true', '393486148074', 'Mystic', 71, 'ExponentPushToken[_7JX5xIocHAxkNlMosDgiS]', 'on', 'yes', 'member', 'active', '2026-06-18 11:31:25', NULL, 'premium', '2026-06-20 18:05:12', NULL, 250, '2026-06-18', 1, '2026-06-18 18:03:37', '2026-06-18');

-- --------------------------------------------------------

--
-- Table structure for table `user_device`
--

CREATE TABLE `user_device` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `platform` enum('android','ios') NOT NULL,
  `app_version` varchar(10) NOT NULL,
  `language` varchar(255) NOT NULL,
  `country` varchar(255) NOT NULL,
  `timezone` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_device`
--

INSERT INTO `user_device` (`id`, `user_id`, `platform`, `app_version`, `language`, `country`, `timezone`, `created_at`, `updated_at`) VALUES
(19, 150, 'android', '1.1.7', 'en', '', '', '2026-03-16 17:40:06', '2026-03-16 17:41:26'),
(22, 151, 'android', '1.2.1', 'th', 'TH', 'Asia/Bangkok', '2026-03-17 10:47:04', '2026-06-18 17:00:16'),
(42, 152, 'android', '1.1.9', 'th', 'TH', 'Asia/Bangkok', '2026-04-07 10:26:25', '2026-04-07 10:35:36'),
(52, 155, 'android', '1.2.1', 'en', 'TH', 'Asia/Bangkok', '2026-06-18 11:31:25', '2026-06-18 18:03:37');

-- --------------------------------------------------------

--
-- Table structure for table `user_items`
--

CREATE TABLE `user_items` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `is_equipped` tinyint(1) DEFAULT 0,
  `acquired_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `user_items`
--

INSERT INTO `user_items` (`id`, `user_id`, `item_id`, `is_equipped`, `acquired_at`) VALUES
(1, 151, 3, 0, '2026-06-18 07:33:35'),
(2, 151, 4, 0, '2026-06-18 07:33:49'),
(3, 151, 1, 0, '2026-06-18 07:34:04'),
(4, 155, 3, 0, '2026-06-18 10:35:26'),
(5, 155, 2, 0, '2026-06-18 10:35:33'),
(6, 155, 4, 0, '2026-06-18 10:56:51'),
(7, 155, 4, 0, '2026-06-18 10:57:05'),
(8, 155, 3, 0, '2026-06-18 11:04:06'),
(9, 155, 3, 0, '2026-06-18 11:04:14'),
(10, 155, 3, 0, '2026-06-18 11:05:12'),
(11, 155, 3, 0, '2026-06-18 11:05:19');

-- --------------------------------------------------------

--
-- Table structure for table `user_log`
--

CREATE TABLE `user_log` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `type` enum('addfriend','acceptfriend','login','online_lasted','declinfriend','edit_profile','report','interest') NOT NULL,
  `description` text NOT NULL,
  `target` varchar(255) DEFAULT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_log`
--

INSERT INTO `user_log` (`id`, `user_id`, `type`, `description`, `target`, `created_at`) VALUES
(422, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-17 11:49:35'),
(427, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-17 12:45:18'),
(428, 135, 'acceptfriend', 'รับเพื่อน', '134', '2025-12-17 12:46:13'),
(429, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-17 12:48:18'),
(430, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-17 12:48:19'),
(432, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-17 12:49:11'),
(435, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-17 12:51:22'),
(441, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-17 15:23:15'),
(444, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-17 16:17:59'),
(446, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-17 16:42:59'),
(448, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-17 16:46:18'),
(450, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-17 16:57:52'),
(452, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-17 17:24:33'),
(462, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 13:17:52'),
(463, 135, 'addfriend', 'เพิ่มเพื่อน', '136', '2025-12-18 13:18:06'),
(464, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 13:20:52'),
(465, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 13:22:28'),
(466, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 13:32:23'),
(467, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 13:42:04'),
(468, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-18 14:01:47'),
(470, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-18 14:26:10'),
(471, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 14:49:16'),
(472, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 15:06:28'),
(474, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-18 15:16:50'),
(477, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 15:35:48'),
(478, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-18 16:17:23'),
(480, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-18 16:20:26'),
(483, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-18 16:27:08'),
(484, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 16:31:48'),
(485, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 16:32:03'),
(487, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 16:41:49'),
(491, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-18 17:28:17'),
(493, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-18 17:28:43'),
(494, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 17:29:00'),
(495, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-18 17:33:00'),
(503, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-18 17:43:47'),
(512, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 10:38:16'),
(513, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 11:46:44'),
(516, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-19 11:52:00'),
(517, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-19 13:18:39'),
(518, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2025-12-19 14:04:45'),
(519, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:09:08'),
(520, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:14:05'),
(521, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:15:00'),
(522, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:16:39'),
(523, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:19:14'),
(525, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:26:17'),
(526, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:27:05'),
(527, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:28:39'),
(528, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:38:23'),
(530, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:46:16'),
(531, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:46:22'),
(532, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 14:47:43'),
(533, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 15:12:06'),
(534, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 15:12:22'),
(535, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-19 16:17:38'),
(537, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-19 16:32:06'),
(538, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-19 16:32:56'),
(539, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-19 16:36:00'),
(542, 137, 'login', 'ล็อคอินล่าสุดโดย Email', '137', '2025-12-19 16:37:20'),
(543, 137, 'addfriend', 'เพิ่มเพื่อน', '136', '2025-12-19 16:39:11'),
(544, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-19 16:56:02'),
(545, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-19 16:57:14'),
(546, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-19 17:00:30'),
(547, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-19 17:01:53'),
(548, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-19 17:02:07'),
(551, 137, 'login', 'ล็อคอินล่าสุดโดย Email', '137', '2025-12-19 17:03:35'),
(561, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-20 15:53:06'),
(562, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-20 15:54:51'),
(563, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-20 15:56:06'),
(564, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-20 15:57:17'),
(565, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-20 15:57:47'),
(567, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-20 15:59:21'),
(568, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2025-12-20 16:01:29'),
(569, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-20 21:27:15'),
(570, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-20 21:33:38'),
(571, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2025-12-20 21:36:14'),
(572, 139, 'login', 'ล็อคอินล่าสุดโดย Google', '139', '2025-12-20 21:38:42'),
(573, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-20 21:41:35'),
(574, 139, 'login', 'ล็อคอินล่าสุดโดย Google', '139', '2025-12-20 21:51:44'),
(577, 139, 'login', 'ล็อคอินล่าสุดโดย Google', '139', '2025-12-20 22:02:23'),
(578, 139, 'addfriend', 'เพิ่มเพื่อน', '136', '2025-12-20 22:02:57'),
(579, 139, 'report', 'รายงาน', '#ระบบ ระบบทีมาดีมากเลยครับ', '2025-12-20 22:04:12'),
(580, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-20 22:29:03'),
(581, 139, 'login', 'ล็อคอินล่าสุดโดย Google', '139', '2025-12-20 22:31:18'),
(582, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-20 22:32:11'),
(583, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-20 22:32:26'),
(584, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-20 22:32:29'),
(585, 140, 'login', 'ล็อคอินล่าสุดโดย Google', '140', '2025-12-20 23:13:16'),
(586, 141, 'login', 'ล็อคอินล่าสุดโดย Google', '141', '2025-12-20 23:38:06'),
(590, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 01:39:58'),
(591, 139, 'declinfriend', 'ปฏิเสธรับเพื่อน', '134', '2025-12-21 01:40:32'),
(593, 139, 'login', 'ล็อคอินล่าสุดโดย Google', '139', '2025-12-21 01:42:40'),
(598, 139, 'acceptfriend', 'รับเพื่อน', '134', '2025-12-21 01:54:01'),
(599, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 10:02:46'),
(600, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 10:05:10'),
(605, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 12:57:52'),
(606, 139, 'addfriend', 'เพิ่มเพื่อน', '135', '2025-12-21 12:59:45'),
(607, 139, 'addfriend', 'เพิ่มเพื่อน', '138', '2025-12-21 12:59:56'),
(608, 139, 'addfriend', 'เพิ่มเพื่อน', '137', '2025-12-21 13:00:01'),
(609, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-21 17:05:14'),
(610, 143, 'login', 'ล็อคอินล่าสุดโดย Google', '143', '2025-12-21 17:11:20'),
(611, 144, 'login', 'ล็อคอินล่าสุดโดย Google', '144', '2025-12-21 17:16:36'),
(612, 144, 'addfriend', 'เพิ่มเพื่อน', '136', '2025-12-21 17:17:26'),
(613, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 17:38:28'),
(614, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 23:26:38'),
(615, 144, 'online_lasted', 'ออนไลน์ล่าสุด', '144', '2025-12-21 23:26:39'),
(616, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 23:30:04'),
(617, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 23:39:44'),
(618, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 23:41:11'),
(619, 139, 'addfriend', 'เพิ่มเพื่อน', '143', '2025-12-21 23:54:05'),
(620, 139, 'report', 'รายงาน', '#ระบบ อยากให้มีฟีเจอร์ นัดเพื่อนเทรดโปรเกม่อน คนไทย ครับ', '2025-12-21 23:55:45'),
(621, 139, 'login', 'ล็อคอินล่าสุดโดย Google', '139', '2025-12-21 23:56:03'),
(622, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 23:57:39'),
(623, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-21 23:59:13'),
(624, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-22 13:41:54'),
(625, 142, 'addfriend', 'เพิ่มเพื่อน', '139', '2025-12-22 13:42:27'),
(632, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-22 14:17:31'),
(634, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-22 15:00:34'),
(635, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2025-12-22 15:03:52'),
(638, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-22 15:08:34'),
(643, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-22 16:49:51'),
(644, 142, 'acceptfriend', 'รับเพื่อน', '134', '2025-12-22 16:50:07'),
(646, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2025-12-23 08:46:18'),
(649, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-23 09:38:57'),
(650, 142, 'addfriend', 'เพิ่มเพื่อน', '138', '2025-12-23 11:43:41'),
(651, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-23 11:44:12'),
(656, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-23 14:45:35'),
(657, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-23 15:31:05'),
(658, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2025-12-23 15:39:22'),
(659, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-23 16:06:08'),
(660, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2025-12-23 16:37:33'),
(661, 139, 'login', 'ล็อคอินล่าสุดโดย Email', '139', '2025-12-23 16:42:55'),
(662, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-23 16:58:53'),
(663, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-23 17:00:41'),
(664, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-23 17:02:43'),
(665, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-23 17:03:12'),
(666, 139, 'online_lasted', 'ออนไลน์ล่าสุด', '139', '2025-12-23 17:03:25'),
(725, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2025-12-24 13:13:47'),
(726, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-24 13:14:08'),
(735, 142, 'login', 'ล็อคอินล่าสุดโดย Email', '142', '2025-12-24 14:43:09'),
(736, 143, 'login', 'ล็อคอินล่าสุดโดย Email', '143', '2025-12-24 14:43:29'),
(737, 144, 'login', 'ล็อคอินล่าสุดโดย Email', '144', '2025-12-24 14:43:45'),
(738, 137, 'login', 'ล็อคอินล่าสุดโดย Email', '137', '2025-12-24 14:44:21'),
(739, 137, 'edit_profile', 'อัปเดตโปรไฟล์', '137', '2025-12-24 14:45:18'),
(740, 137, 'declinfriend', 'ปฏิเสธรับเพื่อน', '139', '2025-12-24 14:45:42'),
(741, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 14:54:19'),
(742, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:11:08'),
(743, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:15:52'),
(744, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:16:39'),
(745, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:16:49'),
(746, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:17:28'),
(747, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:17:44'),
(748, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:18:13'),
(749, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:20:18'),
(750, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:20:29'),
(751, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:25:31'),
(752, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:37:18'),
(753, 137, 'online_lasted', 'ออนไลน์ล่าสุด', '137', '2025-12-24 15:37:59'),
(760, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2025-12-25 09:15:15'),
(761, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2025-12-25 09:17:40'),
(762, 142, 'addfriend', 'เพิ่มเพื่อน', '136', '2025-12-25 09:17:55'),
(763, 142, 'report', 'รายงาน', '#ระบบ อยากจะติดต่อ แอดมิน ครับ สำหรับการทำแอพ', '2025-12-25 09:19:55'),
(764, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2025-12-25 09:20:39'),
(765, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2025-12-25 10:13:52'),
(819, 144, 'login', 'ล็อคอินล่าสุดโดย Google', '144', '2026-01-13 15:51:35'),
(820, 144, 'online_lasted', 'ออนไลน์ล่าสุด', '144', '2026-01-13 15:54:33'),
(821, 144, 'online_lasted', 'ออนไลน์ล่าสุด', '144', '2026-01-13 15:55:04'),
(822, 144, 'online_lasted', 'ออนไลน์ล่าสุด', '144', '2026-01-13 15:55:52'),
(823, 144, 'acceptfriend', 'รับเพื่อน', '134', '2026-01-13 15:56:23'),
(824, 144, 'online_lasted', 'ออนไลน์ล่าสุด', '144', '2026-01-13 16:10:43'),
(825, 144, 'online_lasted', 'ออนไลน์ล่าสุด', '144', '2026-01-13 16:14:09'),
(848, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-16 11:53:13'),
(849, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-16 11:53:34'),
(850, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-01-16 12:57:29'),
(853, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-16 13:05:06'),
(854, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-01-16 13:08:13'),
(855, 135, 'acceptfriend', 'รับเพื่อน', '139', '2026-01-16 13:14:42'),
(856, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-01-16 13:34:46'),
(857, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-01-16 13:35:38'),
(858, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-01-16 13:37:41'),
(859, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-01-16 13:40:03'),
(863, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-16 13:58:57'),
(864, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-01-16 14:01:03'),
(870, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-16 14:51:42'),
(899, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-19 13:16:08'),
(903, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-29 15:50:13'),
(905, 137, 'login', 'ล็อคอินล่าสุดโดย Email', '137', '2026-01-29 15:51:36'),
(906, 144, 'login', 'ล็อคอินล่าสุดโดย Email', '144', '2026-01-29 15:52:02'),
(907, 143, 'login', 'ล็อคอินล่าสุดโดย Email', '143', '2026-01-29 15:52:18'),
(908, 143, 'addfriend', 'เพิ่มเพื่อน', '142', '2026-01-29 15:52:35'),
(914, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-29 17:16:26'),
(915, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-01-29 17:24:21'),
(916, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-01-29 17:24:24'),
(917, 137, 'login', 'ล็อคอินล่าสุดโดย Email', '137', '2026-01-29 17:24:55'),
(918, 144, 'login', 'ล็อคอินล่าสุดโดย Email', '144', '2026-01-29 17:25:17'),
(919, 143, 'login', 'ล็อคอินล่าสุดโดย Email', '143', '2026-01-29 17:25:50'),
(920, 143, 'online_lasted', 'ออนไลน์ล่าสุด', '143', '2026-01-29 17:31:27'),
(921, 143, 'online_lasted', 'ออนไลน์ล่าสุด', '143', '2026-01-29 17:47:35'),
(923, 143, 'login', 'ล็อคอินล่าสุดโดย Email', '143', '2026-01-29 17:48:31'),
(925, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-29 17:53:04'),
(927, 137, 'login', 'ล็อคอินล่าสุดโดย Email', '137', '2026-01-29 17:53:58'),
(928, 143, 'login', 'ล็อคอินล่าสุดโดย Email', '143', '2026-01-29 17:54:20'),
(929, 144, 'login', 'ล็อคอินล่าสุดโดย Email', '144', '2026-01-29 17:54:36'),
(934, 135, 'login', 'ล็อคอินล่าสุดโดย Email', '135', '2026-01-29 18:16:43'),
(1894, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2026-02-18 12:52:11'),
(1898, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 13:11:03'),
(1900, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 13:19:56'),
(1902, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 13:23:31'),
(1904, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 13:24:12'),
(1905, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 13:29:46'),
(1908, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 13:47:14'),
(1910, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 13:50:04'),
(1912, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 13:51:27'),
(1914, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 13:55:06'),
(1918, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2026-02-18 14:03:05'),
(1921, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:05:20'),
(1922, 135, 'addfriend', 'เพิ่มเพื่อน', '143', '2026-02-18 14:13:12'),
(1923, 135, 'edit_profile', 'เปลี่ยนรูปโปรไฟล์', '135', '2026-02-18 14:16:06'),
(1925, 135, 'report', 'รายงาน', '#ระบบ ระบบทำมาค่อนข้างแจ่มว้าวเลยครับ', '2026-02-18 14:34:18'),
(1926, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:34:51'),
(1928, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:35:00'),
(1930, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:35:02'),
(1932, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:35:04'),
(1934, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:35:27'),
(1936, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:35:49'),
(1938, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:35:58'),
(1939, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:35:59'),
(1942, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:36:48'),
(1944, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:36:57'),
(1946, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:37:16'),
(1948, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:37:17'),
(1950, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:37:35'),
(1952, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:37:36'),
(1954, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:37:47'),
(1956, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:37:50'),
(1958, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:38:31'),
(1960, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:38:36'),
(1962, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:38:41'),
(1964, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:38:46'),
(1966, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:38:48'),
(1968, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:39:13'),
(1970, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 14:39:15'),
(1981, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-18 15:26:14'),
(1985, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-19 09:32:45'),
(1987, 144, 'login', 'ล็อคอินล่าสุดโดย Google', '144', '2026-02-19 09:45:28'),
(1988, 144, 'addfriend', 'เพิ่มเพื่อน', '135', '2026-02-19 09:48:02'),
(1989, 144, 'online_lasted', 'ออนไลน์ล่าสุด', '144', '2026-02-19 09:52:35'),
(1990, 144, 'online_lasted', 'ออนไลน์ล่าสุด', '144', '2026-02-19 09:54:08'),
(1992, 135, 'login', 'ล็อคอินล่าสุดโดย Google', '135', '2026-02-19 10:00:28'),
(1993, 135, 'declinfriend', 'ปฏิเสธรับเพื่อน', '144', '2026-02-19 10:02:11'),
(1995, 135, 'online_lasted', 'ออนไลน์ล่าสุด', '135', '2026-02-19 10:03:53'),
(2035, 142, 'login', 'ล็อคอินล่าสุดโดย Google', '142', '2026-02-19 13:43:46'),
(2036, 142, 'acceptfriend', 'รับเพื่อน', '143', '2026-02-19 13:43:50'),
(2042, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2026-02-19 13:53:10'),
(2044, 142, 'online_lasted', 'ออนไลน์ล่าสุด', '142', '2026-02-19 13:57:50'),
(2327, 147, 'login', 'ล็อคอินล่าสุดโดย Google', '147', '2026-02-20 15:11:13'),
(2328, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 15:12:43'),
(2329, 147, 'login', 'ล็อคอินล่าสุดโดย Google', '147', '2026-02-20 15:21:08'),
(2330, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 15:28:19'),
(2331, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 15:28:39'),
(2332, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 15:28:41'),
(2333, 147, 'edit_profile', 'เปลี่ยนรูปโปรไฟล์', '147', '2026-02-20 15:30:03'),
(2336, 147, 'declinfriend', 'ปฏิเสธรับเพื่อน', '134', '2026-02-20 15:37:15'),
(2344, 147, 'declinfriend', 'ปฏิเสธรับเพื่อน', '134', '2026-02-20 15:44:19'),
(2346, 147, 'declinfriend', 'ปฏิเสธรับเพื่อน', '134', '2026-02-20 15:46:39'),
(2361, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 15:58:45'),
(2363, 147, 'declinfriend', 'ปฏิเสธรับเพื่อน', '134', '2026-02-20 15:58:55'),
(2365, 147, 'acceptfriend', 'รับเพื่อน', '134', '2026-02-20 15:59:10'),
(2367, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 16:19:44'),
(2369, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 16:26:41'),
(2370, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 16:28:42'),
(2372, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 16:28:52'),
(2375, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 16:29:02'),
(2379, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 17:10:47'),
(2384, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 17:18:45'),
(2385, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 17:22:17'),
(2387, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 17:22:46'),
(2389, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 17:23:39'),
(2391, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 17:23:43'),
(2394, 147, 'online_lasted', 'ออนไลน์ล่าสุด', '147', '2026-02-20 17:30:42'),
(2405, 148, 'declinfriend', 'ปฏิเสธรับเพื่อน', '134', '2026-02-23 11:48:30'),
(2408, 148, 'online_lasted', 'ออนไลน์ล่าสุด', '148', '2026-02-23 12:01:13'),
(2409, 148, 'declinfriend', 'ปฏิเสธรับเพื่อน', '134', '2026-02-23 13:10:35'),
(2413, 148, 'online_lasted', 'ออนไลน์ล่าสุด', '148', '2026-02-23 14:08:51'),
(2415, 148, 'login', 'ล็อคอินล่าสุดโดย Email', '148', '2026-02-23 15:24:12'),
(2417, 148, 'online_lasted', 'ออนไลน์ล่าสุด', '148', '2026-02-23 16:19:19'),
(3008, 150, 'login', 'ล็อคอินล่าสุดโดย Email', '150', '2026-03-16 17:41:26'),
(3032, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 10:56:02'),
(3033, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 10:56:18'),
(3034, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 10:56:31'),
(3035, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 10:56:33'),
(3036, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 11:08:29'),
(3037, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 11:08:35'),
(3038, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 11:08:38'),
(3039, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 11:08:42'),
(3040, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 11:08:48'),
(3041, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 11:08:50'),
(3042, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 11:08:51'),
(3043, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-17 11:09:16'),
(3084, 151, 'login', 'ล็อคอินล่าสุดโดย Email', '151', '2026-03-19 15:04:54'),
(3085, 151, 'addfriend', 'เพิ่มเพื่อน', '143', '2026-03-19 15:06:25'),
(3086, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-19 15:16:03'),
(3087, 151, 'edit_profile', 'อัปเดตโปรไฟล์', '151', '2026-03-19 15:21:05'),
(3088, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-19 15:26:20'),
(3089, 151, 'edit_profile', 'อัปเดตโปรไฟล์', '151', '2026-03-19 15:26:42'),
(3090, 151, 'edit_profile', 'อัปเดตโปรไฟล์', '151', '2026-03-19 15:39:10'),
(3091, 151, 'edit_profile', 'อัปเดตโปรไฟล์', '151', '2026-03-19 15:39:51'),
(3092, 151, 'edit_profile', 'อัปเดตโปรไฟล์', '151', '2026-03-19 15:41:24'),
(3093, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-03-19 15:50:33'),
(3094, 151, 'addfriend', 'เพิ่มเพื่อน', '148', '2026-03-19 15:54:30'),
(3111, 151, 'login', 'ล็อคอินล่าสุดโดย Email', '151', '2026-04-01 16:18:41'),
(3112, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-04-01 16:22:44'),
(3174, 152, 'online_lasted', 'ออนไลน์ล่าสุด', '152', '2026-04-07 10:26:50'),
(3175, 152, 'online_lasted', 'ออนไลน์ล่าสุด', '152', '2026-04-07 10:27:54'),
(3176, 152, 'online_lasted', 'ออนไลน์ล่าสุด', '152', '2026-04-07 10:28:12'),
(3177, 152, 'online_lasted', 'ออนไลน์ล่าสุด', '152', '2026-04-07 10:31:34'),
(3178, 152, 'online_lasted', 'ออนไลน์ล่าสุด', '152', '2026-04-07 10:35:36'),
(3183, 151, 'login', 'ล็อคอินล่าสุดโดย Email', '151', '2026-06-18 10:10:13'),
(3184, 151, 'addfriend', 'เพิ่มเพื่อน', '150', '2026-06-18 10:10:21'),
(3185, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:11:14'),
(3186, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:11:15'),
(3187, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:11:28'),
(3188, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:11:30'),
(3189, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:13:18'),
(3190, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:13:42'),
(3191, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:13:48'),
(3192, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:13:49'),
(3193, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:13:52'),
(3194, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:13:53'),
(3195, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:14:01'),
(3196, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:14:02'),
(3197, 151, 'login', 'ล็อคอินล่าสุดโดย Email', '151', '2026-06-18 10:15:13'),
(3198, 151, 'report', 'รายงาน', '#User: 150 Impersonation / not the account owner', '2026-06-18 10:15:21'),
(3199, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:21:24'),
(3200, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:21:28'),
(3201, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:21:41'),
(3202, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:21:49'),
(3203, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:21:56'),
(3204, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:22:04'),
(3205, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:22:07'),
(3206, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:22:28'),
(3207, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:22:31'),
(3208, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:23:11'),
(3209, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:23:20'),
(3210, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:25:05'),
(3211, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:25:07'),
(3212, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:25:21'),
(3213, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:25:42'),
(3214, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:25:51'),
(3215, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:26:14'),
(3216, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:26:16'),
(3217, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:26:55'),
(3218, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:26:57'),
(3219, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:27:04'),
(3220, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:27:06'),
(3221, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:27:18'),
(3222, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:27:20'),
(3223, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 10:27:21'),
(3224, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 10:27:23'),
(3225, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 10:28:36'),
(3226, 151, 'login', 'ล็อคอินล่าสุดโดย Email', '151', '2026-06-18 10:56:29'),
(3227, 151, 'login', 'ล็อคอินล่าสุดโดย Email', '151', '2026-06-18 11:01:44'),
(3228, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:01:50'),
(3229, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:01:52'),
(3230, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:01:54'),
(3231, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:01:55'),
(3232, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:01:58'),
(3233, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:02:01'),
(3234, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:02:04'),
(3235, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:02:11'),
(3236, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:02:14'),
(3237, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:02:16'),
(3238, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:02:16'),
(3239, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:02:16'),
(3240, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:02:17'),
(3241, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:02:17'),
(3242, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:02:17'),
(3243, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:02:17'),
(3244, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:02:17'),
(3245, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:02:18'),
(3246, 151, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:02:18'),
(3247, 151, 'interest', 'สนใจบอส', '77', '2026-06-18 11:02:18'),
(3250, 155, 'interest', 'สนใจบอส', '77', '2026-06-18 11:32:34'),
(3251, 155, 'addfriend', 'เพิ่มเพื่อน', '150', '2026-06-18 11:32:51'),
(3252, 155, 'addfriend', 'เพิ่มเพื่อน', '147', '2026-06-18 11:32:56'),
(3253, 155, 'addfriend', 'เพิ่มเพื่อน', '144', '2026-06-18 11:33:01'),
(3254, 155, 'addfriend', 'เพิ่มเพื่อน', '139', '2026-06-18 11:33:11'),
(3255, 155, 'report', 'รายงาน', '#User: 143 สแปม / ชวนเรื่อยเปื่อย', '2026-06-18 11:33:21'),
(3256, 155, 'addfriend', 'เพิ่มเพื่อน', '143', '2026-06-18 11:37:08'),
(3257, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 11:37:38'),
(3258, 155, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 11:38:34'),
(3259, 155, 'interest', 'สนใจบอส', '77', '2026-06-18 11:38:38'),
(3260, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 11:41:50'),
(3261, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 11:52:23'),
(3262, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 11:53:56'),
(3263, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:25:06'),
(3264, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:36:17'),
(3265, 155, '', 'เช็คชื่อประจำวัน วันที่ 1 ได้รับ 10 แต้ม', '155', '2026-06-18 13:36:26'),
(3266, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:37:31'),
(3267, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:37:39'),
(3268, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:38:13'),
(3269, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:38:38'),
(3270, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:39:43'),
(3271, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:41:14'),
(3272, 155, '', 'เช็คชื่อประจำวัน วันที่ 1 ได้รับ 10 แต้ม', '155', '2026-06-18 13:41:22'),
(3273, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:42:08'),
(3274, 155, '', 'เช็คชื่อประจำวัน วันที่ 1 ได้รับ 10 แต้ม', '155', '2026-06-18 13:43:50'),
(3275, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:46:10'),
(3276, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 13:57:21'),
(3277, 155, 'interest', 'ยกเลิกสนใจบอส', '77', '2026-06-18 14:02:07'),
(3278, 155, 'interest', 'สนใจบอส', '77', '2026-06-18 14:02:10'),
(3279, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 14:08:47'),
(3280, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 14:09:39'),
(3281, 151, 'login', 'ล็อคอินล่าสุดโดย Email', '151', '2026-06-18 14:12:53'),
(3282, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:13:05'),
(3283, 151, '', 'เช็คชื่อประจำวัน วันที่ 1 ได้รับ 10 แต้ม', '151', '2026-06-18 14:13:13'),
(3284, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:13:27'),
(3285, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:27:03'),
(3286, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:27:14'),
(3287, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:27:22'),
(3288, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:28:14'),
(3289, 151, '', 'แลกซื้อไอเทม กรอบรูปโปรไฟล์หรูหรา ใช้ไป 150 แต้ม', '3', '2026-06-18 14:33:35'),
(3290, 151, '', 'แลกซื้อไอเทม สิทธิ์เปลี่ยนชื่อ 1 ครั้ง ใช้ไป 200 แต้ม', '4', '2026-06-18 14:33:49'),
(3291, 151, '', 'แลกซื้อไอเทม บัตร VIP 3 วัน ใช้ไป 300 แต้ม', '1', '2026-06-18 14:34:04'),
(3292, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:39:09'),
(3293, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:39:24'),
(3294, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:39:28'),
(3295, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:39:37'),
(3296, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 14:42:46'),
(3297, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 15:05:38'),
(3298, 151, '', 'เช็คชื่อประจำวัน วันที่ 1 ได้รับ 10 แต้ม', '151', '2026-06-18 15:06:59'),
(3299, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 15:13:01'),
(3300, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 15:24:56'),
(3301, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 15:51:15'),
(3302, 155, 'login', 'ล็อคอินล่าสุดโดย Email', '155', '2026-06-18 15:51:41'),
(3303, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 15:52:43'),
(3304, 155, 'addfriend', 'เพิ่มเพื่อน', '151', '2026-06-18 15:52:54'),
(3305, 151, 'login', 'ล็อคอินล่าสุดโดย Email', '151', '2026-06-18 15:53:12'),
(3306, 151, 'acceptfriend', 'รับเพื่อน', '155', '2026-06-18 15:53:19'),
(3307, 151, '', 'เช็คชื่อโบนัสผ่านโฆษณา ได้รับ 10 แต้ม', '151', '2026-06-18 16:22:11'),
(3308, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 16:26:05'),
(3309, 151, '', 'เช็คชื่อโบนัสผ่านโฆษณา ได้รับ 10 แต้ม', '151', '2026-06-18 16:27:28'),
(3310, 151, '', 'เช็คชื่อโบนัสผ่านโฆษณา ได้รับ 10 แต้ม', '151', '2026-06-18 16:28:09'),
(3311, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 16:30:12'),
(3312, 151, '', 'เช็คชื่อประจำวัน วันที่ 1 ได้รับ 10 แต้ม', '151', '2026-06-18 16:30:58'),
(3313, 151, '', 'เช็คชื่อโบนัสผ่านโฆษณา ได้รับ 10 แต้ม', '151', '2026-06-18 16:31:11'),
(3314, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 16:33:29'),
(3315, 151, '', 'เช็คชื่อประจำวัน วันที่ 1 ได้รับ 10 แต้ม', '151', '2026-06-18 16:33:39'),
(3316, 151, '', 'เช็คชื่อโบนัสผ่านโฆษณา ได้รับ 10 แต้ม', '151', '2026-06-18 16:34:02'),
(3317, 151, 'online_lasted', 'ออนไลน์ล่าสุด', '151', '2026-06-18 16:46:31'),
(3318, 151, 'login', 'ล็อคอินล่าสุดโดย Email', '151', '2026-06-18 17:00:16'),
(3319, 155, 'login', 'ล็อคอินล่าสุดโดย Email', '155', '2026-06-18 17:00:53'),
(3320, 155, '', 'เช็คชื่อโบนัสผ่านโฆษณา ได้รับ 10 แต้ม', '155', '2026-06-18 17:02:00'),
(3321, 155, 'login', 'ล็อคอินล่าสุดโดย Email', '155', '2026-06-18 17:03:37'),
(3322, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 17:06:16'),
(3323, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 17:25:39'),
(3326, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 17:39:12'),
(3327, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 17:49:27'),
(3328, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 17:53:02'),
(3329, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 17:53:07'),
(3330, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 17:53:38'),
(3331, 155, '', 'แลกซื้อไอเทม สิทธิ์เปลี่ยนชื่อ 1 ครั้ง ใช้ไป 200 แต้ม', '4', '2026-06-18 17:56:51'),
(3332, 155, '', 'แลกซื้อไอเทม สิทธิ์เปลี่ยนชื่อ 1 ครั้ง ใช้ไป 200 แต้ม', '4', '2026-06-18 17:57:05'),
(3333, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 17:57:40'),
(3334, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 18:01:03'),
(3335, 155, 'online_lasted', 'ออนไลน์ล่าสุด', '155', '2026-06-18 18:03:37'),
(3336, 155, '', 'แลกซื้อไอเทม บัตร VIP 1 วัน ใช้ไป 150 แต้ม', '3', '2026-06-18 18:04:06'),
(3337, 155, '', 'แลกซื้อไอเทม บัตร VIP 1 วัน ใช้ไป 150 แต้ม', '3', '2026-06-18 18:04:14'),
(3338, 155, '', 'แลกซื้อไอเทม บัตร VIP 1 วัน ใช้ไป 150 แต้ม', '3', '2026-06-18 18:05:12'),
(3339, 155, '', 'แลกซื้อไอเทม บัตร VIP 1 วัน ใช้ไป 150 แต้ม', '3', '2026-06-18 18:05:19');

-- --------------------------------------------------------

--
-- Table structure for table `user_raid_rooms`
--

CREATE TABLE `user_raid_rooms` (
  `id` int(11) NOT NULL,
  `room_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `role` enum('owner','member') NOT NULL DEFAULT 'member',
  `joined_at` datetime NOT NULL,
  `friend_ready` tinyint(1) NOT NULL DEFAULT 0,
  `friend_ready_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_raid_rooms`
--

INSERT INTO `user_raid_rooms` (`id`, `room_id`, `user_id`, `role`, `joined_at`, `friend_ready`, `friend_ready_at`) VALUES
(1677, 683, 135, 'owner', '2025-12-18 13:50:38', 0, NULL),
(1688, 688, 135, 'owner', '2025-12-18 16:15:46', 0, NULL),
(1692, 690, 135, 'owner', '2025-12-18 16:29:07', 0, NULL),
(1704, 695, 135, 'owner', '2025-12-19 14:02:34', 0, NULL),
(1706, 696, 135, 'owner', '2025-12-19 14:48:28', 0, NULL),
(1709, 698, 135, 'owner', '2025-12-19 16:32:16', 0, NULL),
(1710, 699, 135, 'owner', '2025-12-19 16:34:18', 0, NULL),
(1713, 698, 137, 'member', '2025-12-19 16:37:23', 1, '2025-12-19 16:37:37'),
(1714, 702, 135, 'owner', '2025-12-19 17:02:19', 0, NULL),
(1724, 709, 135, 'owner', '2025-12-20 15:57:58', 0, NULL),
(1726, 710, 135, 'owner', '2025-12-20 21:33:44', 0, NULL),
(1728, 710, 139, 'member', '2025-12-20 22:02:27', 1, '2025-12-20 22:02:29'),
(1730, 712, 139, 'owner', '2025-12-21 12:58:57', 0, NULL),
(1731, 713, 142, 'owner', '2025-12-21 17:06:24', 0, NULL),
(1732, 714, 144, 'owner', '2025-12-21 17:37:10', 0, NULL),
(1733, 714, 139, 'member', '2025-12-21 17:38:34', 1, '2025-12-21 17:38:38'),
(1734, 715, 139, 'owner', '2025-12-21 23:30:19', 0, NULL),
(1735, 716, 139, 'owner', '2025-12-22 00:01:45', 0, NULL),
(1736, 717, 142, 'owner', '2025-12-22 13:43:05', 0, NULL),
(1739, 718, 142, 'owner', '2025-12-22 15:04:53', 0, NULL),
(1741, 719, 142, 'owner', '2025-12-22 15:14:17', 0, NULL),
(1743, 720, 142, 'owner', '2025-12-23 08:46:39', 0, NULL),
(1747, 721, 142, 'owner', '2025-12-23 11:41:00', 0, NULL),
(1748, 722, 142, 'owner', '2025-12-23 11:43:03', 0, NULL),
(1749, 723, 142, 'owner', '2025-12-23 11:45:19', 0, NULL),
(1750, 724, 142, 'owner', '2025-12-23 11:47:39', 0, NULL),
(1755, 726, 142, 'owner', '2025-12-23 16:13:21', 0, NULL),
(1756, 726, 139, 'member', '2025-12-23 16:54:51', 1, '2025-12-23 16:54:53'),
(1757, 727, 139, 'owner', '2025-12-23 16:57:37', 0, NULL),
(1758, 728, 139, 'owner', '2025-12-23 17:01:01', 0, NULL),
(1798, 762, 142, 'owner', '2025-12-24 14:43:16', 0, NULL),
(1799, 763, 143, 'owner', '2025-12-24 14:43:35', 0, NULL),
(1800, 764, 144, 'owner', '2025-12-24 14:43:50', 0, NULL),
(1802, 765, 137, 'owner', '2025-12-24 15:11:18', 0, NULL),
(1803, 766, 137, 'owner', '2025-12-24 15:33:43', 0, NULL),
(1806, 768, 142, 'owner', '2025-12-25 09:17:05', 0, NULL),
(1838, 792, 144, 'owner', '2026-01-13 16:07:13', 0, NULL),
(1870, 809, 135, 'owner', '2026-01-16 13:02:11', 0, NULL),
(2102, 893, 135, 'owner', '2026-02-18 13:33:08', 0, NULL),
(2120, 897, 135, 'owner', '2026-02-18 14:14:17', 0, NULL),
(2123, 898, 135, 'owner', '2026-02-18 14:30:33', 0, NULL),
(2127, 901, 135, 'owner', '2026-02-19 09:34:26', 0, NULL),
(2131, 901, 144, 'member', '2026-02-19 09:54:30', 1, '2026-02-19 09:54:34'),
(2134, 903, 135, 'owner', '2026-02-19 10:11:03', 0, NULL),
(2164, 917, 142, 'owner', '2026-02-19 13:48:32', 0, NULL),
(2242, 943, 147, 'owner', '2026-02-20 15:35:59', 0, NULL),
(2256, 949, 147, 'owner', '2026-02-20 17:30:52', 0, NULL),
(2275, 956, 148, 'owner', '2026-02-23 12:47:32', 0, NULL),
(2294, 961, 148, 'owner', '2026-02-23 15:09:11', 0, NULL),
(2295, 962, 148, 'owner', '2026-02-23 15:19:23', 0, NULL),
(2313, 964, 148, 'owner', '2026-02-23 16:05:10', 0, NULL),
(2316, 966, 148, 'owner', '2026-02-23 16:19:42', 0, NULL),
(2321, 968, 148, 'owner', '2026-02-23 16:47:53', 0, NULL),
(2426, 1030, 151, 'owner', '2026-03-19 15:06:49', 0, NULL),
(2432, 1036, 151, 'owner', '2026-06-18 11:02:30', 0, NULL),
(2433, 1037, 155, 'owner', '2026-06-18 11:32:39', 0, NULL),
(2434, 1038, 151, 'owner', '2026-06-18 14:49:59', 0, NULL),
(2435, 1039, 151, 'owner', '2026-06-18 15:53:27', 0, NULL),
(2436, 1040, 151, 'owner', '2026-06-18 16:52:30', 0, NULL),
(2437, 1040, 155, 'member', '2026-06-18 17:03:53', 1, '2026-06-18 17:03:55');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `boss_event`
--
ALTER TABLE `boss_event`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id` (`id`,`boss_event_name`,`bage_color`);

--
-- Indexes for table `boss_interest`
--
ALTER TABLE `boss_interest`
  ADD PRIMARY KEY (`id`),
  ADD KEY `raid_boss_id` (`raid_boss_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `cancel_reasons`
--
ALTER TABLE `cancel_reasons`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `chat`
--
ALTER TABLE `chat`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_room_id_id` (`raid_rooms_id`,`id`),
  ADD KEY `idx_room_created` (`raid_rooms_id`,`created_at`),
  ADD KEY `fk_chat_user` (`sender`);

--
-- Indexes for table `chat_friends`
--
ALTER TABLE `chat_friends`
  ADD PRIMARY KEY (`id`),
  ADD KEY `friendship_id` (`friendship_id`,`created_at`),
  ADD KEY `sender` (`sender`),
  ADD KEY `status` (`status`);

--
-- Indexes for table `events`
--
ALTER TABLE `events`
  ADD PRIMARY KEY (`id`),
  ADD KEY `created_by` (`created_by`);

--
-- Indexes for table `friendships`
--
ALTER TABLE `friendships`
  ADD PRIMARY KEY (`id`),
  ADD KEY `friendships_ibfk_1` (`requester_id`),
  ADD KEY `friendships_ibfk_2` (`addressee_id`);

--
-- Indexes for table `menu`
--
ALTER TABLE `menu`
  ADD PRIMARY KEY (`id`),
  ADD KEY `type` (`type`,`status`);

--
-- Indexes for table `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sent_by` (`sent_by`);

--
-- Indexes for table `otp`
--
ALTER TABLE `otp`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `otp` (`otp`),
  ADD KEY `type` (`type`),
  ADD KEY `status` (`status`);

--
-- Indexes for table `raid_boss`
--
ALTER TABLE `raid_boss`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_time` (`start_date`,`end_date`),
  ADD KEY `idx_name` (`pokemon_name`),
  ADD KEY `idx_pid` (`pokemon_id`),
  ADD KEY `pokemon_tier` (`pokemon_tier`),
  ADD KEY `type` (`type`,`special`),
  ADD KEY `event` (`boss_event_id`);

--
-- Indexes for table `raid_boss_counter`
--
ALTER TABLE `raid_boss_counter`
  ADD PRIMARY KEY (`id`),
  ADD KEY `raid_boss_id` (`raid_boss_id`);

--
-- Indexes for table `raid_cancel_reasons`
--
ALTER TABLE `raid_cancel_reasons`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `room_id_2` (`room_id`),
  ADD UNIQUE KEY `room_id_3` (`room_id`),
  ADD KEY `room_id` (`room_id`),
  ADD KEY `fk_cancel_reasons` (`cancel_reasons_id`);

--
-- Indexes for table `raid_member_reviews`
--
ALTER TABLE `raid_member_reviews`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_room_target` (`room_id`,`target_user_id`),
  ADD UNIQUE KEY `room_id` (`room_id`,`target_user_id`),
  ADD KEY `idx_target` (`target_user_id`),
  ADD KEY `reviewer_id` (`reviewer_id`),
  ADD KEY `target_user_id` (`target_user_id`,`rating`);

--
-- Indexes for table `raid_reviews`
--
ALTER TABLE `raid_reviews`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_room_user` (`room_id`,`user_id`),
  ADD KEY `idx_room` (`room_id`),
  ADD KEY `fk_rr_user` (`user_id`);

--
-- Indexes for table `raid_rooms`
--
ALTER TABLE `raid_rooms`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_start_status` (`start_time`,`status`),
  ADD KEY `fk_rooms_owner` (`owner_id`),
  ADD KEY `raid_boss_id` (`raid_boss_id`,`boss`);

--
-- Indexes for table `raid_rooms_log`
--
ALTER TABLE `raid_rooms_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `room_id` (`room_id`,`user_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `type` (`type`);

--
-- Indexes for table `redemption_history`
--
ALTER TABLE `redemption_history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `item_id` (`item_id`);

--
-- Indexes for table `reports`
--
ALTER TABLE `reports`
  ADD PRIMARY KEY (`id`),
  ADD KEY `reporter_id` (`reporter_id`);

--
-- Indexes for table `shop_items`
--
ALTER TABLE `shop_items`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `system_configs`
--
ALTER TABLE `system_configs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `uniq_users_email` (`email`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `uniq_users_username` (`username`),
  ADD KEY `device_token` (`device_token`);

--
-- Indexes for table `user_device`
--
ALTER TABLE `user_device`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id_2` (`user_id`),
  ADD KEY `user_id` (`user_id`,`app_version`,`language`,`country`);

--
-- Indexes for table `user_items`
--
ALTER TABLE `user_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `item_id` (`item_id`);

--
-- Indexes for table `user_log`
--
ALTER TABLE `user_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `type` (`type`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `target` (`target`);

--
-- Indexes for table `user_raid_rooms`
--
ALTER TABLE `user_raid_rooms`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_room_user` (`room_id`,`user_id`),
  ADD KEY `idx_room` (`room_id`),
  ADD KEY `fk_urr_user` (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `boss_event`
--
ALTER TABLE `boss_event`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `boss_interest`
--
ALTER TABLE `boss_interest`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=94;

--
-- AUTO_INCREMENT for table `cancel_reasons`
--
ALTER TABLE `cancel_reasons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `chat`
--
ALTER TABLE `chat`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=781;

--
-- AUTO_INCREMENT for table `chat_friends`
--
ALTER TABLE `chat_friends`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=776;

--
-- AUTO_INCREMENT for table `events`
--
ALTER TABLE `events`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `friendships`
--
ALTER TABLE `friendships`
  MODIFY `id` int(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=158;

--
-- AUTO_INCREMENT for table `menu`
--
ALTER TABLE `menu`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- AUTO_INCREMENT for table `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `otp`
--
ALTER TABLE `otp`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=86;

--
-- AUTO_INCREMENT for table `raid_boss`
--
ALTER TABLE `raid_boss`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=150;

--
-- AUTO_INCREMENT for table `raid_boss_counter`
--
ALTER TABLE `raid_boss_counter`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=105;

--
-- AUTO_INCREMENT for table `raid_cancel_reasons`
--
ALTER TABLE `raid_cancel_reasons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT for table `raid_member_reviews`
--
ALTER TABLE `raid_member_reviews`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=102;

--
-- AUTO_INCREMENT for table `raid_reviews`
--
ALTER TABLE `raid_reviews`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=532;

--
-- AUTO_INCREMENT for table `raid_rooms`
--
ALTER TABLE `raid_rooms`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1041;

--
-- AUTO_INCREMENT for table `raid_rooms_log`
--
ALTER TABLE `raid_rooms_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2416;

--
-- AUTO_INCREMENT for table `redemption_history`
--
ALTER TABLE `redemption_history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `reports`
--
ALTER TABLE `reports`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT for table `shop_items`
--
ALTER TABLE `shop_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=156;

--
-- AUTO_INCREMENT for table `user_device`
--
ALTER TABLE `user_device`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;

--
-- AUTO_INCREMENT for table `user_items`
--
ALTER TABLE `user_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `user_log`
--
ALTER TABLE `user_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3340;

--
-- AUTO_INCREMENT for table `user_raid_rooms`
--
ALTER TABLE `user_raid_rooms`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2438;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `boss_interest`
--
ALTER TABLE `boss_interest`
  ADD CONSTRAINT `boss_interest_ibfk_1` FOREIGN KEY (`raid_boss_id`) REFERENCES `raid_boss` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `boss_interest_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `chat`
--
ALTER TABLE `chat`
  ADD CONSTRAINT `fk_chat_room` FOREIGN KEY (`raid_rooms_id`) REFERENCES `raid_rooms` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_chat_user` FOREIGN KEY (`sender`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `chat_friends`
--
ALTER TABLE `chat_friends`
  ADD CONSTRAINT `chat_friends_ibfk_1` FOREIGN KEY (`sender`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `chat_friends_ibfk_2` FOREIGN KEY (`friendship_id`) REFERENCES `friendships` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `events`
--
ALTER TABLE `events`
  ADD CONSTRAINT `events_ibfk_1` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `friendships`
--
ALTER TABLE `friendships`
  ADD CONSTRAINT `friendships_ibfk_1` FOREIGN KEY (`requester_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `friendships_ibfk_2` FOREIGN KEY (`addressee_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `notifications`
--
ALTER TABLE `notifications`
  ADD CONSTRAINT `notifications_ibfk_1` FOREIGN KEY (`sent_by`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `otp`
--
ALTER TABLE `otp`
  ADD CONSTRAINT `otp_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `raid_boss`
--
ALTER TABLE `raid_boss`
  ADD CONSTRAINT `raid_boss_ibfk_1` FOREIGN KEY (`boss_event_id`) REFERENCES `boss_event` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `raid_boss_counter`
--
ALTER TABLE `raid_boss_counter`
  ADD CONSTRAINT `raid_boss_counter_ibfk_1` FOREIGN KEY (`raid_boss_id`) REFERENCES `raid_boss` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `raid_cancel_reasons`
--
ALTER TABLE `raid_cancel_reasons`
  ADD CONSTRAINT `fk_cancel_reasons` FOREIGN KEY (`cancel_reasons_id`) REFERENCES `cancel_reasons` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_raid_rooms` FOREIGN KEY (`room_id`) REFERENCES `raid_rooms` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `raid_member_reviews`
--
ALTER TABLE `raid_member_reviews`
  ADD CONSTRAINT `raid_member_reviews_ibfk_1` FOREIGN KEY (`room_id`) REFERENCES `raid_rooms` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `raid_member_reviews_ibfk_2` FOREIGN KEY (`reviewer_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `raid_member_reviews_ibfk_3` FOREIGN KEY (`target_user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `raid_reviews`
--
ALTER TABLE `raid_reviews`
  ADD CONSTRAINT `fk_rr_room` FOREIGN KEY (`room_id`) REFERENCES `raid_rooms` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_rr_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `raid_rooms`
--
ALTER TABLE `raid_rooms`
  ADD CONSTRAINT `fk_rooms_owner` FOREIGN KEY (`owner_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `raid_rooms_ibfk_1` FOREIGN KEY (`raid_boss_id`) REFERENCES `raid_boss` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `raid_rooms_log`
--
ALTER TABLE `raid_rooms_log`
  ADD CONSTRAINT `raid_rooms_log_ibfk_1` FOREIGN KEY (`room_id`) REFERENCES `raid_rooms` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `raid_rooms_log_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `redemption_history`
--
ALTER TABLE `redemption_history`
  ADD CONSTRAINT `redemption_history_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `redemption_history_ibfk_2` FOREIGN KEY (`item_id`) REFERENCES `shop_items` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `reports`
--
ALTER TABLE `reports`
  ADD CONSTRAINT `reports_ibfk_1` FOREIGN KEY (`reporter_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `user_device`
--
ALTER TABLE `user_device`
  ADD CONSTRAINT `user_device_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `user_items`
--
ALTER TABLE `user_items`
  ADD CONSTRAINT `user_items_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `user_items_ibfk_2` FOREIGN KEY (`item_id`) REFERENCES `shop_items` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `user_log`
--
ALTER TABLE `user_log`
  ADD CONSTRAINT `user_log_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `user_raid_rooms`
--
ALTER TABLE `user_raid_rooms`
  ADD CONSTRAINT `fk_urr_room` FOREIGN KEY (`room_id`) REFERENCES `raid_rooms` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_urr_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
